[
    {
        "id": "b75444a6-1121-42c0-8321-fbfd543136c3",
        "word": "acclimatise",
        "persian": "خو گرفتن به آب و هوای و مکان جدید",
        "definition": "To acclimatise means to gradually adjust to a new climate or environment, typically involving changes in temperature, altitude, humidity, or other environmental factors. It's the process of your body adapting to these conditions over time, reducing the risk of discomfort, illness, or injury.\n\nSynonyms: adapt, adjust, habituate, accommodate, toughen.\n",
        "exampleA": "Why is it that it rains all the time in England?\" \"Don't worry - you'll soon acclimatize.\"\"",
        "exampleB": "It takes a few days to acclimatise to the high altitude.",
        "exampleC": "The plants were acclimatised to the greenhouse before being moved outside.",
        "status": "seen"
    },
    {
        "id": "02109b78-0df0-4bdc-828e-ab2e4d0ea10d",
        "word": "asteroid",
        "persian": "سیارک",
        "definition": "An asteroid is a rocky, metallic body orbiting the Sun that is too small to be classified as a planet. Often referred to as minor planets or planetoids, asteroids are remnants from the solar system's early formation that never coalesced into a full-sized planet. They are mostly found in the asteroid belt between Mars and Jupiter, but some can also be found in other parts of the solar system, including near-Earth orbits.\n\nSynonyms: minor planet, planetoid, space rock.\n",
        "exampleA": "The asteroid narrowly missed Earth, causing widespread panic.",
        "exampleB": "Scientists are studying the composition of the asteroid belt.",
        "exampleC": "A large asteroid impact is believed to have caused the extinction of the dinosaurs.",
        "status": "learned"
    },
    {
        "id": "2a493cd0-08c6-41cb-ade8-70d7adeb29ad",
        "word": "astronaut",
        "persian": "فضانورد",
        "definition": "An astronaut is a person trained, equipped, and deployed to travel and work in outer space. They pilot, command, or serve as crew members of a spacecraft. Astronauts conduct scientific research, deploy satellites, and perform repairs or maintenance in the challenging environment beyond Earth's atmosphere.\n\nSynonyms: cosmonaut, spaceman, spacefarer, star traveler.\n",
        "exampleA": "The astronaut floated weightlessly in the vast expanse of space.",
        "exampleB": "Many children dream of becoming an astronaut and exploring other planets.",
        "exampleC": "The astronaut skillfully maneuvered the robotic arm to repair the satellite.",
        "status": "learned"
    },
    {
        "id": "8c26da60-fdd7-4cab-881e-41048b27cd14",
        "word": "atmosphere",
        "persian": "جو",
        "definition": "\"Atmosphere\" refers to the envelope of gases surrounding a planet or other celestial body, held in place by gravity. It can also describe a pervasive mood or feeling associated with a place, situation, or creative work. Essentially, it's the air we breathe and the vibe we sense.\n\nSynonyms: ambiance, aura, environment, climate, feeling, mood.\n",
        "exampleA": "The restaurant's warm lighting and soft music created a romantic atmosphere.",
        "exampleB": "The atmosphere on the team was tense after their recent loss.",
        "exampleC": "Scientists are studying how pollution is affecting the Earth's atmosphere.",
        "status": "learned"
    },
    {
        "id": "7980ab35-ffc1-4241-94ab-d5700090c3de",
        "word": "barely",
        "persian": "\"Barely\" بسته به متن، می‌تونه به صورت‌های مختلفی ترجمه بشه، اما رایج‌ترین معادل‌هاش این‌ها هستن: \"به سختی\"، \"به ندرت\"، \"تقریباً نه\"، \"کم مانده بود که\".\n",
        "definition": "hardly",
        "exampleA": "She barely had enough money to pay the rent.",
        "exampleB": "I could barely hear him over the loud music.",
        "exampleC": "The car barely made it up the steep hill.",
        "status": "seen"
    },
    {
        "id": "0c8f0722-ed86-482d-a593-0b3ad9ff5425",
        "word": "cathedral",
        "persian": "کلیسای جامع",
        "definition": "A cathedral is a large and important church that serves as the principal church of a diocese, headed by a bishop. It is typically grand in scale and architectural design, reflecting its significance as a center of religious and administrative power.\n\nSynonyms: basilica, minster, duomo, metropolitan church\n",
        "exampleA": "The imposing cathedral dominated the city skyline.",
        "exampleB": "They held their wedding ceremony in the grand cathedral.",
        "exampleC": "Centuries of history were etched into the cathedral's ancient stones.",
        "status": "seen"
    },
    {
        "id": "ac17f634-dbc2-4b35-8a93-cf1fef6f90c6",
        "word": "celestial",
        "persian": "سماوی، آسمانی",
        "definition": "\"Celestial\" refers to anything related to the sky, outer space, or the heavens. It often implies a sense of beauty, wonder, or divinity associated with the cosmos. Think of stars, planets, and galaxies when you hear the word.\n\nSynonyms: Heavenly, Cosmic, Stellar, Ethereal, Astral\n",
        "exampleA": "celestial bodies",
        "exampleB": "The telescope revealed a breathtaking view of celestial bodies.",
        "exampleC": "Her dress was adorned with shimmering, celestial embroidery.",
        "status": "seen"
    },
    {
        "id": "67a1e67e-2aae-40a9-81a8-d9e7e7b1dcee",
        "word": "colonise",
        "persian": "استعمار کردن، ساکن شدن در",
        "definition": "To colonise means to establish control over an area or people, often involving settlement and exploitation of resources. It typically refers to a powerful nation or group taking over another territory and imposing its political, economic, and cultural systems on the indigenous population.\n\nSynonyms: occupy, settle, subjugate, dominate, exploit.\n",
        "exampleA": "European powers sought to colonise Africa for its resources.",
        "exampleB": "The bacteria began to colonise the wound, leading to infection.",
        "exampleC": "Humans may one day colonise Mars, establishing a permanent settlement.",
        "status": "seen"
    },
    {
        "id": "8fc5fd5d-2e6b-43b3-8d61-7d274f11bd62",
        "word": "commercial",
        "persian": "تجاری",
        "definition": "\"Commercial\" fundamentally refers to something related to commerce or trade, especially when concerned with earning a profit. It generally describes activities, products, or services that are intended to be bought and sold on the open market.\n\nSynonyms: mercantile, for-profit, business-related, economic, sales-oriented.\n",
        "exampleA": "The new detergent was launched with a catchy commercial during the Super Bowl.",
        "exampleB": "The artist decided to forgo commercial success in favor of artistic integrity.",
        "exampleC": "We are considering a commercial loan to expand our business operations.",
        "status": "learned"
    },
    {
        "id": "dabcd18b-8bbe-4cff-9a11-75c84aa5d054",
        "word": "composition",
        "persian": "ترکیب چیزی، شاکله",
        "definition": "\"Composition\" refers to the act of combining elements or parts to create a unified whole. It's the process of arranging or organizing things, whether it's notes in music, colors in a painting, words in writing, or objects in a photograph, to achieve a desired effect or convey a specific message.\n\nSynonyms: arrangement, structure, organization, formation, configuration.\n",
        "exampleA": "The painting's vibrant composition immediately caught my eye.",
        "exampleB": "His musical composition was a complex and beautiful symphony.",
        "exampleC": "The soil's composition is crucial for healthy plant growth.",
        "status": "seen"
    },
    {
        "id": "a998a046-e464-4edd-a942-b997ca1bb8bc",
        "word": "conquer",
        "persian": "فتح کردن",
        "definition": "To conquer means to overcome and take control of a place or people, often through military force. It signifies complete victory and subjugation, establishing dominance over the defeated.\n\nSynonyms: defeat, vanquish, subdue, overcome, triumph over.\n",
        "exampleA": "The army planned to conquer the neighboring territory.",
        "exampleB": "She managed to conquer her fear of heights by skydiving.",
        "exampleC": "The athlete aimed to conquer the world record in the marathon.",
        "status": "seen"
    },
    {
        "id": "383ac491-8ab5-4fc8-afee-8e590cfeb6e3",
        "word": "contemplate",
        "persian": "در نظر داشتن، در سر پروراندن",
        "definition": "To contemplate means to think deeply and carefully about something, often over a period of time. It involves considering different aspects of a subject, weighing options, and reflecting on its significance or implications. It suggests a deliberate and thoughtful process of exploration, usually leading to a clearer understanding or a decision.\n\nSynonyms: ponder, meditate, reflect, ruminate, deliberate\n",
        "exampleA": "I need a quiet moment to contemplate my next move.",
        "exampleB": "She would often contemplate the meaning of life while staring at the stars.",
        "exampleC": "The jury will contemplate the evidence before reaching a verdict.",
        "status": "seen"
    },
    {
        "id": "9190e124-11db-4095-8de4-e9366e1adc55",
        "word": "cosmic",
        "persian": "کیهانی",
        "definition": "\"Cosmic\" refers to anything related to the cosmos, the universe, or space in its vastness and totality. It implies a scale or perspective that is incredibly large, grand, and often mysterious, encompassing all that exists beyond Earth. It can also suggest a sense of order, interconnectedness, or fundamental importance within the grand scheme of things.\n\nSynonyms: universal, astronomical, celestial, galactic, interstellar.\n",
        "exampleA": "cosmic dust/radiation",
        "exampleB": "The Hubble telescope captured a stunning image of a cosmic nebula.",
        "exampleC": "Her ambitions were cosmic, reaching far beyond the limitations of Earth.",
        "status": "seen"
    },
    {
        "id": "e47062a4-0ae3-49c7-8fbb-17fc1c3625e5",
        "word": "cosmos",
        "persian": "جهان هستی، کیهان",
        "definition": "\"Cosmos\" refers to the universe understood as a complex and orderly system. It encompasses everything that exists, from the smallest subatomic particles to the largest galaxies, and suggests a harmonious and structured whole rather than just random chaos. It emphasizes the interconnectedness and inherent organization of the universe.\n\nSynonyms: universe, macrocosm, totality, creation, world.\n",
        "exampleA": "The telescope allowed us to gaze into the depths of the cosmos.",
        "exampleB": "She felt a profound connection to the cosmos while meditating under the stars.",
        "exampleC": "Scientists are still trying to understand the origins and evolution of the cosmos.",
        "status": "seen"
    },
    {
        "id": "c9a15a4c-756b-4097-b376-1b00bdcce2cc",
        "word": "crater",
        "persian": "دهانه آتشفشان یا شبیه آن بر روی شطح زمین",
        "definition": "A crater is a bowl-shaped depression, or cavity, in the ground, often caused by an impact event like a meteorite strike or a volcanic explosion. It can also refer to a similar formation on a celestial body like the moon or a planet.\n    \nSynonyms: depression, bowl, hollow, basin, cavity, pit\n",
        "exampleA": "With a good telescope, you can see craters on the moon./ a bomb crater",
        "exampleB": "The meteor's impact left a large crater in the desert landscape.",
        "exampleC": "After the explosion, the area was left with a crater where the building once stood.",
        "status": "seen"
    },
    {
        "id": "a2e68130-0a95-44fe-9880-63142c9e4ff6",
        "word": "debris",
        "persian": "آوار، تکه پاره",
        "definition": "Debris refers to scattered pieces of waste, wreckage, or remains, typically resulting from destruction, damage, or disposal. It often implies something that is unwanted or discarded.\n\nSynonyms: rubble, wreckage, detritus, fragments, refuse.\n",
        "exampleA": "After the earthquake, rescuers began digging through the debris in search of survivors.",
        "exampleB": "The hurricane left a trail of debris scattered across the coastline.",
        "exampleC": "Clean-up crews worked tirelessly to remove the debris from the collapsed building.",
        "status": "seen"
    },
    {
        "id": "07fe5873-ce4b-4032-ae1d-262209818914",
        "word": "dinosaur",
        "persian": "دایناسور",
        "definition": "\"Dinosaur\" refers to a diverse group of extinct reptiles that dominated terrestrial ecosystems for over 150 million years, primarily during the Mesozoic Era. Characterized by their upright posture and varied sizes, diets, and appearances, dinosaurs went extinct approximately 66 million years ago, though birds are considered their direct descendants.\n\nSynonyms: extinct reptile, prehistoric giant, ancient lizard.\n",
        "exampleA": "The fossilized bones revealed the immense size of the dinosaur.",
        "exampleB": "My son is obsessed with dinosaurs and knows all their names.",
        "exampleC": "The museum has a fascinating exhibit about the age of the dinosaurs.",
        "status": "seen"
    },
    {
        "id": "ee757568-733d-47d6-8568-8df3cad23fec",
        "word": "Earth",
        "persian": "سیاره زمین",
        "definition": "\"Earth\" refers to the planet we inhabit, the third planet from the Sun and the only known astronomical object to harbor life. It's often used to signify the ground or soil, the physical substance of our planet, and sometimes represents the world and its inhabitants collectively.\n\nSynonyms: Globe, World, Terra, Ground, Soil.\n",
        "exampleA": "The Earth is our home planet.",
        "exampleB": "We must protect the Earth from pollution.",
        "exampleC": "Scientists study the Earth's atmosphere.",
        "status": "learned"
    },
    {
        "id": "bf639ab0-8ebf-4119-88a7-23fea5399835",
        "word": "eventuality",
        "persian": "خطر احتمالی",
        "definition": "\"Eventuality\" refers to a possible event or outcome, especially one that is uncertain or may occur in the future. It's something that could happen, though it isn't necessarily definite. Basically, it's a potential scenario.\n\nSynonyms: possibility, contingency, likelihood, prospect\n",
        "exampleA": "We must prepare for every eventuality, no matter how unlikely.",
        "exampleB": "She had considered the eventuality of failing the exam and had a backup plan.",
        "exampleC": "In the eventuality that the negotiations break down, we will proceed with legal action.",
        "status": "learned"
    },
    {
        "id": "8e297743-b5f8-446e-b783-b5056a9853c9",
        "word": "exploration",
        "persian": "کاوش، بررسی",
        "definition": "Exploration refers to the act of searching, discovering, or investigating something new, especially a territory, concept, or idea. It involves venturing into the unknown, often with the goal of gaining knowledge, understanding, or resources. It can be a physical journey to uncharted lands or a mental quest to uncover hidden truths.\n\nSynonyms: discovery, investigation, research, reconnaissance, inquiry.\n",
        "exampleA": "The team embarked on a daring exploration of the uncharted jungle.",
        "exampleB": "Her exploration of different art styles led to a unique and captivating portfolio.",
        "exampleC": "The company is funding extensive exploration for new energy sources.",
        "status": "learned"
    },
    {
        "id": "0ca69021-a220-49fc-8a88-fd2632d6eabb",
        "word": "explore",
        "persian": "کاوش کردن، بررسی کردن",
        "definition": "To explore means to investigate or inquire into something in a systematic way, often with the goal of discovering new information, places, or ideas. It involves venturing into the unknown and learning about it through observation, experimentation, or research. Essentially, it's the act of seeking knowledge and understanding by actively engaging with one's surroundings or a particular subject.\n\nSynonyms: investigate, examine, probe, research, survey\n",
        "exampleA": "to explore space./ Let's explore this issue/idea more fully.",
        "exampleB": "We decided to explore the ancient ruins.",
        "exampleC": "The scientists will explore the depths of the ocean.",
        "status": "learned"
    },
    {
        "id": "4f82f6d6-cd69-4899-88b3-fbd4747987d1",
        "word": "explorer",
        "persian": "\"Explorer\" بسته به متن می‌تونه به معانی مختلفی ترجمه بشه. رایج‌ترین معادل‌ها عبارتند از:\n\n   کاوشگر: برای اشاره به کسی که به اکتشاف و جستجو می‌پردازه.\n   مرورگر: برای اشاره به نرم‌افزاری مثل مرورگر وب یا فایل اکسپلورر ویندوز.\n   جستجوگر: برای اشاره به کسی که به دنبال کشف و یافتن چیزیه.\n",
        "definition": "An explorer is a person who investigates unknown regions, often for the purpose of discovery, mapping, scientific study, or resource acquisition. They venture into unfamiliar territories, whether geographical locations, scientific fields, or even new ideas, seeking to expand knowledge and understanding of the world.\n\nSynonyms: Voyager, pioneer, discoverer, adventurer, trailblazer.\n",
        "exampleA": "The explorer ventured deep into the uncharted jungle.",
        "exampleB": "She is a curious explorer of new culinary experiences.",
        "exampleC": "The data scientist acted as an explorer, uncovering hidden patterns.",
        "status": ""
    },
    {
        "id": "a3836a0a-035f-4b8d-82de-d1ba1bc2090a",
        "word": "extreme",
        "persian": "خیلی شدید و بد، وخیم",
        "definition": "\"Extreme\" describes something that is far beyond the ordinary, average, or expected. It implies the greatest or highest degree of something, often suggesting intensity, intensity, or exceeding usual limits. It can refer to behaviors, conditions, or qualities that are exceptionally intense or unusual.\n\nSynonyms: Radical, drastic, excessive, intense, ultimate.\n",
        "exampleA": "extreme weather conditions./ In extreme cases, the disease can lead to blindness.",
        "exampleB": "The hikers faced extreme weather conditions on their ascent.",
        "exampleC": "Her dedication to the project was extreme, working late every night.",
        "status": "learned"
    },
    {
        "id": "4f1082b8-9eb7-455b-ae8e-b5deb6963729",
        "word": "feasible",
        "persian": "میسر، شدنی",
        "definition": "\"Feasible\" means capable of being done, effected, or accomplished successfully or conveniently; in essence, it describes something that is practical and possible to achieve given the available resources and circumstances.\n\nSynonyms: possible, achievable, viable, practicable, workable.\n",
        "exampleA": "Given the limited resources, the project is not feasible.",
        "exampleB": "Implementing the new software is feasible with the current team.",
        "exampleC": "A manned mission to Mars is technically feasible, but financially challenging.",
        "status": "seen"
    },
    {
        "id": "ee9d64c9-7eb3-4220-bbb3-5ea01c4e9168",
        "word": "float",
        "persian": "شناور شدن",
        "definition": "\"Float\" describes the ability of an object or substance to rest or remain on the surface of a liquid without sinking. It can also refer to moving gently or effortlessly through the air or a liquid. The concept relies on buoyancy, where the upward force exerted by the fluid is equal to or greater than the weight of the object.\n\nSynonyms: drift, buoy, hover, swim, glide\n",
        "exampleA": "You can float very easily in/on the Dead Sea because it's so salty.",
        "exampleB": "The empty bottle will float on the water.",
        "exampleC": "Variables of type 'float' can store decimal numbers.",
        "status": "learned"
    },
    {
        "id": "f235160b-8de7-4ef1-9bc2-175374d9da8d",
        "word": "galaxy",
        "persian": "کهکشان",
        "definition": "A galaxy is a vast, gravitationally bound system of stars, stellar remnants, interstellar gas, dust, and dark matter. Galaxies range in size from dwarfs containing just a few million stars to giants with trillions of stars, all orbiting a common center. They are fundamental building blocks of the universe, often found in groups and clusters.\n\nSynonyms: star system, island universe, cosmos.\n",
        "exampleA": "Our solar system is just a tiny speck in the vast Milky Way galaxy.",
        "exampleB": "Scientists are using powerful telescopes to study distant galaxies.",
        "exampleC": "The swirling patterns of light and dust create a stunning visual in the galaxy.",
        "status": "learned"
    },
    {
        "id": "8cb8d7d4-f45b-46a5-baf0-2f8ee31207b9",
        "word": "gas",
        "persian": "بسته به زمینه، \"gas\" می‌تونه به معانی مختلفی ترجمه بشه:\n\n   اگر منظور سوخت باشه: گاز\n   اگر منظور حالت ماده باشه: گاز یا حالت گازی\n   اگر منظور درد معده باشه: نفخ یا گاز معده\n   به عنوان فعل (gas up): بنزین زدن یا سوخت گیری\n",
        "definition": "\"Gas\" has multiple meanings. In everyday language, it refers to a state of matter characterized by its ability to expand freely to fill any available space. It's a substance that's neither solid nor liquid, like the air we breathe. Alternatively, \"gas\" can also mean gasoline, a fuel used in vehicles.\n\nSynonyms: vapor, fumes, petrol, fuel.\n",
        "exampleA": "The car ran out of gas on the highway.",
        "exampleB": "Natural gas is a common fuel source for heating homes.",
        "exampleC": "She was overcome by the smell of gas.",
        "status": ""
    },
    {
        "id": "be9fd02f-ddeb-47a9-a2c5-af4cf3660e5e",
        "word": "gravitation",
        "persian": "جاذبه بین دو ذره",
        "definition": "Gravitation, also known as gravity, is the fundamental force of attraction that exists between any two objects with mass. It's the force that pulls things towards the Earth, keeps planets in orbit around the Sun, and governs the large-scale structure of the universe. The strength of the gravitational force depends on the masses of the objects and the distance between them.\n\nSynonyms: gravity, gravitational attraction, pull, attraction.\n",
        "exampleA": "Particles are attracted to each other by gravitation.",
        "exampleB": "Newton's theory of gravitation explains why apples fall from trees.",
        "exampleC": "The spaceship used the moon's gravitation to slingshot towards Mars.",
        "status": "learned"
    },
    {
        "id": "985418f0-9b51-4098-86ab-f0a9749a4a14",
        "word": "gravitational",
        "persian": "جاذبه ای، گرانشی",
        "definition": "\"Gravitational\" relates to the force of attraction between any two objects with mass. It describes phenomena caused by gravity, such as the orbit of planets around the sun or the falling of an apple from a tree. Essentially, it's anything pertaining to or influenced by the pull of gravity.\n\nSynonyms: Gravitic, attractive, weighted, pertaining to gravity.\n",
        "exampleA": "gravitational forces",
        "exampleB": "The Earth's gravitational pull keeps us from floating into space.",
        "exampleC": "Einstein's theory of general relativity describes gravity as a gravitational field caused by mass and energy.",
        "status": "seen"
    },
    {
        "id": "6b934192-6876-4853-bd39-ff1fc0078ccb",
        "word": "gravity",
        "persian": "جاذبه زمین",
        "definition": "Gravity is the fundamental force of attraction between any two objects with mass. It's what keeps us grounded on Earth, the planets orbiting the Sun, and galaxies bound together. The more massive an object, the stronger its gravitational pull.\n\nSynonyms: gravitation, weight, pull, attraction.\n",
        "exampleA": "The apple fell from the tree due to gravity.",
        "exampleB": "Understanding gravity is essential for space travel.",
        "exampleC": "The dancer moved with a grace that defied gravity.",
        "status": "learned"
    },
    {
        "id": "26e8395a-482f-4746-9ca0-c5d20c63ec16",
        "word": "gravity pull",
        "persian": "نیروی جاذبه",
        "definition": "\"Gravity pull\" refers to the attractive force that any two objects with mass exert on each other, most notably the force that pulls objects towards the center of a planet or star, keeping us grounded on Earth. It's what causes things to fall.\n\nSynonyms: gravitational force, gravitational attraction, gravity.\n",
        "exampleA": "The small moon is held in orbit by the planet's gravity pull.",
        "exampleB": "Astronauts train to counteract the effects of Earth's gravity pull.",
        "exampleC": "We felt the strong gravity pull as the spaceship approached the black hole.",
        "status": "seen"
    },
    {
        "id": "5dcf61fd-5d76-4064-86ee-6d689d3a4a37",
        "word": "horizon",
        "persian": "افق",
        "definition": "The horizon is the apparent line that separates the Earth from the sky. It's the farthest point you can see, where the ground or sea seems to meet the atmosphere. The term can also be used figuratively to describe the limit of a person's knowledge, experience, or ambition.\n\nSynonyms: skyline, vista, outlook, limit, scope.\n",
        "exampleA": "The sun dipped below the horizon, painting the sky with vibrant colors.",
        "exampleB": "New opportunities appeared on the horizon for the ambitious entrepreneur.",
        "exampleC": "The endless horizon of the ocean made me feel small and insignificant.",
        "status": "seen"
    },
    {
        "id": "e610f375-4372-4b57-8205-d11bc8b8b492",
        "word": "horizontal",
        "persian": "\"Horizontal\" در فارسی به معنای \"افقی\" است.\n",
        "definition": "\"Horizontal\" refers to something that is parallel to the horizon or the ground; it denotes a flat, level orientation, typically extending side-to-side rather than up-and-down. It describes a line, plane, or direction that is neither vertical nor inclined.\n\nSynonyms: level, flat, even, plane, lateral.\n",
        "exampleA": "The painting featured a strong horizontal line that drew the viewer's eye across the canvas.",
        "exampleB": "The carpenter ensured the shelves were perfectly horizontal before securing them to the wall.",
        "exampleC": "The landscape stretched out before us, a vast expanse of horizontal plains reaching to the horizon.",
        "status": ""
    },
    {
        "id": "0487872a-8c15-4235-9a11-00a5fe1f3f01",
        "word": "inevitable",
        "persian": "اجتناب ناپذیر",
        "definition": "\"Inevitable\" describes something that is certain to happen and cannot be avoided or prevented. It implies a sense of fate or destiny where the outcome is predetermined and unavoidable.\n\nSynonyms: unavoidable, inescapable, certain, destined, fated.\n",
        "exampleA": "The accident was the inevitable consequence/result/outcome of carelessness.",
        "exampleB": "As the deadline approached, the team realized failure was inevitable.",
        "exampleC": "With such rapid technological advancements, change is inevitable.",
        "status": "seen"
    },
    {
        "id": "31f62f09-6d2a-4178-b75c-6ee81fc5c506",
        "word": "in excess of",
        "persian": "\"بیش از\"، \"فراتر از\"، یا \"اضافه بر\"\n",
        "definition": "more than",
        "exampleA": "The company reported profits in excess of $1 million this quarter.",
        "exampleB": "The car was traveling in excess of the speed limit when the accident occurred.",
        "exampleC": "Donations to the charity were in excess of expectations.",
        "status": "seen"
    },
    {
        "id": "5a755b4f-9d22-4baf-9aa3-3b99b140f55d",
        "word": "Jupiter",
        "persian": "سیاره مشتری",
        "definition": "\"Jupiter\" refers primarily to the largest planet in our solar system, a gas giant characterized by its swirling clouds and Great Red Spot. Beyond its planetary significance, \"Jupiter\" also refers to the Roman king of the gods, equivalent to the Greek god Zeus, holding dominion over the sky and thunder.\n\nSynonyms: Jove, Zeus, Gas Giant.\n",
        "exampleA": "Jupiter is the largest planet in our solar system.",
        "exampleB": "The Great Red Spot is a massive storm on Jupiter.",
        "exampleC": "Scientists are studying Jupiter's moons for signs of life.",
        "status": "learned"
    },
    {
        "id": "835648c9-4a75-4438-b1f6-59fa32bd1554",
        "word": "launch",
        "persian": "پرتاب موشک",
        "definition": "\"Launch\" refers to the act of starting or setting something in motion. It often implies an energetic or forceful beginning, like propelling something into the air or initiating a project. Think of it as the official start of a new venture, product, or initiative.\n\nSynonyms: initiate, commence, introduce, begin, dispatch.\n",
        "exampleA": "The company plans to launch a new product line next quarter.",
        "exampleB": "They had to launch a rescue mission after the hikers got lost.",
        "exampleC": "The rocket is scheduled to launch at dawn.",
        "status": "learned"
    },
    {
        "id": "798d7d65-4240-4d65-bcc9-8779f58474c6",
        "word": "lunar",
        "persian": "قمری",
        "definition": "\"Lunar\" simply means relating to the Moon. It describes anything connected to, influenced by, or resembling our natural satellite. For example, a lunar cycle refers to the Moon's phases, and a lunar landscape describes terrain similar to the Moon's surface.\n\nSynonyms: moon-related, moonlike, selenian (less common)\n",
        "exampleA": "the lunar surface",
        "exampleB": "The lunar landscape is stark and desolate.",
        "exampleC": "Scientists are studying lunar samples to learn more about the moon's history.",
        "status": "seen"
    },
    {
        "id": "8130f8b8-ceb3-46f4-9468-6178a95201ac",
        "word": "lunar eclipse",
        "persian": "ماه گرفتگی",
        "definition": "A lunar eclipse occurs when the Earth passes directly between the Sun and the Moon, casting a shadow on the Moon's surface and making it appear dim or reddish. This celestial event happens only during a full moon and when the Sun, Earth, and Moon are nearly perfectly aligned.\n\nSynonyms: Blood Moon (for total eclipses), lunar occultation (though this term is broader), syzygy (relating to alignment, but not specific to lunar eclipses).\n",
        "exampleA": "We stayed up late to watch the lunar eclipse turn the moon a deep red.",
        "exampleB": "The astronomer explained the science behind a lunar eclipse to the eager crowd.",
        "exampleC": "Photographing a lunar eclipse requires a good camera and a steady hand.",
        "status": "seen"
    },
    {
        "id": "8cf91102-e923-4886-9e31-c8f8ecc3f09d",
        "word": "manned",
        "persian": "دارای سرنشین",
        "definition": "\"Manned\" means that something is operated or staffed by people. It typically refers to equipment, vehicles, or facilities where human presence and direct control are essential for their function. Think of a manned spacecraft requiring astronauts or a manned machine needing an operator.\n\nSynonyms: occupied, staffed, crewed, piloted, attended.\n",
        "exampleA": "The space shuttle was a manned spacecraft.",
        "exampleB": "The research station will be manned around the clock.",
        "exampleC": "The manned mission to Mars is still a long way off.",
        "status": "seen"
    },
    {
        "id": "f633d646-5d07-474e-aa4a-854215ac2198",
        "word": "Mars",
        "persian": "سیاره مریخ",
        "definition": "\"Mars\" refers to the fourth planet from the Sun in our solar system, known for its reddish appearance due to iron oxide (rust) on its surface. It is a terrestrial planet with a thin atmosphere and evidence of past liquid water, making it a subject of intense scientific interest and exploration for potential signs of past or present life.\n\nSynonyms: The Red Planet, Ares (Greek equivalent), War Planet\n",
        "exampleA": "Scientists continue to study the possibility of past or present life on Mars.",
        "exampleB": "The red color of Mars is due to iron oxide on its surface.",
        "exampleC": "Future missions aim to send humans to Mars to establish a permanent base.",
        "status": "learned"
    },
    {
        "id": "6ad4f673-5a7b-4ad1-b160-326b899dcf1f",
        "word": "Martian",
        "persian": "آدم مریخی",
        "definition": "\"Martian\" refers to a hypothetical inhabitant of the planet Mars, or anything relating to Mars itself. It evokes a sense of the alien, otherworldly, and potentially unknown or hostile.\n\nSynonyms: extraterrestrial, Martian, alien, space being.\n",
        "exampleA": "The rover sent back intriguing images of the Martian landscape.",
        "exampleB": "Some scientists believe microbial life could exist deep beneath the Martian surface.",
        "exampleC": "He jokingly referred to his coworker as a Martian due to his quirky habits.",
        "status": "learned"
    },
    {
        "id": "c8db85f2-49b9-4a9e-9c46-6904b9f95325",
        "word": "Mercury",
        "persian": "سیاره عطارد",
        "definition": "\"Mercury\" has several meanings. Most commonly, it refers to a heavy, silvery-white metallic element that is liquid at room temperature, also known as quicksilver. It is used in thermometers, barometers, and some electrical switches. Beyond the element itself, \"Mercury\" is also the name of the Roman god of commerce, eloquence, communication, travelers, boundaries, trickery, and thieves.\n\nSynonyms: Quicksilver, Hydrargyrum, Messenger of the Gods.\n",
        "exampleA": "Mercury is the smallest planet in our solar system.",
        "exampleB": "The thermometer showed the mercury rising rapidly.",
        "exampleC": "Mercury was the messenger of the gods in Roman mythology.",
        "status": "seen"
    },
    {
        "id": "6b4b5ee2-399e-4b1e-91e0-7c183dc61e99",
        "word": "meteor",
        "persian": "شهاب",
        "definition": "A meteor is a bright streak of light that appears in the sky when a small piece of space debris, called a meteoroid, enters the Earth's atmosphere and burns up due to friction. Often referred to as \"shooting stars,\" they are commonly observed at night and represent the visible effect of interplanetary material colliding with our planet's air.\n\nSynonyms: shooting star, falling star, bolide (for very bright meteors)\n",
        "exampleA": "A brilliant meteor streaked across the night sky, leaving a luminous trail.",
        "exampleB": "Scientists are studying the composition of the meteor that landed in Siberia.",
        "exampleC": "The impact of the meteor caused a massive crater in the desert landscape.",
        "status": "seen"
    },
    {
        "id": "07692e03-10e8-46a2-bbfe-c7d0a8b8b1c4",
        "word": "meteoric",
        "persian": "شهابی، برق آسا",
        "definition": "\"Meteoric\" describes something that experiences a sudden and rapid rise or success, often resembling the brilliant flash of a meteor streaking across the sky before disappearing. It implies a swift and dramatic ascent, typically followed by an equally rapid decline or fading, though not always.\n\nSynonyms: rapid, swift, dazzling, explosive, overnight.\n",
        "exampleA": "meteoric activity./ meteoric rise",
        "exampleB": "The band's meteoric rise to fame was fueled by viral videos and catchy melodies.",
        "exampleC": "Her meteoric career in the company was a testament to her hard work and dedication.",
        "status": "seen"
    },
    {
        "id": "4616e93f-a0e3-4714-9fd0-5048f2303a24",
        "word": "mission",
        "persian": "ماموریت",
        "definition": "A mission is a task or assignment that someone is given to carry out, often a significant or strategic one. It can also refer to a vocation or calling in life, a purpose that drives someone's actions and decisions. Essentially, a mission provides direction and focus.\n\nSynonyms: assignment, objective, purpose, goal, task, calling.\n",
        "exampleA": "The astronaut's mission was to collect rock samples from the moon.",
        "exampleB": "Her personal mission is to help underprivileged children succeed.",
        "exampleC": "The company's mission statement emphasizes customer satisfaction.",
        "status": "learned"
    },
    {
        "id": "93e5c749-98cf-46d1-adbd-ca62009c174a",
        "word": "moon",
        "persian": "\"Moon\" در فارسی به \"ماه\" ترجمه می‌شود.\n",
        "definition": "The moon is Earth's only natural satellite, a celestial body that orbits our planet and shines by reflecting sunlight. It's a prominent feature in the night sky and influences tides on Earth.\n\nSynonyms: Luna, Satellite, Orb\n",
        "exampleA": "The moon shone brightly in the night sky.",
        "exampleB": "Neil Armstrong was the first man to walk on the moon.",
        "exampleC": "Werewolves are said to transform under the light of a full moon.",
        "status": ""
    },
    {
        "id": "fc7ab175-0f1c-4269-9911-d6f8858553ea",
        "word": "ocean",
        "persian": "اقیانوس، پهنهٔ آبی بسیار بزرگ و پیوسته که بخش اعظم سطح زمین را پوشانده است.\n",
        "definition": "An ocean is a vast, continuous body of saltwater that covers over 70% of the Earth's surface. It plays a crucial role in regulating the planet's climate and supports a diverse range of marine life.\n\nSynonyms: sea, the deep, the brine, the main.\n",
        "exampleA": "The vast ocean stretched out before them, shimmering under the sunlight.",
        "exampleB": "Plastic pollution is a major threat to the health of the ocean.",
        "exampleC": "They sailed across the ocean, searching for new lands.",
        "status": ""
    },
    {
        "id": "d5d0e9f5-80d0-484f-832d-5057e76da0bf",
        "word": "orbit",
        "persian": "\"مدار\" یا \"چرخش به دور یک جسم\" بهترین معادل‌ها برای کلمه \"orbit\" در فارسی هستند.\n",
        "definition": "An orbit is the curved path of an object, like a planet, moon, or satellite, around a central body due to the force of gravity. It's a perpetual dance between inertia, which wants the object to move in a straight line, and gravity, which pulls it inwards, resulting in a stable, repeating trajectory.\n\nSynonyms: trajectory, path, revolution, circuit.\n",
        "exampleA": "The satellite is now in a stable orbit around the Earth.",
        "exampleB": "Her career trajectory seems to be in a positive orbit, constantly rising.",
        "exampleC": "The Earth takes approximately 365 days to orbit the sun.",
        "status": ""
    },
    {
        "id": "51cf8478-dc55-42fc-8c4f-4ddc419b9d89",
        "word": "orbit",
        "persian": "به دور مداری چرخیدن",
        "definition": "An orbit is the curved path of an object in space around another object due to the force of gravity. It's a continuous, repeating trajectory, like the Earth revolving around the sun.\n\nSynonyms: trajectory, revolution, circuit, path.\n",
        "exampleA": "On this mission the Shuttle will orbit (the Earth) at a height of several hundred miles.",
        "exampleB": "The satellite is in a stable orbit around the Earth.",
        "exampleC": "The planets orbit the sun in elliptical paths.",
        "status": "learned"
    },
    {
        "id": "6f2379b5-3b11-4968-a721-50ec962df4f4",
        "word": "orbit",
        "persian": "مدار",
        "definition": "\"Orbit\" refers to the curved path of an object in space around another object due to the force of gravity. Typically, it describes the path of a planet or satellite around a star or a moon around a planet, but can also apply to artificial satellites.\n\nSynonyms: trajectory, revolution, circuit, path.\n",
        "exampleA": "Once in space, the spacecraft will go into orbit around the Earth.",
        "exampleB": "The satellite is in a stable orbit around the Earth.",
        "exampleC": "Her career seemed to orbit around powerful figures in the industry.",
        "status": "seen"
    },
    {
        "id": "2d8786cc-c6aa-4b41-84be-9b0992d3ee2b",
        "word": "orbit",
        "persian": "\"مدار\" یا \"چرخش به دور یک جسم\" بهترین معادل‌ها برای کلمه \"orbit\" در فارسی هستند.\n",
        "definition": "An orbit is the curved path of an object, like a planet, moon, or satellite, around a central body due to the force of gravity. It's a perpetual dance between inertia, which wants the object to move in a straight line, and gravity, which pulls it inwards, resulting in a stable, repeating trajectory.\n\nSynonyms: trajectory, path, revolution, circuit.\n",
        "exampleA": "The satellite is now in a stable orbit around the Earth.",
        "exampleB": "Her career trajectory seems to be in a positive orbit, constantly rising.",
        "exampleC": "The Earth takes approximately 365 days to orbit the sun.",
        "status": ""
    },
    {
        "id": "d5cba674-1f38-4abd-a34b-8076f727eae3",
        "word": "outer",
        "persian": "\"بیرونی\" یا \"خارجی\"\n",
        "definition": "\"Outer\" refers to something that is located on the outside, exterior, or further away from the center or interior. It describes the surface, perimeter, or the part that is visible or readily accessible to those outside a defined area.\n\nSynonyms: external, exterior, outlying, surface, outward.\n",
        "exampleA": "The outer layers of the onion were brown and papery.",
        "exampleB": "The outer limits of the galaxy are still being explored.",
        "exampleC": "She wore a warm coat over her thin dress as an outer layer against the cold.",
        "status": ""
    },
    {
        "id": "117e5654-5833-40d4-ae97-a47438eaecab",
        "word": "outer space",
        "persian": "فضای خارج از جو",
        "definition": "\"Outer space\" refers to the vast, mostly empty region that exists beyond Earth's atmosphere and extends to the farthest reaches of the observable universe. It's characterized by a near-vacuum state, containing very little matter and radiation, and is the environment where celestial objects like planets, stars, and galaxies reside.\n\nSynonyms: space, the cosmos, the universe, the void, interplanetary space.\n",
        "exampleA": "Humans have always been fascinated by outer space and the mysteries it holds.",
        "exampleB": "The astronaut gazed out the window of the spacecraft, marveling at the vastness of outer space.",
        "exampleC": "Scientists are constantly developing new technologies to explore outer space further.",
        "status": "seen"
    },
    {
        "id": "328c4f2a-83f9-4144-b8f2-90ea6317193e",
        "word": "planet",
        "persian": "سیاره",
        "definition": "A planet is a celestial body that orbits a star, is massive enough for its own gravity to pull it into a nearly round shape, and has cleared its orbital path of other objects. Simply put, it's a substantial, round-ish object that goes around a star and is the dominant gravitational force in its region of space.\n\nSynonyms: Orb, world, celestial body, wandering star.\n",
        "exampleA": "Earth is the only planet known to support life.",
        "exampleB": "Scientists are searching for other planets that could potentially harbor extraterrestrial organisms.",
        "exampleC": "The rings of Saturn are a beautiful and distinctive feature of that planet.",
        "status": "learned"
    },
    {
        "id": "b65d1936-4e5c-4ca7-a4c5-96527b7e42f5",
        "word": "plant a flag",
        "persian": "پرچم کاشتن",
        "definition": "\"Plant a flag\" means to establish a presence or claim dominance in a particular area, field, or domain. It suggests taking a decisive action to mark something as yours, signaling your intent to stay and control it. It's often used metaphorically to describe establishing a new market share, introducing a novel idea, or achieving a significant milestone.\n\nSynonyms: establish a foothold, stake a claim, mark territory, dominate, assert oneself.\n",
        "exampleA": "The explorers were the first to plant a flag on the newly discovered island.",
        "exampleB": "The company aimed to plant a flag in the international market with their innovative product.",
        "exampleC": "She wanted to plant a flag for women in the male-dominated field of engineering.",
        "status": "seen"
    },
    {
        "id": "e38affe8-3f4c-4ce5-a527-5abcc040acfc",
        "word": "Pluto",
        "persian": "سیاره پلوتون",
        "definition": "\"Pluto\" refers to a dwarf planet located in the Kuiper Belt, beyond Neptune's orbit. Once considered the ninth planet in our solar system, it was reclassified in 2006 due to its size and inability to clear its orbital path. It's characterized by its icy surface, thin atmosphere, and five known moons, the largest being Charon.\n\nSynonyms: Dwarf planet, Plutoid, Trans-Neptunian object (TNO)\n",
        "exampleA": "Pluto was reclassified as a dwarf planet in 2006.",
        "exampleB": "The New Horizons spacecraft provided stunning images of Pluto's surface.",
        "exampleC": "Even though it's not a planet, Pluto still holds a special place in our solar system.",
        "status": "seen"
    },
    {
        "id": "4bd2fc5b-a661-46a6-b7e0-20a9accf2efc",
        "word": "propel",
        "persian": "\"Propel\" بسته به متن می‌تونه به فارسی به صورت‌های مختلفی ترجمه بشه، اما رایج‌ترین معادل‌ها عبارتند از: \"به جلو راندن\"، \"به حرکت درآوردن\"، \"پیش بردن\" و \"سوق دادن\".\n",
        "definition": "To propel means to drive, push, or cause something to move forward or onward with force. It implies an action that initiates or sustains movement in a specific direction.\n\nSynonyms: drive, push, thrust, impel, launch\n",
        "exampleA": "The strong winds helped propel the sailboat across the lake.",
        "exampleB": "Ambition can propel a person to achieve great things.",
        "exampleC": "The rocket's powerful engines propel it into space.",
        "status": ""
    },
    {
        "id": "eee5ebdc-225f-4a7b-9aa6-d9abbc3936e2",
        "word": "propel (sb into/to sth)",
        "persian": "سوق دادن، به جلو راندن",
        "definition": "\"Propel (sb into/to sth)\" means to drive or push someone forward into a particular situation, career, or state. It often implies a sudden or forceful advancement, or a significant boost that accelerates their progress. Synonyms include: thrust, launch, catapult, impel, drive, boost.\n",
        "exampleA": "a rocket propelled through space. / The film propelled him to international stardom.",
        "exampleB": "His ambition and hard work propelled him into a leadership position.",
        "exampleC": "The unexpected inheritance propelled her to a life of luxury.",
        "status": "seen"
    },
    {
        "id": "432e983a-ac41-4266-b77b-e61d0dfeb8fd",
        "word": "radiation",
        "persian": "تابش، اشعه",
        "definition": "Radiation is the emission or transmission of energy in the form of waves or particles through space or a material medium. This energy can come from various sources, including the decay of radioactive materials, the sun, or electrical devices. It encompasses a broad spectrum, from harmless radio waves to potentially damaging X-rays and gamma rays.\n\nSynonyms: emission, irradiation, energy transfer, radioactive discharge.\n",
        "exampleA": "Exposure to high levels of radiation can be harmful to living organisms.",
        "exampleB": "The doctor ordered an X-ray, which uses a small amount of radiation to create an image of my bones.",
        "exampleC": "The nuclear power plant is carefully monitored to prevent any leakage of radiation.",
        "status": "learned"
    },
    {
        "id": "962b9342-9663-4381-8df5-578ff971bad5",
        "word": "reality",
        "persian": "واقعیت",
        "definition": "\"Reality\" refers to the state of things as they actually exist, independent of any perception, belief, or imagination. It encompasses the sum total of everything that is, whether observable, measurable, or understood. It's the objective world and the circumstances within it.\n\nSynonyms: actuality, existence, truth, fact, verity.\n",
        "exampleA": "The line between virtual reality and reality is becoming increasingly blurred.",
        "exampleB": "He struggled to accept the harsh reality of his situation.",
        "exampleC": "She preferred to live in a fantasy world rather than face reality.",
        "status": "seen"
    },
    {
        "id": "5734bd6a-d706-45bd-a513-a4e30824ccad",
        "word": "realm",
        "persian": "حوزه، قلمرو",
        "definition": "A realm is a kingdom, domain, or sphere of influence; it signifies a distinct area of existence, interest, or control. It often implies a defined or governed space, whether physical, abstract, or metaphorical.\n\nSynonyms: kingdom, domain, sphere, territory, province.\n",
        "exampleA": "The king ruled over a vast realm.",
        "exampleB": "Quantum physics exists in a realm beyond our everyday experience.",
        "exampleC": "She delved into the realm of fantasy literature.",
        "status": "seen"
    },
    {
        "id": "e159e98f-2520-42bc-9eee-2cbf6572726a",
        "word": "robotics",
        "persian": "علم رباتیک",
        "definition": "Robotics is the interdisciplinary field that integrates computer science, engineering (mechanical, electrical, and computer), and other disciplines to design, construct, operate, and apply robots. It involves the creation of intelligent machines capable of performing tasks automatically or with minimal human intervention, often in environments that are dangerous, repetitive, or inaccessible for humans.\n\nSynonyms: Automata, automaton theory, robot engineering, mechatronics (related).\n",
        "exampleA": "The university offers a comprehensive program in robotics.",
        "exampleB": "Advances in robotics are transforming manufacturing processes.",
        "exampleC": "She pursued her passion for robotics by joining the robotics club.",
        "status": "learned"
    },
    {
        "id": "b5a23dfb-74f7-432b-8f00-a124e2002432",
        "word": "rocket",
        "persian": "موشک",
        "definition": "\"Rocket\" refers to a vehicle, missile, or other projectile propelled by a rocket engine. These engines work by ejecting a high-speed exhaust, typically generated from burning propellant, to create thrust in the opposite direction, allowing the rocket to travel through space or the atmosphere.\n\nSynonyms: Missile, projectile, spacecraft, launch vehicle.\n",
        "exampleA": "The rocket launched into space, leaving a trail of fire.",
        "exampleB": "He dreamed of building a rocket and traveling to Mars.",
        "exampleC": "The toy rocket soared through the air before landing in the grass.",
        "status": "learned"
    },
    {
        "id": "6240d0c2-5a20-4e2b-8e5e-dc5e0d1a4b1b",
        "word": "rotate",
        "persian": "چرخیدن",
        "definition": "To rotate means to turn or revolve around an axis or center point. It implies a circular or spinning motion, whether it's a complete revolution or a partial turn.\n\nSynonyms: revolve, spin, turn, pivot, whirl.\n",
        "exampleA": "Please rotate the image 90 degrees clockwise.",
        "exampleB": "The Earth continues to rotate on its axis.",
        "exampleC": "We need to rotate the crops to improve the soil.",
        "status": "learned"
    },
    {
        "id": "de1704ef-267f-4f53-b1ad-69d66e9c101b",
        "word": "satellite",
        "persian": "معادل فارسی \"satellite\" می‌تواند «ماهواره» باشد که به جسمی گفته می‌شود که در مداری به دور یک سیاره یا جسم بزرگتر دیگر می‌چرخد.\n",
        "definition": "A satellite is an object that orbits a larger object in space. This can be a natural object like the moon orbiting Earth, or an artificial object, like a man-made spacecraft launched into orbit around Earth or another planet for communication, observation, or other purposes.\n\nSynonyms: moon, orbiter, spacecraft.\n",
        "exampleA": "The satellite transmitted images of the hurricane back to Earth.",
        "exampleB": "A satellite dish is needed to receive television signals in some rural areas.",
        "exampleC": "Scientists use satellites to monitor climate change.",
        "status": ""
    },
    {
        "id": "1d22c9d0-a8b3-4c0f-b81b-77541e93a7fc",
        "word": "Saturn",
        "persian": "سیاره زحل",
        "definition": "Saturn, in astronomy, refers to the sixth planet from the Sun and the second-largest planet in our solar system, famously known for its prominent ring system composed of ice particles, rock, and dust. It is a gas giant, primarily composed of hydrogen and helium.\n\nSynonyms: Ringed Planet, Kronos (Greek mythology), Lord of the Rings.\n",
        "exampleA": "Saturn is famous for its prominent rings.",
        "exampleB": "The spacecraft Cassini provided valuable data about Saturn's moons.",
        "exampleC": "In Roman mythology, Saturn was the god of agriculture.",
        "status": ""
    },
    {
        "id": "570a26ea-9fa1-42ef-aa44-5a27c08fb4cd",
        "word": "simulate",
        "persian": "معادل‌های فارسی برای simulate بسته به کاربرد عبارتند از: شبیه‌سازی کردن، وانمود کردن، تقلید کردن، تظاهر کردن، یا بازآفرینی کردن.\n",
        "definition": "To simulate means to create a model or representation of something, often a process, system, or environment, in order to study its behavior or effects. It involves imitating the real thing, usually using a computer or other tools, to understand it better or predict its outcome under different conditions.\n\nSynonyms: imitate, replicate, model, mimic, emulate, reproduce.\n",
        "exampleA": "Engineers use computer models to simulate the effects of different designs.",
        "exampleB": "The training exercise was designed to simulate a real-world emergency situation.",
        "exampleC": "The program can simulate various market conditions to help investors make informed decisions.",
        "status": ""
    },
    {
        "id": "e6561dbd-c086-4295-b63a-83cbc8baa398",
        "word": "simulator",
        "persian": "شبیه ساز",
        "definition": "A simulator is a tool, system, or process designed to mimic the behavior or characteristics of a real-world environment, system, or phenomenon. It allows users to experiment, train, or analyze without the risks or constraints associated with the real thing. Simulators are used in diverse fields, from flight training and medical procedures to scientific research and economic modeling.\n\nSynonyms: emulator, replica, mock-up, model, representation.\n",
        "exampleA": "The flight simulator provided a realistic experience of piloting a plane.",
        "exampleB": "Engineers use a simulator to test the performance of a new car design.",
        "exampleC": "She practiced her surgery skills on a virtual reality simulator.",
        "status": "learned"
    },
    {
        "id": "432c80cc-ec1b-43ed-bd36-d4f4d11b95ab",
        "word": "solar",
        "persian": "\"Solar\" در فارسی معمولاً به صورت «خورشیدی» ترجمه می‌شود که به معنای مرتبط با خورشید یا انرژی خورشیدی است.\n",
        "definition": "\"Solar\" fundamentally relates to the sun. It describes anything derived from or pertaining to the sun, most commonly its energy or light. For example, solar panels capture sunlight and convert it into electricity.\n\nSynonyms: sun-related, heliacal, sunlike, radiant.\n",
        "exampleA": "The company invested heavily in solar energy.",
        "exampleB": "We installed solar panels on our roof to reduce our electricity bill.",
        "exampleC": "Scientists are exploring new and efficient solar cell technologies.",
        "status": ""
    },
    {
        "id": "3bc8dd11-8d67-4302-ad8b-58e2c77f7be3",
        "word": "solar eclipse",
        "persian": "خورشید گرفتگی",
        "definition": "A solar eclipse occurs when the Moon passes between the Sun and Earth, blocking all or part of the Sun's light. This creates a temporary shadow on Earth, ranging from a partial dimming to complete darkness depending on the alignment and observer's location. Essentially, the Moon is momentarily getting in the way of the Sun's rays reaching us.\n\nSynonyms: Sun eclipse, solar obscuration, occultation of the Sun.\n",
        "exampleA": "We traveled to Oregon to witness the solar eclipse.",
        "exampleB": "Looking directly at a solar eclipse without proper eye protection can cause serious damage.",
        "exampleC": "The sudden darkness during the solar eclipse was an eerie but beautiful experience.",
        "status": "seen"
    },
    {
        "id": "13112881-9a0d-4e81-8c70-b54aa03649a2",
        "word": "solar system",
        "persian": "منظومه شمسی",
        "definition": "The solar system encompasses the Sun and all the celestial objects gravitationally bound to it. This includes the eight planets, their moons, dwarf planets like Pluto, asteroids, comets, and other smaller bodies. Essentially, it's our cosmic neighborhood, a vast and dynamic system held together by the Sun's immense gravity.\n\nSynonyms: planetary system, star system, heliocentric system\n",
        "exampleA": "Our solar system is located in the Milky Way galaxy.",
        "exampleB": "Scientists continue to discover new objects in our solar system.",
        "exampleC": "The planets in our solar system orbit the Sun.",
        "status": "learned"
    },
    {
        "id": "683310ba-0f44-405c-94e4-802c7514f600",
        "word": "souvenir",
        "persian": "سوغاتی، یادگاری",
        "definition": "A souvenir is a typically small and relatively inexpensive item kept or purchased as a reminder of a place visited, an event attended, or a person encountered. It serves as a tangible memento of a past experience, often triggering memories and emotions associated with that experience.\n\nSynonyms: memento, keepsake, token, remembrance, reminder.\n",
        "exampleA": "a souvenir of his trip to London.",
        "exampleB": "I bought a small snow globe as a souvenir of my trip to New York.",
        "exampleC": "The t-shirt I got at the concert is a great souvenir.",
        "status": "seen"
    },
    {
        "id": "29cf8fa6-8e8f-4528-b5ec-71ae0d53fedb",
        "word": "space",
        "persian": "فضا",
        "definition": "\"Space\" refers to the boundless three-dimensional extent in which objects and events have relative position and direction. It's the emptiness surrounding us, encompassing everything from the immediate area around an object to the vastness of the universe. It can also refer to a specific area or volume.\n\nSynonyms: area, room, capacity, scope, extent, distance\n",
        "exampleA": "The astronaut floated effortlessly in the vast expanse of space.",
        "exampleB": "I need some space to think about this decision.",
        "exampleC": "The new office provides ample space for our growing team.",
        "status": "learned"
    },
    {
        "id": "c3af4cbf-0963-41b2-914f-8c3c5953e43c",
        "word": "spacecraft",
        "persian": "سفینه فضایی، فضا پیما",
        "definition": "A spacecraft is a vehicle or machine designed for travel in outer space. It can be either crewed (carrying humans) or uncrewed (robotic), and it is used for a variety of purposes, including scientific research, communication, exploration, and transportation.\n\nSynonyms: spaceship, rocket, probe, satellite.\n",
        "exampleA": "The spacecraft successfully docked with the International Space Station.",
        "exampleB": "Scientists are developing new propulsion systems for future spacecraft.",
        "exampleC": "Images from the spacecraft revealed stunning details about the surface of Mars.",
        "status": "seen"
    },
    {
        "id": "9ebdd5f0-03dc-4829-9df5-105cdcc3b1b7",
        "word": "space shuttle",
        "persian": "شاتل فضایی",
        "definition": "A space shuttle was a partially reusable low Earth orbital spacecraft system operated by NASA for three decades. It combined the ability to launch like a rocket and glide back to Earth like an airplane, carrying both crew and cargo to and from space.\n\nSynonyms: Orbiter, Spaceplane, Reusable spacecraft\n",
        "exampleA": "The space shuttle was a reusable spacecraft used by NASA.",
        "exampleB": "Astronauts conducted scientific experiments aboard the space shuttle.",
        "exampleC": "The retirement of the space shuttle program marked the end of an era in space exploration.",
        "status": "learned"
    },
    {
        "id": "ca831316-1212-4199-8343-640709936c14",
        "word": "space station",
        "persian": "ایستگاه فضایی",
        "definition": "A space station is a large, habitable artificial satellite in low Earth orbit. It is a long-term facility where astronauts can live, work, and conduct scientific research in the space environment. These stations are equipped with life support systems, power supplies, and research equipment, and are visited by crewed spacecraft for resupply and crew rotation.\n\nSynonyms: Orbital station, orbital outpost, space lab, orbital habitat.\n",
        "exampleA": "The astronauts conducted experiments aboard the International Space Station.",
        "exampleB": "A piece of debris threatened to collide with the space station, requiring an emergency maneuver.",
        "exampleC": "From the space station, Earth looks like a fragile blue marble.",
        "status": "learned"
    },
    {
        "id": "3677d79b-798b-4575-b210-84efd741c98a",
        "word": "stellar",
        "persian": "اختری، ستاره ای، پرستاره",
        "definition": "\"Stellar\" means exceptionally good, outstanding, or brilliant, often used to describe performance, quality, or an achievement. It implies something that shines or stands out above the rest.\n\nSynonyms: excellent, superb, exceptional, outstanding, remarkable, brilliant.\n",
        "exampleA": "The restaurant received stellar reviews for its innovative cuisine.",
        "exampleB": "Her performance in the lead role was truly stellar and captivated the audience.",
        "exampleC": "The company's stellar growth can be attributed to its strong marketing strategy.",
        "status": "seen"
    },
    {
        "id": "e334e01f-3e00-4235-a05d-8c4d23e78882",
        "word": "surface",
        "persian": "بسته به متن، «surface» می‌تونه به معانی مختلفی مثل «سطح»، «رویه»، «ظاهر»، «بروز کردن» یا «آشکار شدن» ترجمه بشه.\n",
        "definition": "\"Surface\" generally refers to the outermost layer or face of an object or substance. It's the part that is directly exposed or visible and forms the boundary between the object's interior and its surroundings. It can describe a physical boundary, like the top of a table, or a more abstract concept, like the apparent level of understanding.\n\nSynonyms: exterior, face, veneer, facade, top.\n",
        "exampleA": "The boat skimmed along the surface of the lake.",
        "exampleB": "Dust had accumulated on the surface of the antique table.",
        "exampleC": "The news report barely scratched the surface of the complex issue.",
        "status": ""
    },
    {
        "id": "48ef580c-7f22-4e86-853c-f1421dceca9b",
        "word": "sustain",
        "persian": "پایدار نگه داشتن، زنده نگه داشتن",
        "definition": "To sustain means to keep something in existence; to maintain, support, or prolong something, whether it's a physical object, an activity, or an idea. It implies providing the necessary resources or conditions for something to continue and thrive over a period of time.\n\nSynonyms: maintain, support, uphold, preserve, prolong, continue.\n",
        "exampleA": "The soil in this part of the world is not rich enough to sustain a large population.",
        "exampleB": "The ecosystem needs our help to sustain its delicate balance.",
        "exampleC": "We must find innovative ways to sustain economic growth without harming the environment.",
        "status": "seen"
    },
    {
        "id": "edc1131b-d776-4c60-b514-f23c3c5b97d5",
        "word": "terrestrial",
        "persian": "زمینی",
        "definition": "\"Terrestrial\" refers to anything related to the Earth, specifically the land rather than the sea or air. It's used to describe things that live on land, originate from the land, or are characteristic of the Earth as a planet.\n\nSynonyms: earthly, land-based, earthbound, ground-dwelling.\n",
        "exampleA": "Most plants and animals are terrestrial, meaning they live on land.",
        "exampleB": "Scientists are searching for signs of terrestrial life on other planets.",
        "exampleC": "The terrestrial ecosystem is facing many threats due to human activity.",
        "status": "seen"
    },
    {
        "id": "b7234ea2-b407-4200-88cf-a1cd91990885",
        "word": "thunderstorm",
        "persian": "طوفان رعد و برق",
        "definition": "A thunderstorm is a localized storm produced by cumulonimbus clouds, always accompanied by lightning and thunder, and often featuring heavy rain or hail, strong winds, and potentially tornadoes. It's a dramatic weather event caused by atmospheric instability and moisture.\n\nSynonyms: electrical storm, thundershower, tempest\n",
        "exampleA": "The picnic was ruined by a sudden thunderstorm.",
        "exampleB": "The dog is afraid of the loud thunder during a thunderstorm.",
        "exampleC": "We lost power last night because of the severe thunderstorm.",
        "status": "seen"
    },
    {
        "id": "1c146aa1-617a-4df8-8b36-1886cb70d923",
        "word": "toxic",
        "persian": "\"Toxic\" بسته به زمینه می‌تونه به فارسی به صورت‌های مختلفی ترجمه بشه، اما رایج‌ترین معادل‌ها عبارتند از: \"سمی\"، \"مضر\"، \"زهرآگین\" و \"مسموم‌کننده\".\n",
        "definition": "\"Toxic\" describes something poisonous, harmful, or very unpleasant. It can refer to physical substances that cause damage to living organisms, like toxic chemicals, or it can describe negative or damaging behaviors and relationships that are harmful to emotional and mental well-being. Essentially, something toxic is detrimental and should be avoided.\n\nSynonyms: poisonous, harmful, detrimental, damaging, noxious, virulent.\n",
        "exampleA": "The company culture had become toxic, leading to high employee turnover.",
        "exampleB": "That online forum is a toxic environment filled with negativity and personal attacks.",
        "exampleC": "The chemical spill released toxic fumes into the atmosphere.",
        "status": ""
    },
    {
        "id": "2907ddd1-3e1e-418a-bb1c-cd855f663a88",
        "word": "undergo",
        "persian": "تحمل کردن ،دستخوش( چيزى )شدن ،متحمل چيزى شدن",
        "definition": "\"Undergo\" means to experience or be subjected to something, often something unpleasant or necessary. It implies a process or action that one is subjected to.\n\nSynonyms: experience, endure, go through, be subjected to, withstand.\n",
        "exampleA": "The patient will undergo surgery to repair the torn ligament.",
        "exampleB": "All new employees must undergo a mandatory training program.",
        "exampleC": "The old bridge will undergo extensive renovations to improve its safety.",
        "status": "seen"
    },
    {
        "id": "ba2e9d03-95dd-407f-bd5e-7d80d0daa7fa",
        "word": "uninhabitable",
        "persian": "غیر قابل زیست",
        "definition": "\"Uninhabitable\" describes a place or environment that is unsuitable or impossible for people or other living beings to live in due to factors like extreme temperatures, lack of resources, dangerous conditions, or contamination. It implies that the area is not capable of supporting life as we know it.\n\nSynonyms: uninhabitable, uninhabitable, unlivable, uninhabited, desolate, barren, hostile\n",
        "exampleA": "The earthquake left the village completely uninhabitable.",
        "exampleB": "After the chemical spill, the area was declared uninhabitable for the foreseeable future.",
        "exampleC": "Lack of resources made the island virtually uninhabitable.",
        "status": "learned"
    },
    {
        "id": "f0ba901e-79c8-4939-b8a9-3b812dbd1278",
        "word": "universal",
        "persian": "عالمگیر، جهانی",
        "definition": "\"Universal\" means applying to or being characteristic of all or most people, things, or places in the world; it's something that is generally true or applicable everywhere. It suggests a quality that transcends specific boundaries or limitations.\n\nSynonyms: general, widespread, global, ubiquitous, common\n",
        "exampleA": "Access to clean water should be a universal human right.",
        "exampleB": "The theory of relativity is considered a universal law of physics.",
        "exampleC": "His music has a universal appeal that transcends cultural boundaries.",
        "status": "learned"
    },
    {
        "id": "a6ff3ce3-6f38-44be-bec0-a04085914f45",
        "word": "universe",
        "persian": "عالم",
        "definition": "The universe encompasses all of space and time and their contents, including planets, stars, galaxies, and all other forms of matter and energy. It's essentially everything that exists.\n\nSynonyms: cosmos, macrocosm, world, creation, existence\n",
        "exampleA": "Scientists are constantly seeking to understand the origins of the universe.",
        "exampleB": "Her dreams were as vast and boundless as the universe itself.",
        "exampleC": "The fate of humanity may depend on our ability to protect our small corner of the universe.",
        "status": "learned"
    },
    {
        "id": "7b3c8f5d-b234-49b2-9592-acd152a4be04",
        "word": "unmanned",
        "persian": "بدون شرنشین",
        "definition": "\"Unmanned\" refers to a vehicle, aircraft, or other device that operates without a human crew physically on board. It is controlled remotely, autonomously, or through a combination of both. This technology is increasingly used in various fields, including exploration, surveillance, and transportation, as it allows for tasks to be performed in hazardous or inaccessible environments.\n\nSynonyms: Remote-controlled, autonomous, robotic, uninhabited.\n",
        "exampleA": "an unmanned mission to the planet Mars",
        "exampleB": "The military deployed an unmanned aerial vehicle for reconnaissance.",
        "exampleC": "The company is developing unmanned delivery systems to improve efficiency.",
        "status": "seen"
    },
    {
        "id": "c6844005-c6b3-43d9-a083-9e9fa2397e2c",
        "word": "Venus",
        "persian": "سیاره زهره، ناهید، زن زیبا",
        "definition": "\"Venus\" refers to the second planet from the Sun in our solar system, known for its bright, reflective appearance in the night sky. In Roman mythology, Venus is also the goddess of love, beauty, desire, sex, fertility, prosperity and victory.\n\nSynonyms: Morning Star, Evening Star, Roman Goddess of Love\n",
        "exampleA": "Venus is often called Earth's sister planet due to their similar size and density.",
        "exampleB": "The Roman goddess Venus was associated with love, beauty, and fertility.",
        "exampleC": "Looking west after sunset, you might be able to spot Venus shining brightly in the evening sky.",
        "status": "learned"
    },
    {
        "id": "58095b10-39f6-4754-92bf-4cafef4ba6ab",
        "word": "weightlessness",
        "persian": "بی وزنی",
        "definition": "Weightlessness describes the condition where an object or person experiences little to no gravitational force, or when the gravitational force is counteracted, creating a sensation of floating or free-falling. This doesn't necessarily mean the absence of gravity; it often occurs because the object and its surroundings are accelerating together, like in orbit.\n\nSynonyms: zero gravity, microgravity, free fall, zero g.\n",
        "exampleA": "The astronauts experienced weightlessness inside the International Space Station.",
        "exampleB": "Divers often try to simulate weightlessness in underwater environments.",
        "exampleC": "The sensation of weightlessness during the roller coaster drop was exhilarating.",
        "status": "seen"
    }
]