[
    {
        "id": "0f8858a4-9743-4dd8-b202-454252c7a419",
        "word": "ageing",
        "persian": "در حال پیر شدن، پیری",
        "definition": "\"Ageing\" refers to the process of growing older, typically involving a gradual decline in physical and cognitive functions, and an increased susceptibility to age-related diseases. It's a natural and universal biological process that affects all living organisms.\n\nSynonyms: senescence, maturation, growing old, getting on in years.\n",
        "exampleA": "ageing computers/machinery./ ageing process",
        "exampleB": "The ageing infrastructure is in desperate need of repair.",
        "exampleC": "She found solace in painting as a way to express her feelings about ageing.",
        "status": "seen"
    },
    {
        "id": "ff1775f1-f613-4873-b7fc-06e59ea30287",
        "word": "astounding",
        "persian": "حیرت آور",
        "definition": "\"Astounding\" describes something that is so surprising and remarkable that it leaves you in a state of shock and wonder. It goes beyond simply being surprising and implies a significant degree of amazement and disbelief due to the unusual or extraordinary nature of what is observed.\n\nSynonyms: astonishing, breathtaking, staggering, remarkable, mind-blowing.\n",
        "exampleA": "an astounding (= very great) victory/achievement/success",
        "exampleB": "The magician performed an astounding feat of illusion.",
        "exampleC": "Her athletic ability is truly astounding.",
        "status": "seen"
    },
    {
        "id": "1b6883c9-9f68-48d3-bd72-7463743718fd",
        "word": "at present",
        "persian": "در حال حاضر / اکنون / هم‌اکنون\n",
        "definition": "currently",
        "exampleA": "At present, the company is focusing on expanding its product line.",
        "exampleB": "At present, I am working on a project that requires extensive research.",
        "exampleC": "At present, the weather is clear, but a storm is predicted for later tonight.",
        "status": "learned"
    },
    {
        "id": "2a8f3d0a-2ef1-40bb-8291-1855fe4f1551",
        "word": "at this rate",
        "persian": "با این روند",
        "definition": "\"At this rate\" is a phrase used to express concern or prediction about the outcome of a situation, based on the current pace or progress. It implies that if the current trend continues unchanged, the likely result will be negative or undesirable. It often suggests a need for intervention or a change in approach.\n\nSynonyms: at this pace, as things stand, if this continues, at the current rate, at this speed\n",
        "exampleA": "At this rate, we won't be home till midnight.",
        "exampleB": "At this rate, we'll never finish the project on time.",
        "exampleC": "At this rate of economic growth, the country will be a global leader in a decade.",
        "status": "seen"
    },
    {
        "id": "7180404d-f0ba-4b62-9f50-ade663e65c86",
        "word": "attitude",
        "persian": "معادل‌های مختلفی برای \"attitude\" وجود دارد که بسته به بافت جمله می‌توان از آن‌ها استفاده کرد، اما به طور کلی می‌توان آن را به نگرش، دیدگاه، طرز برخورد، یا رویکرد ترجمه کرد.\n",
        "definition": "Attitude refers to a settled way of thinking or feeling about someone or something, typically reflected in a person's behavior. It encompasses our opinions, beliefs, and emotions, influencing how we perceive the world and react to different situations and individuals.\n\nSynonyms: disposition, outlook, mindset, perspective, stance\n",
        "exampleA": "Her positive attitude was contagious, uplifting everyone around her.",
        "exampleB": "The manager addressed the employee's negative attitude during the performance review.",
        "exampleC": "Despite the challenges, she maintained a resilient attitude and persevered.",
        "status": ""
    },
    {
        "id": "c7652e0c-dd9b-494e-9ec4-baa84ebb8921",
        "word": "bland",
        "persian": "بی مزه (مربوط به غذا)، بی مزه و کسل آور",
        "definition": "\"Bland\" generally describes something that lacks strong flavor, interest, or excitement. It can refer to food that is under-seasoned, an experience that is uneventful, or a personality that is unremarkable. It suggests a lack of character or anything that stands out.\n\nSynonyms: Insipid, dull, uninspired, tasteless, boring\n",
        "exampleA": "a bland diet. / a few bland comments",
        "exampleB": "The soup was surprisingly bland, lacking any discernible flavor.",
        "exampleC": "He found the office environment to be bland and uninspiring.",
        "status": "seen"
    },
    {
        "id": "4714b74e-49ca-4d77-9b63-21d29ef03b37",
        "word": "brand",
        "persian": "مارک تجاری",
        "definition": "A brand is a unique identity representing a product, service, company, or even a person, that differentiates it from competitors in the minds of consumers. It encompasses tangible elements like a logo and color scheme, as well as intangible aspects like reputation, values, and the overall customer experience. A strong brand fosters recognition, trust, and loyalty, ultimately influencing purchasing decisions.\n\nSynonyms: Trademark, Label, Identity, Image, Reputation.\n",
        "exampleA": "The new brand of coffee is surprisingly delicious.",
        "exampleB": "She is fiercely loyal to that particular brand of clothing.",
        "exampleC": "Building a strong brand takes time and consistent effort.",
        "status": "learned"
    },
    {
        "id": "d5db2c07-426b-4f14-a866-1aa10ff0a9c1",
        "word": "chain store",
        "persian": "فروشگاه زنجیره ای",
        "definition": "A chain store is a retail outlet that is part of a group of stores operated under the same brand name and ownership, typically offering a standardized selection of goods or services. These stores often benefit from economies of scale in purchasing, marketing, and operations, leading to consistent pricing and customer experience across locations.\n\nSynonyms: retail chain, chain retailer, multiple shop, franchise.\n",
        "exampleA": "I prefer to shop at local businesses rather than large chain stores.",
        "exampleB": "The town's main street is dominated by familiar chain store brands.",
        "exampleC": "He got a job at a popular chain store after graduating from college.",
        "status": "learned"
    },
    {
        "id": "19f33de3-b4f1-48c6-b851-b98518d8a5d1",
        "word": "compound",
        "persian": "to make a problem or difficult situation worse، دوچندان شدن",
        "definition": "\"Compound\" means something that is made up of two or more separate elements or parts. It describes a substance, thing, or even an idea that is formed by combining different components.\n\nSynonyms: mixture, blend, combination, composite, complex.\n",
        "exampleA": "Severe drought has compounded food shortages in the region.",
        "exampleB": "Water is a chemical compound made of hydrogen and oxygen.",
        "exampleC": "The company decided to compound their losses by investing in a new venture.",
        "status": "seen"
    },
    {
        "id": "27196358-f20f-4595-b5d3-33ba50f55d81",
        "word": "contribute",
        "persian": "\"Contribute\" بسته به متن می‌تونه معانی مختلفی داشته باشه، اما به طور کلی یعنی \"سهیم بودن\"، \"کمک کردن\"، \"مشارکت کردن\" یا \"نقش داشتن\".\n",
        "definition": "\"Contribute\" means to give or supply something, such as time, money, effort, or ideas, in order to help achieve a common goal or to enhance something. It implies playing a part in a larger effort and adding to the overall value or success.\n\nSynonyms: donate, provide, offer, give, supply.\n",
        "exampleA": "I would like to contribute to the charity event by donating some of my old clothes.",
        "exampleB": "His innovative ideas contributed significantly to the success of the project.",
        "exampleC": "Many factors contribute to a person's overall health and well-being.",
        "status": ""
    },
    {
        "id": "792d3c6e-d1d8-4cb0-8fd5-0ba9daeac3d4",
        "word": "contribute (to sth)",
        "persian": "همکاری و کمک کردن، کمک کردن مالی",
        "definition": "To contribute to something means to give or supply something, such as money, resources, effort, or ideas, in order to help achieve or provide something. It implies playing a part in a larger effort or outcome.\n\nSynonyms: donate, provide, supply, offer, add, assist, support.\n",
        "exampleA": "She contributes to several magazines./ Alcohol contributes to 100,000 deaths a year in the US.",
        "exampleB": "Her research will contribute to a better understanding of the disease.",
        "exampleC": "I want to contribute to the community by volunteering my time.",
        "status": "seen"
    },
    {
        "id": "bf845fc8-aaa0-4725-8187-c3c1706e7257",
        "word": "culture",
        "persian": "«فرهنگ» معادل دقیقی برای واژه \"culture\" است و به مجموعه‌ای از آداب، رسوم، باورها، هنرها و دستاوردهای یک جامعه یا گروه اشاره دارد.\n",
        "definition": "Culture encompasses the shared values, beliefs, practices, and material objects that characterize a group of people. It's a complex system that shapes their behavior, interactions, and worldview, passed down through generations. This shared heritage defines their identity and differentiates them from other groups.\n\nSynonyms: civilization, heritage, traditions, way of life.\n",
        "exampleA": "The museum showcased artifacts representing various aspects of the region's culture.",
        "exampleB": "She immersed herself in the local culture while studying abroad.",
        "exampleC": "Corporate culture plays a significant role in employee satisfaction and productivity.",
        "status": ""
    },
    {
        "id": "f868b015-b28f-4c32-b40a-1c33b112f43b",
        "word": "current",
        "persian": "کنونی",
        "definition": "\"Current\" generally refers to something happening or existing right now, in the present time. It can also describe something that is up-to-date or most recent. In physics, it can refer to the flow of electricity or water.\n\nSynonyms: present, existing, contemporary, prevailing, recent.\n",
        "exampleA": "The current president is giving a speech tonight.",
        "exampleB": "What is the current exchange rate between the dollar and the euro?",
        "exampleC": "The current flowed swiftly downstream, making it difficult to paddle upstream.",
        "status": "learned"
    },
    {
        "id": "92a2e262-295d-4219-adc9-08d2012db7fd",
        "word": "cycle",
        "persian": "چرخه",
        "definition": "A cycle refers to a series of events or processes that repeat in a predictable order or sequence. It often implies a return to a starting point, after which the sequence begins again. It can describe natural phenomena, business operations, or even personal habits.\n\nSynonyms: loop, rotation, recurrence, round, sequence.\n",
        "exampleA": "The washing machine completes a full cycle in 45 minutes.",
        "exampleB": "We need to break the cycle of poverty in our community.",
        "exampleC": "The bicycle's chain came off the cycle sprocket.",
        "status": "learned"
    },
    {
        "id": "8e86b8e8-511b-4f7c-95be-0716fbb60c87",
        "word": "decline",
        "persian": "تنزل پیدا کردن",
        "definition": "\"Decline\" signifies a gradual and continuous decrease, deterioration, or weakening in quantity, quality, or intensity. It suggests a downward trend from a previous, higher state.\n\nSynonyms: decrease, diminish, wane, dwindle, decay.\n",
        "exampleA": "The company's profits began to decline sharply after the new regulations were implemented.",
        "exampleB": "I had to decline the invitation to the party because I already had other commitments.",
        "exampleC": "The old bridge is showing signs of decline and needs to be repaired soon.",
        "status": "seen"
    },
    {
        "id": "bc6dfd51-ba74-430a-9a39-65491b4fbffc",
        "word": "demographic",
        "persian": "جمعیت شناختی",
        "definition": "A demographic refers to a particular sector of a population that shares common characteristics, such as age, race, gender, income, education, or geographic location. It's used in social science, marketing, and policymaking to analyze and understand groups within a larger population and tailor strategies or services to their specific needs.\n\nSynonyms: population segment, subgroup, cohort, social group.\n",
        "exampleA": "The company is targeting a younger demographic with its new advertising campaign.",
        "exampleB": "Understanding the demographic makeup of a region is crucial for effective urban planning.",
        "exampleC": "Changes in the demographic profile of the country are expected to impact the healthcare system.",
        "status": "seen"
    },
    {
        "id": "d14eb1b9-e6fa-497f-b11b-df6d202de915",
        "word": "demographics",
        "persian": "جمعیت شناسی",
        "definition": "\"Demographics\" refers to the statistical characteristics of human populations, such as age, gender, ethnicity, income, education, and occupation. These characteristics are used to describe and analyze populations, understand trends, and make informed decisions in various fields like marketing, public policy, and healthcare.\n\nSynonyms: population statistics, census data, vital statistics, population profile.\n",
        "exampleA": "The store carefully studied the demographics of the neighborhood before deciding what products to stock.",
        "exampleB": "Understanding the demographics of our target audience is crucial for effective marketing campaigns.",
        "exampleC": "Changes in demographics can have a significant impact on the economy and social services.",
        "status": "seen"
    },
    {
        "id": "11e6beb7-85ff-4b9b-83d9-4d4b7cb06e97",
        "word": "development",
        "persian": "توسعه، رشد، پیشرفت",
        "definition": "\"Development\" refers to the process of growth, advancement, or improvement over time, often involving change or progress from one stage to another. It can apply to various areas, including personal skills, technology, economies, or societies as a whole, and suggests a transition towards a more complex, mature, or advanced state.\n\nSynonyms: evolution, progress, growth, advancement, maturation.\n",
        "exampleA": "The city's rapid development has led to increased traffic congestion.",
        "exampleB": "His personal development plan includes taking online courses and attending workshops.",
        "exampleC": "Sustainable development aims to meet the needs of the present without compromising the ability of future generations to meet their own needs.",
        "status": "learned"
    },
    {
        "id": "2246f8ae-2bd3-49e7-9fb7-6adf00f266e7",
        "word": "diminish",
        "persian": "کلمه \"diminish\" در فارسی می‌تواند به صورت‌های مختلفی ترجمه شود، از جمله: کاهش یافتن، کم شدن، تقلیل یافتن، کم کردن، کاستن. انتخاب دقیق‌ترین معادل بستگی به متن و مفهوم مورد نظر دارد.\n",
        "definition": "To diminish means to make or become less; to reduce in size, importance, or intensity. It implies a gradual reduction rather than a sudden disappearance.\nSynonyms: decrease, lessen, reduce, dwindle, abate\n",
        "exampleA": "The heavy rain started to diminish after a few hours.",
        "exampleB": "His enthusiasm for the project began to diminish as he faced more challenges.",
        "exampleC": "Eating less sugar can help diminish the risk of health problems.",
        "status": ""
    },
    {
        "id": "f631f383-8ea7-413d-bcc0-79d9c432f4ac",
        "word": "diversity",
        "persian": "تنوع",
        "definition": "Diversity refers to the presence of a variety of different characteristics within a group, organization, or society. This can include differences in race, ethnicity, gender, sexual orientation, socioeconomic status, age, physical abilities, religious beliefs, political perspectives, and other attributes that make individuals unique. A diverse environment fosters inclusivity, innovation, and a broader understanding of the world.\n\nSynonyms: variety, heterogeneity, multiplicity, difference, range.\n",
        "exampleA": "The company is committed to increasing diversity in its workforce.",
        "exampleB": "Our school celebrates the diversity of cultures and backgrounds among our students.",
        "exampleC": "Maintaining biodiversity is crucial for the health of our planet.",
        "status": "learned"
    },
    {
        "id": "ad38eb83-4e2f-4e6e-87b3-29c9dbd9e7f2",
        "word": "domestic market",
        "persian": "بازار داخلی",
        "definition": "The \"domestic market\" refers to the supply and demand of goods, services, and resources within the geographical boundaries of a specific nation or country. It encompasses all economic activities and transactions that occur internally, involving residents, businesses, and organizations operating within that nation.\n\nSynonyms: internal market, home market, national market, local market\n",
        "exampleA": "The company's primary focus is on expanding its share of the domestic market.",
        "exampleB": "Sales figures indicate a strong demand for locally produced goods within the domestic market.",
        "exampleC": "Fluctuations in currency exchange rates can significantly impact the competitiveness of the domestic market.",
        "status": ""
    },
    {
        "id": "1abba663-a89f-4b43-ba1f-945e8dd5a9cc",
        "word": "dominate",
        "persian": "\"Dominate\" بسته به متن می‌تونه معانی مختلفی داشته باشه، اما معمول‌ترین ترجمه‌هاش این‌ها هستن:\n\n   تسلط داشتن\n   چیره شدن\n   حاکم بودن\n   غلبه کردن\n",
        "definition": "To dominate means to have a commanding influence or control over someone or something, often asserting power or superiority. It implies a position of strength where one entity is able to direct, govern, or overshadow others. Synonyms include: control, command, lead, reign, and overpower.\n",
        "exampleA": "The Lakers used their height advantage to dominate the game.",
        "exampleB": "That company continues to dominate the market share in the technology sector.",
        "exampleC": "His strong personality can sometimes dominate conversations.",
        "status": ""
    },
    {
        "id": "bef1c3ba-51fd-4590-bd4c-04afb7c9651f",
        "word": "dominate (sth)",
        "persian": "غالب بودن، حکمفرما بودن",
        "definition": "To dominate something means to have control or power over it, often in a way that limits or influences its development, outcome, or characteristics. It implies a position of strength and influence that allows one to dictate or heavily affect the object being dominated.\n\nSynonyms: control, govern, command, rule, prevail, monopolize\n",
        "exampleA": "The dispute is likely to dominate the news.",
        "exampleB": "The visiting team's offense began to dominate the game in the second quarter.",
        "exampleC": "Large corporations often dominate the market, making it difficult for smaller businesses to compete.",
        "status": "seen"
    },
    {
        "id": "99158083-e26c-461f-a339-9dae45bf8c17",
        "word": "dwindle",
        "persian": "رفته رفته کوچک شدن",
        "definition": "\"Dwindle\" means to gradually decrease in size, amount, or strength until very little remains. It implies a process of becoming smaller or weaker over time. Synonyms include: diminish, decrease, lessen, shrink, fade, wane.\n",
        "exampleA": "The community has dwindled to a tenth of its former size in the last two years.",
        "exampleB": "The crowd began to dwindle as the rain started.",
        "exampleC": "Her savings started to dwindle after she lost her job.",
        "status": "seen"
    },
    {
        "id": "97d3de6e-a55a-4a34-9f52-15324b00339c",
        "word": "elderly",
        "persian": "\"elderly\" بسته به بافتار می‌تونه به صورت‌های مختلفی ترجمه بشه، اما رایج‌ترین و مناسب‌ترین ترجمه‌ها این‌ها هستند: سالمند، مسن، پیر، کهنسال.\n",
        "definition": "\"Elderly\" refers to people who are advanced in age and often experiencing the physical and cognitive effects of aging. It's a polite and relatively respectful way to describe someone who is old.\n\nSynonyms: senior, aged, older, geriatric\n",
        "exampleA": "The elderly woman enjoyed knitting in her rocking chair.",
        "exampleB": "Many programs are designed to assist the elderly with their daily needs.",
        "exampleC": "Respect for the elderly is a cornerstone of our culture.",
        "status": ""
    },
    {
        "id": "c023c662-3e99-42e5-814d-4d6aca35d413",
        "word": "energy drink",
        "persian": "نوشیدنی انرژی زا",
        "definition": "An energy drink is a beverage designed to provide a quick boost of mental and physical energy, typically containing high levels of caffeine, sugar, and other stimulants like taurine and guarana. While they may temporarily increase alertness and improve performance, their effects are often short-lived and can be followed by a crash.\n\nSynonyms: stimulant drink, power drink, performance enhancer, caffeinated beverage\n",
        "exampleA": "He relies on an energy drink to get through his late-night study sessions.",
        "exampleB": "The convenience store has a wide selection of energy drink brands.",
        "exampleC": "She felt a sudden rush of energy after consuming the energy drink.",
        "status": "learned"
    },
    {
        "id": "90ebbd37-767e-40fd-ae7b-1e35e5fd2155",
        "word": "ethnic",
        "persian": "قومی و نژادی",
        "definition": "\"Ethnic\" refers to a group of people sharing a common and distinctive culture, religion, language, ancestry, or national origin. It emphasizes shared heritage and cultural identity, often distinguishing one group from another within a larger society.\n\nSynonyms: cultural, racial, national, tribal, indigenous\n",
        "exampleA": "ethnic food/restaurant/costume",
        "exampleB": "The museum has a diverse collection of ethnic artifacts from around the world.",
        "exampleC": "She enjoys cooking ethnic dishes from different cultures.",
        "status": "seen"
    },
    {
        "id": "d11c9777-30e2-42cd-be66-f104e6c24f67",
        "word": "exotic",
        "persian": "بیگانه، عجیب و غریب",
        "definition": "\"Exotic\" describes something that is strikingly unusual and often comes from a distant or foreign place. It implies a sense of unfamiliarity, intrigue, and sometimes even allure, due to its different origin or characteristics. Think of a rainforest animal in a city zoo, or a dish seasoned with spices rarely used in Western cuisine.\n\nSynonyms: foreign, unusual, rare, unfamiliar, outlandish, novel.\n",
        "exampleA": "The restaurant offered a menu filled with exotic dishes from around the world.",
        "exampleB": "She decorated her apartment with exotic plants and artwork she collected during her travels.",
        "exampleC": "The zookeeper introduced the children to several exotic animals they had never seen before.",
        "status": "seen"
    },
    {
        "id": "b7745358-30e9-47dc-9775-e2e2bbf03cbe",
        "word": "factor",
        "persian": "\"فاکتور\" در فارسی معانی مختلفی دارد و بسته به متن می‌تواند به \"عامل\"، \"مولفه\"، \"ضریب\"، \"ملاک\" یا \"فاکتور\" (به صورت وام‌واژه) ترجمه شود.\n",
        "definition": "A factor is something that contributes to a result or outcome; it's a cause, element, or influence that plays a part in making something happen or be the way it is. It can be a reason, a circumstance, or even a force that helps determine an event or situation.\n\nSynonyms: element, component, cause, influence, aspect\n",
        "exampleA": "Poor weather was a significant factor in the accident.",
        "exampleB": "Cost is always a major factor when making purchasing decisions.",
        "exampleC": "Genetics can be a factor in the development of certain diseases.",
        "status": ""
    },
    {
        "id": "45cef202-8a9a-4638-a22f-ba746b2ce575",
        "word": "factor in",
        "persian": "«Factor in» به فارسی معمولاً به صورت «در نظر گرفتن»، «لحاظ کردن» یا «محاسبه کردن» ترجمه می‌شود. بسته به متن، می‌توان از معادل‌های دیگری مانند «به حساب آوردن» یا «وارد کردن» نیز استفاده کرد.\n",
        "definition": "take into account",
        "exampleA": "When planning your trip, be sure to factor in travel time between destinations.",
        "exampleB": "The budget needs to factor in unexpected expenses that may arise.",
        "exampleC": "We need to factor in the impact of the new regulations on our profits.",
        "status": "learned"
    },
    {
        "id": "5ce08ebb-70b1-4d25-861e-e8cf63af1cd6",
        "word": "far-flung",
        "persian": "پرت و دور افتاده",
        "definition": "\"Far-flung\" describes something that is widely distributed, spread out over a large area, or geographically distant. It emphasizes the extensiveness and reach of something, often implying a sense of remoteness or being difficult to access due to its widespread nature.\n\nSynonyms: widespread, extensive, remote, scattered, distant\n",
        "exampleA": "The company has far-flung offices across the globe.",
        "exampleB": "He enjoys traveling to far-flung destinations.",
        "exampleC": "The internet connects people from the most far-flung corners of the world.",
        "status": "seen"
    },
    {
        "id": "45942684-54f1-45cf-bf47-4a2ba651f0f8",
        "word": "figures",
        "persian": "ارقام",
        "definition": "\"Figures\" can refer to numerical data, often used to represent statistics or amounts. It can also mean a person, especially one who is well-known or important. The specific meaning depends heavily on the context in which it's used.\n\nSynonyms: numbers, statistics, data, individuals, personalities, icons.\n",
        "exampleA": "The sales figures for the last quarter are quite promising.",
        "exampleB": "He manipulated the figures to hide the company's losses.",
        "exampleC": "Several key figures in the art world attended the exhibition.",
        "status": "learned"
    },
    {
        "id": "6407bc9a-629a-42b2-ae42-10020a165021",
        "word": "give and take",
        "persian": "\"Give and take\" در فارسی به معنای \"بده بستان\"، \"رفت و برگشت\"، \"سازش\" یا \"مذاکره\" است. انتخاب بهترین معادل بستگی به متن و موقعیتی دارد که عبارت در آن استفاده شده است.\n",
        "definition": "willingness to accept suggestions from another person and give up some of your own",
        "exampleA": "In every friendship there has to be some give and take.",
        "exampleB": "Successful relationships require constant give and take from both parties.",
        "exampleC": "Negotiation is all about give and take; you won't get everything you want.",
        "status": "learned"
    },
    {
        "id": "0d71cabc-21be-4d18-86fd-fcf140fb20c0",
        "word": "global",
        "persian": "جهانی",
        "definition": "\"Global\" refers to something encompassing the entire world or dealing with the whole world. It suggests a widespread impact, influence, or perspective that is not limited to a particular region or country. Think of it as relating to the planet as a whole.\n\nSynonyms: worldwide, international, universal, comprehensive, planetary\n",
        "exampleA": "The company has a global presence with offices in several countries.",
        "exampleB": "Climate change is a global issue that requires international cooperation.",
        "exampleC": "He is a leading expert in global economics.",
        "status": "learned"
    },
    {
        "id": "f6fe9ab9-68a5-44d3-abc9-3e72b77f3ea3",
        "word": "globalisation",
        "persian": "جهانی شدن",
        "definition": "Globalization refers to the increasing interconnectedness and interdependence of countries through the flow of goods, services, capital, technology, and people across national borders. It involves the integration of economies, cultures, and societies, driven by factors like reduced trade barriers, advancements in communication and transportation, and international agreements.\n\nSynonyms: Internationalization, global integration, worldwide expansion, transnationalism.\n",
        "exampleA": "the globalization of fashion/American youth culture",
        "exampleB": "Globalisation has led to increased interconnectedness between countries.",
        "exampleC": "The effects of globalisation are debated, with some praising its economic benefits and others criticizing its impact on local cultures.",
        "status": "learned"
    },
    {
        "id": "ccf51f26-9bda-455c-8f65-ad17730ff259",
        "word": "(have a) monopoly",
        "persian": "داشتن انحصار\n",
        "definition": "Having a monopoly means that a single company or entity controls the entire supply or market for a particular good or service, effectively eliminating competition and allowing them to dictate prices and terms. This lack of alternatives for consumers can often lead to higher prices, lower quality, and reduced innovation.\n\nSynonyms: exclusive control, dominance, corner the market, hold sway, preeminence\n",
        "exampleA": "The company was accused of using its market power to maintain a monopoly.",
        "exampleB": "They don't have a complete monopoly, but their control is significant.",
        "exampleC": "The government is trying to prevent any single company from having a monopoly on the industry.",
        "status": ""
    },
    {
        "id": "8a8aa35f-8f44-43a4-9ea3-47115596d48a",
        "word": "have a monopoly",
        "persian": "امتیاز انحصاری داشتن",
        "definition": "To \"have a monopoly\" means to be the only provider or dominant player in a particular market, giving you exclusive control over prices and supply. It signifies a lack of competition, often leading to higher prices and potentially lower quality goods or services since consumers have limited alternatives.\n\nSynonyms: dominate the market, control exclusively, be the sole provider, have a corner on the market.\n",
        "exampleA": "For years Bell Telephone\t had\t a\t monopoly\t on telephone services in the US.",
        "exampleB": "The company is alleged to have a monopoly over the local coffee bean market.",
        "exampleC": "Because they have a monopoly, they can dictate prices and limit consumer choices.",
        "status": "learned"
    },
    {
        "id": "a20b3a85-87bb-4427-8b4e-354de5415ce9",
        "word": "hindsight",
        "persian": "\"Hindsight\" در فارسی معمولاً به «نگاه به گذشته»، «داوری پس از وقوع»، یا «بعد از واقعه معلوم شدن» ترجمه می‌شود. این عبارت به درک یا قضاوت درباره یک واقعه پس از رخ دادن آن اشاره دارد، در حالی که در زمان وقوع آن واقعه، اطلاعات کافی برای پیش‌بینی یا درک آن وجود نداشته است.\n",
        "definition": "Hindsight is the understanding of a situation or event only after it has happened or developed. It's the ability to see, in retrospect, the mistakes that could have been avoided or the better choices that could have been made. It provides a clearer perspective once the outcome is known, often leading to comments like \"I should have known\" or \"If only I had done things differently.\"\n\nSynonyms: retrospect, aftersight, looking back, second-guessing.\n",
        "exampleA": "In hindsight, I should have invested in that company years ago.",
        "exampleB": "With the benefit of hindsight, it's easy to see where we went wrong.",
        "exampleC": "Hindsight is 20/20, but it doesn't help much when making decisions in the present.",
        "status": ""
    },
    {
        "id": "9d3277b2-6873-4110-8d85-687f67107688",
        "word": "icon",
        "persian": "نماد و نشانه",
        "definition": "An \"icon\" is a symbol or representation that stands for something else, often a person, idea, or object. It can be a religious image, a computer graphic that opens a program, or, most commonly, a widely admired and influential person, especially one considered a representative of a particular field or culture.\n\nSynonyms: symbol, image, figure, idol, legend.\n",
        "exampleA": "Beckham has been one of the country's best-loved sporting icons.",
        "exampleB": "The dove has long been an icon of peace.",
        "exampleC": "Her innovative designs quickly established her as a fashion icon.",
        "status": "learned"
    },
    {
        "id": "6ccdd5c1-6c72-4ca4-954a-c4752e989ecb",
        "word": "identity",
        "persian": "هویت",
        "definition": "Identity refers to the qualities, beliefs, personality, looks and/or expressions that make a person or group unique and distinguishable from others. It's essentially who someone is and how they perceive themselves and are perceived by the world around them.\n\nSynonyms: Individuality, selfhood, character, essence, distinctiveness.\n",
        "exampleA": "The witness was able to provide a clear description of the suspect's identity.",
        "exampleB": "The protagonist struggles to forge her own identity amidst societal pressures.",
        "exampleC": "Online, protecting your digital identity is more crucial than ever.",
        "status": "learned"
    },
    {
        "id": "0a0a6d90-c420-4964-bbda-4bdd5e43f519",
        "word": "impact",
        "persian": "ضربه، تاثیر شدید",
        "definition": "\"Impact\" refers to a significant or powerful effect that something has on someone or something else. It implies a change or consequence, often substantial and noticeable. In essence, it's the force or impression created by an event, idea, or action.\n\nSynonyms: effect, influence, consequence, result, impression.\n",
        "exampleA": "The new policy will impact student learning.",
        "exampleB": "The asteroid's impact created a large crater.",
        "exampleC": "Her speech had a profound impact on the audience.",
        "status": "learned"
    },
    {
        "id": "7f1ad63a-a090-47f4-b543-f421548b56f3",
        "word": "implication",
        "persian": "پیامد، برداشت و معنای ضمنی",
        "definition": "An implication is something that is suggested or understood, though not directly expressed. It's a conclusion that can be reasonably drawn from something else, like a statement, an action, or even a situation. Think of it as reading between the lines to understand the underlying meaning or consequence.\n\nSynonyms: suggestion, inference, insinuation, ramification, consequence.\n",
        "exampleA": "The implication of his statement was that he knew more than he was letting on.",
        "exampleB": "The study's findings have significant implications for public health policy.",
        "exampleC": "By refusing to cooperate, he tacitly accepted the implication of guilt.",
        "status": "seen"
    },
    {
        "id": "6ed36dd5-e08a-4c4b-b85f-a1cf7ab9bcb8",
        "word": "increase",
        "persian": "\"Increase\" در فارسی می‌تواند به معانی مختلفی ترجمه شود، اما رایج‌ترین آن‌ها \"افزایش\" است. بسته به متن و مفهوم، می‌توان از کلماتی مانند \"بالا رفتن\"، \"رشد\"، \"افزایش دادن\" یا \"بیشتر شدن\" نیز استفاده کرد.\n",
        "definition": "\"Increase\" means to become or make something larger, more numerous, or greater in extent. It signifies a growth or escalation in quantity, size, or degree.\n\nSynonyms: grow, expand, augment, escalate, amplify.\n",
        "exampleA": "We need to increase sales to meet our quarterly goals.",
        "exampleB": "The doctor advised him to increase his water intake.",
        "exampleC": "The company plans to increase its investment in renewable energy.",
        "status": ""
    },
    {
        "id": "93ada1a0-b70e-4aa9-a56e-ac3302bfb36d",
        "word": "indicate",
        "persian": "\"indicate\" بسته به متن می‌تونه معانی مختلفی داشته باشه، اما رایج‌ترین ترجمه‌هاش این‌ها هستن: \"نشان دادن\"، \"اشاره کردن\"، \"معرفی کردن\" یا \"دلالت کردن\".\n",
        "definition": "To indicate means to point out, show, or suggest something, often indirectly. It can involve giving information that hints at a particular conclusion or revealing something without explicitly stating it.\n\nSynonyms: suggest, imply, signify, denote, demonstrate.\n",
        "exampleA": "The results of the experiment indicate a clear correlation between the two variables.",
        "exampleB": "Please indicate your preferred method of payment on the form provided.",
        "exampleC": "A flashing light will indicate when the machine is ready.",
        "status": ""
    },
    {
        "id": "198056c1-0aab-41ca-b374-fa4579fade42",
        "word": "industry",
        "persian": "صنعت\n",
        "definition": "\"Industry\" generally refers to a group of companies or organizations that are engaged in a similar type of business or that produce similar products or services. It can also refer to the overall economic activity of a country or region, especially the production of goods.\n\nSynonyms: sector, field, trade, business, commerce\n",
        "exampleA": "The automotive industry is undergoing a significant transformation with the rise of electric vehicles.",
        "exampleB": "She has worked in the fashion industry for over a decade, gaining extensive experience.",
        "exampleC": "The tourism industry contributes significantly to the local economy.",
        "status": ""
    },
    {
        "id": "352b8da9-f4ae-42be-951c-60cd4c8e96dc",
        "word": "influence",
        "persian": "\"Influence\" در فارسی معمولاً به صورت \"تاثیر\"، \"اثرگذاری\" یا \"نفوذ\" ترجمه می‌شود.\n",
        "definition": "Influence is the capacity to have an effect on the character, development, or behavior of someone or something. It suggests a subtle or indirect power that shapes outcomes or opinions without necessarily resorting to force or direct command. This can manifest through persuasion, example, or even just the presence of someone or something.\n\nSynonyms: impact, affect, sway, mold, shape.\n",
        "exampleA": "Her writing has a strong influence on young readers.",
        "exampleB": "The environment can influence a person's behavior.",
        "exampleC": "Political donations often seek to influence legislation.",
        "status": ""
    },
    {
        "id": "640690c3-555d-40bf-8c1b-d229142b9595",
        "word": "(in/with the benefit of) hindsight",
        "persian": "با نگاه به گذشته و در پرتو تجربه.\n",
        "definition": "wisdom or knowledge got only after something (usually bad) has happened",
        "exampleA": "In hindsight, I should have invested in that company when I had the chance.",
        "exampleB": "With the benefit of hindsight, the decision to move overseas wasn't the right one for our family.",
        "exampleC": "It's easy to say what we should have done with the benefit of hindsight, but at the time it was a difficult situation.",
        "status": "seen"
    },
    {
        "id": "4b217ed5-c4e5-4dd6-810d-9c2ddb9514ae",
        "word": "isolation",
        "persian": "انزوا",
        "definition": "Isolation refers to the state of being separated or cut off from others, both physically and emotionally. It can involve a lack of social contact, support, and meaningful relationships, leading to feelings of loneliness, detachment, and exclusion.\n\nSynonyms: seclusion, solitude, detachment, segregation, quarantine.\n",
        "exampleA": "After all the visitors had left, she experienced a feeling of complete isolation.",
        "exampleB": "The old lighthouse keeper lived in complete isolation.",
        "exampleC": "Prolonged isolation can have negative effects on mental health.",
        "status": "learned"
    },
    {
        "id": "978dbd4c-4cc6-4a0c-a379-e86e3a5c0bb1",
        "word": "joint venture",
        "persian": "سرمایه گذاری مشترک",
        "definition": "A joint venture is a business arrangement in which two or more parties agree to pool their resources for the purpose of accomplishing a specific task or project. This collaborative endeavor can take many forms, from creating a new company to simply sharing assets or expertise for a limited duration, with the goal of mutual benefit and shared profits or losses.\n\nSynonyms: partnership, alliance, collaboration, cooperative venture, strategic alliance.\n",
        "exampleA": "The two companies formed a joint venture to develop the new technology.",
        "exampleB": "Their joint venture proved to be a profitable enterprise for both partners.",
        "exampleC": "The success of the project hinges on the effective collaboration within the joint venture.",
        "status": "learned"
    },
    {
        "id": "277fe8fb-5652-468d-a478-d69b61f2bc14",
        "word": "local",
        "persian": "معنی کلمه \"local\" بسته به متن می‌تونه متفاوت باشه، اما معمولاً به معنی «محلی»، «بومی»، یا «منطقه‌ای» هست.\n",
        "definition": "\"Local\" refers to something belonging to or characteristic of a particular place or area, especially the place where one lives or is located. It emphasizes the proximity and connection to a specific geographic region, often highlighting community ties and resources within that area.\n\nSynonyms: regional, community, neighborhood, indigenous, endemic.\n",
        "exampleA": "We support our local farmers by buying fresh produce at the farmers market.",
        "exampleB": "The band gained a loyal following through their performances at local pubs.",
        "exampleC": "She is a local expert on the history of the town.",
        "status": ""
    },
    {
        "id": "6cd2d62b-cc36-496a-a661-8c68d96e6e48",
        "word": "long-term",
        "persian": "بلند مدت",
        "definition": "\"Long-term\" refers to something that will continue or last for a considerable period of time, often years or even decades, as opposed to being temporary or short-lived. It implies a commitment or focus on future outcomes and lasting effects.\n\nSynonyms: enduring, lasting, prolonged, sustained, permanent.\n",
        "exampleA": "The company is focused on making long-term investments in renewable energy sources.",
        "exampleB": "They are developing a long-term plan to reduce carbon emissions.",
        "exampleC": "Our goal is to build a long-term relationship with our clients.",
        "status": "learned"
    },
    {
        "id": "e5ebf91d-ec13-4c4a-8767-84853459f414",
        "word": "market",
        "persian": "\"Market\" بسته به متن می‌تونه به \"بازار\"، \"بورس\"، \"مارکت\" یا \"محل خرید و فروش\" ترجمه بشه.\n",
        "definition": "A market is a place, physical or virtual, where buyers and sellers interact to exchange goods or services, typically for money. It encompasses the entire process of price discovery and resource allocation based on supply and demand.\n\nSynonyms: marketplace, bazaar, trade, exchange.\n",
        "exampleA": "We went to the farmer's market to buy fresh produce.",
        "exampleB": "The company is trying to market its new product to a younger audience.",
        "exampleC": "The stock market experienced a significant downturn this week.",
        "status": ""
    },
    {
        "id": "e2cc1b46-f0e8-4d02-bb25-d692d1e30b1f",
        "word": "merge",
        "persian": "ادغام کردن",
        "definition": "To merge means to combine or blend two or more things into a single, unified entity. It implies a fusion where the individual components lose their distinct identities, becoming part of a larger whole. This can apply to companies merging into a single entity, rivers converging, or ideas blending together.\n\nSynonyms: amalgamate, unite, consolidate, fuse, blend.\n",
        "exampleA": "The two companies decided to merge their resources to create a stronger entity.",
        "exampleB": "Please merge these branches in Git after reviewing the code.",
        "exampleC": "We need to merge the data from these spreadsheets into a single master file.",
        "status": "learned"
    },
    {
        "id": "cfb2c624-ef39-4248-9761-ca7ab765d2df",
        "word": "mid-term",
        "persian": "میان مدت",
        "definition": "\"Mid-term\" typically refers to the middle point of a defined period, especially in academic or political contexts. In education, it usually signifies an exam or assessment given roughly halfway through a semester or term to evaluate a student's understanding of the material covered so far. In politics, it denotes the period two years into a president or governor's four-year term, often marked by elections.\n\nSynonyms: midway, half-way, intermediate, interim.\n",
        "exampleA": "The professor announced the mid-term exam would cover the first five chapters.",
        "exampleB": "Our company is facing some challenges, but we're optimistic about our prospects in the mid-term.",
        "exampleC": "She was feeling overwhelmed with the pressure of preparing for her mid-term exams.",
        "status": "learned"
    },
    {
        "id": "fb45dc12-aa08-4d42-b68e-3c1e9c7a90e3",
        "word": "migrate",
        "persian": "مهاجرت کردن",
        "definition": "To migrate means to move from one place to another, especially to live or work in a new location permanently or for a substantial period. It often implies a large-scale movement of people or animals from one region or country to another.\n\nSynonyms: relocate, emigrate, immigrate, move, resettle.\n",
        "exampleA": "In September, these birds migrate 2,000 miles south to a warmer climate.",
        "exampleB": "Many birds migrate south for the winter.",
        "exampleC": "Data scientists helped the company migrate their systems to the cloud.",
        "status": "learned"
    },
    {
        "id": "0e925642-1f05-453d-81de-5f33306b5d17",
        "word": "modernisation",
        "persian": "نوین گرایی، تجددگرایی",
        "definition": "Modernisation refers to the process of transforming something, typically a society or organization, to reflect more contemporary practices, technologies, and values. It often involves embracing new advancements, streamlining processes, and adapting to changing societal norms to become more efficient, competitive, and relevant in the modern world.\n\nSynonyms: Update, Development, Advancement, Reform, Progress, Improvement.\n",
        "exampleA": "The country's economic growth depends on rapid modernisation of its industries.",
        "exampleB": "The modernisation of the railway system will improve transportation across the region.",
        "exampleC": "Modernisation efforts in agriculture aim to increase crop yields and reduce labor costs.",
        "status": "learned"
    },
    {
        "id": "db223cad-fc80-4091-ac40-dfea5cbcbc27",
        "word": "multicultural",
        "persian": "چند فرهنگه",
        "definition": "\"Multicultural\" describes a society or group characterized by the presence and interaction of diverse cultures, including their unique customs, beliefs, languages, and traditions. It emphasizes the co-existence and often the integration of different cultural groups, leading to a richer and more diverse social fabric.\n\nSynonyms: diverse, pluralistic, cosmopolitan, cross-cultural, multiethnic.\n",
        "exampleA": "The city is known for its multicultural atmosphere, with residents from all over the world.",
        "exampleB": "The university offers a variety of courses that promote multicultural understanding.",
        "exampleC": "The organization strives to create a multicultural workplace where employees from diverse backgrounds feel valued and respected.",
        "status": "learned"
    },
    {
        "id": "a1d404a6-f906-489e-a726-77ae8f6ba25a",
        "word": "multiculturalism",
        "persian": "چند فرهنگ گرایی",
        "definition": "Multiculturalism refers to the co-existence of diverse cultural or ethnic groups within a society, where no single culture dominates. It emphasizes respect, understanding, and appreciation for the different traditions, beliefs, and perspectives that contribute to the richness of a community. It goes beyond mere tolerance to actively celebrating and integrating these differences into the social fabric, aiming for a more inclusive and equitable society.\n\nSynonyms: cultural pluralism, cultural diversity, interculturalism, cosmopolitanism.\n",
        "exampleA": "Canada's approach to multiculturalism is often cited as a model for other nations.",
        "exampleB": "The university promotes multiculturalism through diverse courses and student organizations.",
        "exampleC": "Some critics argue that multiculturalism can lead to social fragmentation rather than integration.",
        "status": "learned"
    },
    {
        "id": "b5d53852-5731-41d1-8d09-cb1fa1681f26",
        "word": "multinational",
        "persian": "چندملیتی",
        "definition": "\"Multinational\" describes a company or organization that operates and has a significant presence in more than one country. These companies typically have headquarters in one nation but conduct business activities, like manufacturing, sales, and research, in various other countries. A multinational company seeks to expand its market reach and often benefits from lower labor costs or access to different resources available abroad.\n\nSynonyms: Transnational, international, global, worldwide.\n",
        "exampleA": "a major multinational food company",
        "exampleB": "The multinational corporation has offices in over 50 countries.",
        "exampleC": "She works for a multinational company that specializes in consumer goods.",
        "status": "learned"
    },
    {
        "id": "07f2beed-2468-4cee-a43b-bd09352714cb",
        "word": "on the Internet",
        "persian": "در اینترنت",
        "definition": "\"On the Internet\" means existing or being available via the global network of interconnected computer networks that use the Internet Protocol suite (TCP/IP) to communicate. It signifies accessibility and presence within the digital realm, enabling users worldwide to access information, services, and communicate with each other.\n\nSynonyms: online, digitally, virtually, on the web, in cyberspace\n",
        "exampleA": "I found the recipe on the Internet.",
        "exampleB": "She spends too much time on the Internet.",
        "exampleC": "You can buy almost anything on the Internet.",
        "status": "learned"
    },
    {
        "id": "f7bc09ed-94a2-4944-81fb-a1ea7ec71858",
        "word": "outlet",
        "persian": "فروشگاه عرضه مستقیم، پریز برق",
        "definition": "An outlet is a way or means of expressing or releasing something, such as emotions, energy, or products. It can refer to a channel for releasing pent-up feelings (like \"art as an outlet for grief\"), a source of distribution for goods (\"a retail outlet\"), or a physical means for releasing something like water or electricity.\n\nSynonyms: vent, channel, avenue, release, distributor.\n",
        "exampleA": "fast food outlet./ a retail outlet",
        "exampleB": "She uses her art as an outlet for her emotions.",
        "exampleC": "The electronics store has a wide selection of power outlets.",
        "status": "learned"
    },
    {
        "id": "69dd657b-fd74-4a19-88d6-bf890230d833",
        "word": "percentage",
        "persian": "در فارسی، \"percentage\" معمولاً به «درصد» ترجمه می‌شود.\n",
        "definition": "A percentage is a way of expressing a number, ratio, or fraction as a portion of 100. Essentially, it tells you \"out of every hundred, how many are we talking about?\". For example, 50% means 50 out of 100, or half. It's a standardized way to compare proportions, making it easier to understand relative amounts.\n\nSynonyms: proportion, rate, fraction, part, share\n",
        "exampleA": "What percentage of the students passed the exam?",
        "exampleB": "The sales team receives a percentage of the profits.",
        "exampleC": "A significant percentage of the population is now vaccinated.",
        "status": ""
    },
    {
        "id": "a09a1478-e13e-43d2-83fe-6ea9519b04fe",
        "word": "population",
        "persian": "\"Population\" در فارسی معمولاً به صورت \"جمعیت\" ترجمه می‌شود.\n",
        "definition": "\"Population\" refers to the entire group of individuals, objects, or events that are of interest in a particular study or area. It's the complete set from which a sample might be drawn, or the entire group being analyzed or discussed.\n\nSynonyms: inhabitants, community, populace, citizenry.\n",
        "exampleA": "The city's population has grown rapidly in recent years.",
        "exampleB": "Conservation efforts are crucial for maintaining the wild animal population.",
        "exampleC": "A large percentage of the population lacks access to clean water.",
        "status": ""
    },
    {
        "id": "9a6d0861-b967-4620-9555-0f5b3fbf2543",
        "word": "prediction",
        "persian": "پیش بینی",
        "definition": "A prediction is a statement about what someone thinks will happen in the future, based on information or evidence currently available. It's an attempt to foresee or anticipate a future event or outcome. Synonyms include forecast, projection, prognosis, and estimate.\n",
        "exampleA": "The economist's prediction about the recession proved to be accurate.",
        "exampleB": "Her psychic abilities are based on intuition rather than concrete prediction.",
        "exampleC": "We need to analyze the data to make a reasonable prediction about future sales.",
        "status": "learned"
    },
    {
        "id": "8b6667cc-b945-4265-9d95-9ab0f90f1934",
        "word": "productive",
        "persian": "پربار و تولید کننده",
        "definition": "\"Productive\" means achieving a significant amount of work or results; it's about being effective in generating output and accomplishing tasks efficiently. A productive person or process creates tangible value or progress.\nSynonyms: fruitful, efficient, effective, worthwhile, beneficial\n",
        "exampleA": "She had a very productive day, finishing all her tasks ahead of schedule.",
        "exampleB": "A productive meeting requires a clear agenda and active participation.",
        "exampleC": "The company invested in new software to make its employees more productive.",
        "status": "learned"
    },
    {
        "id": "c68e7fb3-e147-4800-87bb-5ecebf69f790",
        "word": "profound",
        "persian": "ژرف، تاثیر عمیق، عمیق",
        "definition": "\"Profound\" describes something that is deep, insightful, and intellectually stimulating. It suggests a level of understanding or impact that goes beyond the surface, often dealing with fundamental or abstract ideas. A profound statement or experience leaves a lasting impression and evokes thoughtful consideration.\n\nSynonyms: deep, insightful, significant, philosophical, weighty.\n",
        "exampleA": "The invention of the contraceptive pill brought about profound changes in the lives of women.",
        "exampleB": "The philosopher's profound insights changed the way I view the world.",
        "exampleC": "Her profound grief was evident in her tear-filled eyes.",
        "status": "seen"
    },
    {
        "id": "c814ab6b-e589-44e1-8c6e-ceeb6bae30e1",
        "word": "projection",
        "persian": "تخمین، پیش بینی",
        "definition": "Projection, in psychology, refers to unconsciously attributing one's own unacceptable thoughts, feelings, or motives to another person. Instead of acknowledging these undesirable traits within oneself, the individual projects them onto someone else, often leading to misinterpretations and distorted perceptions of that person.\n\nSynonyms: attribution, transference, externalization, ascription\n",
        "exampleA": "The company has failed to achieve last year's sales projections by 30 percent.",
        "exampleB": "The film's projection onto the screen was crisp and clear.",
        "exampleC": "Her therapist suggested that her anger was a projection of her own insecurities.",
        "status": "seen"
    },
    {
        "id": "331e6291-0824-40a2-967a-c2b22135c3c0",
        "word": "proportion",
        "persian": "نسبت",
        "definition": "Proportion refers to the relative size, amount, or degree of something compared to another. It describes the balanced or harmonious relationship between different parts or elements within a whole. It implies a sense of appropriate or pleasing ratio between things.\n\nSynonyms: ratio, balance, symmetry, fraction, percentage.\n",
        "exampleA": "A large proportion of the city's population lives below the poverty line.",
        "exampleB": "The recipe calls for a specific proportion of flour to sugar.",
        "exampleC": "The proportion of male to female students has shifted in recent years.",
        "status": "seen"
    },
    {
        "id": "7b13234a-b54a-4a68-a81f-b5fe30ebdd22",
        "word": "rate",
        "persian": "\"نرخ\"، \"میزان\"، \"ارزیابی\"، یا \"رتبه\" بسته به متن و مفهوم مورد نظر.\n",
        "definition": "\"Rate\" signifies a measure, quantity, or frequency, typically expressed as a proportion or ratio. It indicates how often something occurs in relation to something else, or the cost/value assigned to something per unit. Synonyms include pace, speed, level, charge, tariff, and proportion.\n",
        "exampleA": "What is the current interest rate on your savings account?",
        "exampleB": "Customers were asked to rate the new restaurant on a scale of 1 to 5.",
        "exampleC": "The company decided to rate employees based on their performance.",
        "status": ""
    },
    {
        "id": "0f37f9c0-d2ef-4a76-8a0f-0a7968099727",
        "word": "restaurant chain",
        "persian": "رستوران زنجیره ای",
        "definition": "A restaurant chain is a group of restaurants that share the same brand name, menu, design, and often ownership. These restaurants typically operate in multiple locations, sometimes across different cities, states, or even countries, aiming to provide a consistent dining experience for customers regardless of the specific branch they visit.\n\nSynonyms: restaurant franchise, fast-food chain, restaurant group, multi-unit restaurant.\n",
        "exampleA": "The restaurant chain expanded rapidly, opening new locations in several states.",
        "exampleB": "She prefers the local diner over any restaurant chain.",
        "exampleC": "The restaurant chain is known for its consistent quality and family-friendly atmosphere.",
        "status": "learned"
    },
    {
        "id": "1bef12d9-8d15-4c22-923f-d9f5fb51c8f9",
        "word": "ridiculous",
        "persian": "مسخره و مضحک",
        "definition": "\"Ridiculous\" describes something that is laughably absurd, preposterous, or foolish, often to the point of being deserving of mockery or scorn. It suggests a lack of seriousness or merit, and a clear departure from reason or good sense.\n\nSynonyms: absurd, ludicrous, preposterous, comical, farcical\n",
        "exampleA": "The suggestion that we walk home in this weather is ridiculous.",
        "exampleB": "He made a ridiculous claim that he could fly.",
        "exampleC": "That hat looks absolutely ridiculous on you.",
        "status": "seen"
    },
    {
        "id": "4b92c9ae-cbe5-4673-ba65-abc460b20058",
        "word": "sceptical",
        "persian": "\"Sceptical\" در فارسی معمولاً به صورت \"مشکوک\"، \"بدبین\"، \"با تردید\" یا \"شکاک\" ترجمه می‌شود. انتخاب بهترین معادل بستگی به بافت جمله دارد.\n",
        "definition": "\"Sceptical\" describes a state of doubt or disbelief about something, often due to a lack of evidence or a belief that claims are not likely to be true. It implies a questioning attitude and a reluctance to readily accept information or ideas without further investigation.\n\nSynonyms: doubtful, dubious, incredulous, cynical, questioning\n",
        "exampleA": "I am sceptical of claims that this diet will help me lose weight quickly.",
        "exampleB": "The scientists were sceptical about the initial results, demanding further experimentation.",
        "exampleC": "She remained sceptical even after he presented compelling evidence.",
        "status": ""
    },
    {
        "id": "f958dd98-51b7-45c9-a4e3-8fb8067c7d8f",
        "word": "sceptical (about sth)",
        "persian": "مشکوک",
        "definition": "Being \"sceptical (about something)\" means having doubts or hesitations about the truth or validity of a claim, idea, or plan. It implies a questioning attitude and a reluctance to readily accept something without sufficient evidence or reasoning. A sceptical person is not easily convinced and requires proof before forming a belief.\n\nSynonyms: doubtful, dubious, incredulous, questioning, cynical.\n",
        "exampleA": "Many experts remain sceptical about/of his claims.",
        "exampleB": "I am sceptical about the company's claims of rapid growth.",
        "exampleC": "She remained sceptical about his intentions, despite his apologies.",
        "status": "seen"
    },
    {
        "id": "a1dcf6c8-394f-4298-a194-00315e692193",
        "word": "short-term",
        "persian": "کوتاه مدت",
        "definition": "\"Short-term\" refers to something that is designed to last for, or occur over, a relatively brief period. It emphasizes a focus on immediate goals, results, or effects rather than long-term strategies or consequences. It implies a limited timeframe, often measured in days, weeks, or months.\n\nSynonyms: temporary, immediate, brief, provisional, transient.\n",
        "exampleA": "We are focused on achieving short-term goals before tackling the larger objectives.",
        "exampleB": "The company offered a short-term loan to help with immediate expenses.",
        "exampleC": "His memory is excellent for long-term events, but he struggles with short-term recall.",
        "status": "learned"
    },
    {
        "id": "bc945d2b-38a6-46a4-ac2b-719764105f53",
        "word": "soft drink",
        "persian": "نوشابه",
        "definition": "A soft drink is a non-alcoholic beverage, typically carbonated and flavored with sweeteners, natural or artificial flavors, and sometimes caffeine. It's designed to be refreshing and consumed for enjoyment rather than hydration or nutritional value.\n\nSynonyms: Soda, pop, fizzy drink, carbonated beverage.\n",
        "exampleA": "I'd like a burger and a soft drink, please.",
        "exampleB": "The vending machine only has sugary soft drinks.",
        "exampleC": "She prefers juice over soft drink when she's thirsty.",
        "status": "learned"
    },
    {
        "id": "f255439e-6041-4c85-b925-1c2b6da7e051",
        "word": "statistics",
        "persian": "\"آمار\" معادل دقیقی برای \"statistics\" در فارسی است و به معنای جمع‌آوری، تحلیل و تفسیر داده‌ها برای استخراج اطلاعات و الگوها به کار می‌رود.\n",
        "definition": "Statistics refers to the science of collecting, analyzing, interpreting, and presenting data. It's a multifaceted field used to extract meaningful insights from raw information, helping us understand patterns, trends, and relationships. Essentially, statistics provides the tools and techniques necessary to make informed decisions and draw reliable conclusions based on empirical evidence.\n\nSynonyms: data analysis, biometrics, econometrics, demography\n",
        "exampleA": "The professor emphasized the importance of understanding statistics for data analysis.",
        "exampleB": "According to official statistics, the unemployment rate has decreased.",
        "exampleC": "She used statistics to support her argument in the debate.",
        "status": ""
    },
    {
        "id": "44e9fc5d-fa2a-4686-ad69-9315641a2109",
        "word": "subsequent",
        "persian": "بعدی، متعاقب",
        "definition": "\"Subsequent\" means occurring or following something in time or order. It indicates that something happens after a specific event or point of reference.\n\nSynonyms: following, succeeding, later, ensuing.\n",
        "exampleA": "The initial report was inconclusive, but the subsequent investigation revealed the truth.",
        "exampleB": "Her subsequent actions proved she was truly sorry for what she had done.",
        "exampleC": "The meeting was scheduled for Tuesday, with a subsequent follow-up on Friday.",
        "status": "seen"
    },
    {
        "id": "291e32ae-d6e3-4674-96ba-3e163fbe94d0",
        "word": "tea shop",
        "persian": "چایخانه",
        "definition": "A tea shop is a small establishment that primarily serves tea and light refreshments like pastries, sandwiches, or cakes. It's a place where people can relax, socialize, and enjoy a variety of tea blends and flavors, often in a cozy and inviting atmosphere.\n\nSynonyms: tearoom, tea house, tea room\n",
        "exampleA": "We met at the tea shop on Main Street.",
        "exampleB": "The aroma of spices hung heavy in the air as we entered the tea shop.",
        "exampleC": "She dreamed of opening her own cozy tea shop one day.",
        "status": "learned"
    },
    {
        "id": "6e0eb8c3-b1e6-4aae-b00f-5b9bd60b3640",
        "word": "the other way round",
        "persian": "\"برعکس\" یا \"به‌طور معکوس\" بهترین ترجمه‌های این عبارت هستند.\n",
        "definition": "the reverse; the opposite",
        "exampleA": "Try it the other way round.",
        "exampleB": "I thought the concert was on Friday, but it's actually Thursday, or the other way round.",
        "exampleC": "You're holding the map upside down; it should be the other way round.",
        "status": "seen"
    },
    {
        "id": "3986fe39-46c3-4f70-8900-69951ee49273",
        "word": "trend",
        "persian": "\"Trend\" در فارسی معمولاً به \"روند\"، \"گرایش\"، \"مد روز\" یا \"رایج\" ترجمه می‌شود. بسته به متن و موضوع، می‌توان از این معادل‌ها استفاده کرد.\n",
        "definition": "A trend refers to a general direction in which something is developing or changing. It's a pattern or prevailing tendency, often observed over time, that indicates a shift in preference, behavior, or a particular phenomenon. Think of it as something becoming more popular or common.\n\nSynonyms: fad, vogue, fashion, tendency, direction, pattern.\n",
        "exampleA": "The latest trend in fashion is oversized clothing.",
        "exampleB": "Experts are analyzing the data to identify the emerging trend in the stock market.",
        "exampleC": "Social media plays a large role in shaping and spreading cultural trends.",
        "status": ""
    },
    {
        "id": "01c246f1-6e24-4dbd-9567-626c3262e730",
        "word": "urbanisation",
        "persian": "شهرنشینی، پدیده مهاجرت به شهرها",
        "definition": "Urbanisation refers to the process by which rural areas transform into urban areas, involving population shift from rural settings to cities, increased concentration of people in urban centers, and the development of urban infrastructure and amenities like housing, transportation, and services. It often accompanies economic growth and industrialization as people seek opportunities in cities.\n\nSynonyms: Urban development, city growth, urban sprawl, metropolisation.\n",
        "exampleA": "Urbanisation is rapidly changing the landscape of many developing countries.",
        "exampleB": "The government is struggling to manage the challenges associated with rapid urbanisation.",
        "exampleC": "Sustainable solutions are needed to mitigate the negative impacts of urbanisation on the environment.",
        "status": "learned"
    },
    {
        "id": "ab68ac2d-fe90-4000-916c-1a8a68b510ee",
        "word": "wealthy",
        "persian": "ثروتمند",
        "definition": "\"Wealthy\" describes someone who possesses a large amount of valuable possessions or money, exceeding what is necessary for basic needs and enabling a comfortable and often luxurious lifestyle. It implies financial security and the ability to afford a wide range of goods and services.\n\nSynonyms: rich, affluent, prosperous, well-off, opulent.\n",
        "exampleA": "The wealthy socialite threw a lavish party at her mansion.",
        "exampleB": "He became wealthy through shrewd investments in the stock market.",
        "exampleC": "Although they appeared wealthy, they were actually deeply in debt.",
        "status": "learned"
    },
    {
        "id": "0b96b5a6-7bdd-4d32-a168-5c970794664a",
        "word": "worldwide",
        "persian": "در سراسر جهان",
        "definition": "\"Worldwide\" means extending or applying throughout the entire world; encompassing all countries and regions. It signifies a global reach, influence, or impact. Synonyms include: global, international, universal, planet-wide.\n",
        "exampleA": "The company has expanded its operations worldwide.",
        "exampleB": "The pandemic had a worldwide impact on travel and tourism.",
        "exampleC": "This artist is known worldwide for their unique style.",
        "status": "learned"
    },
    {
        "id": "2ab9fc1f-b8df-4d31-84d8-3e9235539ae0",
        "word": "you can't be serious",
        "persian": "شوخی می کنی؟",
        "definition": "\"You can't be serious\" is an expression of disbelief, shock, or incredulity. It implies that the speaker finds what they've just heard or witnessed so unbelievable, outrageous, or absurd that they suspect it's a joke or that the other person must be mistaken or pulling their leg.\n\nSynonyms: Are you kidding me?, You're joking, No way!, Are you for real?, You've got to be kidding me.\n",
        "exampleA": "You want to quit your job to become a mime? You can't be serious!",
        "exampleB": "He spent all his savings on lottery tickets? You can't be serious.",
        "exampleC": "You're telling me you've never seen Star Wars? You can't be serious!",
        "status": "learned"
    }
]