[
    {
        "id": "a9b96cbb-6118-41fb-b208-99b2e65a8c72",
        "word": "abide (by)",
        "persian": "مطیع قانون یا تصمیم بودن",
        "definition": "\"Abide by\" means to accept and follow a rule, decision, or instruction. It implies obedience and adherence to a set of standards or regulations. In essence, it means to comply with something.\n\nSynonyms: obey, comply with, adhere to, conform to, follow, respect\n",
        "exampleA": "Competitors must abide by the judges’ decision.",
        "exampleB": "Citizens must abide by the laws of the land.",
        "exampleC": "Employees are expected to abide by the company's code of conduct.",
        "status": "seen"
    },
    {
        "id": "fe0637b9-9caa-4c8a-88ef-4814ea526554",
        "word": "abolish",
        "persian": "برانداختن , ازمیان بردن , منسوخ کردن.",
        "definition": "\"Abolish\" means to formally put an end to a practice, system, or institution, often through legal or official means. It implies a complete and permanent removal of something that was previously established or accepted.\n\nSynonyms: Eliminate, eradicate, terminate, repeal, nullify.\n",
        "exampleA": "Slavery was abolished in the US in the 19th century.",
        "exampleB": "Many people advocate to abolish the death penalty.",
        "exampleC": "The governor promised to abolish the outdated regulation.",
        "status": "seen"
    },
    {
        "id": "db0659e4-1abf-4718-bf11-1d4ba81c1e11",
        "word": "accept the consequences",
        "persian": "پذیرفتن عواقب کار",
        "definition": "\"Accept the consequences\" means to acknowledge and take responsibility for the outcomes, whether positive or negative, that result from one's actions, choices, or decisions. It implies owning up to the impact of your behavior without trying to deflect blame or avoid the repercussions.\n\nSynonyms: Face the music, bear the burden, own the outcome, pay the price, reap what you sow.\n",
        "exampleA": "He made a bad decision and had to accept the consequences.",
        "exampleB": "If you choose to break the rules, you must accept the consequences.",
        "exampleC": "She knew her actions were risky, but she was prepared to accept the consequences.",
        "status": "learned"
    },
    {
        "id": "9c1220bb-1ab8-4406-8996-47c5da24d31f",
        "word": "actions",
        "persian": "اقدامات",
        "definition": "\"Actions\" refer to something done, an act, or a deed performed, often with a specific intention or purpose. It encompasses the things people do and the processes of doing them.\n\nSynonyms: deeds, acts, behavior, conduct, activities\n",
        "exampleA": "His actions spoke louder than his words.",
        "exampleB": "The company's actions were met with public criticism.",
        "exampleC": "We must consider the potential consequences of our actions.",
        "status": "learned"
    },
    {
        "id": "8c95b5e3-7cf4-43b8-bd6e-dfcd04a9f867",
        "word": "anti-social behaviour",
        "persian": "رفتار ضد اجتماعی",
        "definition": "Anti-social behavior refers to actions that disregard or violate the rights of others, often causing distress, fear, or harm. It encompasses a wide range of activities, from minor annoyances to serious crimes, that disrupt community life and erode social cohesion. These behaviors typically deviate from accepted norms and expectations, impacting the well-being of individuals and the overall social order.\n\nSynonyms: Asocial behavior, Disruptive behavior, Delinquent behavior, Misconduct, Nuisance.\n",
        "exampleA": "The council is cracking down on anti-social behaviour in the park.",
        "exampleB": "Graffiti and vandalism are examples of anti-social behaviour.",
        "exampleC": "She was given a warning for her anti-social behaviour on the bus.",
        "status": "learned"
    },
    {
        "id": "92a854cd-3850-4cf3-a213-f4cbfa6c8f56",
        "word": "arson",
        "persian": "حریق عمدی",
        "definition": "Arson is the criminal act of intentionally setting fire to property, whether it's a building, vehicle, or land, with the intent to cause damage or destruction. It's a serious crime often motivated by factors like revenge, fraud (e.g., insurance scams), or vandalism.\n\nSynonyms: incendiarism, pyromania (related but more focused on a psychological impulse), firebombing.\n",
        "exampleA": "A cinema was burned out in north London last night. Police suspect arson.",
        "exampleB": "The abandoned building was destroyed by arson.",
        "exampleC": "He was arrested and charged with arson after setting fire to his neighbor's car.",
        "status": "seen"
    },
    {
        "id": "508ba81c-abdd-4547-bf9b-7244c85ac017",
        "word": "authority",
        "persian": "\"Authority\" بسته به متن می‌تونه به فارسی به صورت‌های مختلفی ترجمه بشه، اما رایج‌ترین معادل‌ها عبارتند از: «اقتدار»، «قدرت»، «صلاحیت»، «مرجعیت» و «اجازه».\n",
        "definition": "Authority refers to the legitimate power or right to give commands, enforce obedience, make decisions, and judge others. It's the recognized right to control, direct, or determine the actions of others, often derived from a formal position, expertise, or social norms.\n\nSynonyms: power, command, jurisdiction, dominion, control, influence\n",
        "exampleA": "The teacher has the authority to assign homework.",
        "exampleB": "The police officer used his authority to stop the speeding car.",
        "exampleC": "No one questioned the king's authority over the land.",
        "status": ""
    },
    {
        "id": "b432f18c-bd89-43f2-a1d2-0a355e5ceec4",
        "word": "burglary",
        "persian": "\"Burglary\" در فارسی به معنی سرقت از منزل/ساختمان یا دزدی از خانه است.\n",
        "definition": "Burglary is the act of illegally entering a building or other structure with the intent to commit a crime, typically theft. It involves unlawfully gaining access to a property and, usually, stealing something of value. The focus is on the unauthorized entry with criminal intent, regardless of whether anything is actually stolen.\n\nSynonyms: Breaking and entering, housebreaking, larceny, robbery (though robbery involves force or threat of force).\n",
        "exampleA": "The police are investigating a burglary at the jewelry store.",
        "exampleB": "She reported the burglary to her insurance company.",
        "exampleC": "The security system was installed to deter burglary.",
        "status": ""
    },
    {
        "id": "3562cc87-8a78-4ef1-9b9c-1c988edd8bb3",
        "word": "combat",
        "persian": "\"Combat\" در فارسی می‌تواند به معانی مختلفی مانند \"مبارزه\"، \"نبرد\"، \"درگیری\"، یا \"جنگ\" ترجمه شود. انتخاب دقیق‌ترین معادل به بافت جمله بستگی دارد.\n",
        "definition": "\"Combat\" refers to active fighting or conflict, especially between armed forces or individuals. It implies a direct and often violent engagement with an opponent, aiming to subdue, defeat, or eliminate them.\n\nSynonyms: battle, warfare, fighting, clash, engagement, skirmish\n",
        "exampleA": "The soldiers were trained in close-quarters combat.",
        "exampleB": "The documentary explored the ethical dilemmas of modern warfare combat.",
        "exampleC": "The company is looking for new ways to combat climate change.",
        "status": ""
    },
    {
        "id": "bcd19c39-ff2c-41cb-b553-e2704b1c6f27",
        "word": "commit a crime",
        "persian": "\"مرتکب جرم شدن\" یا \"جرم مرتکب شدن\".\n",
        "definition": "\"Commit a crime\" means to perform an action that is illegal and punishable by law. It signifies the act of breaking established rules and regulations of a society, leading to legal consequences.\n\nSynonyms: perpetrate a crime, break the law, offend, transgress, violate the law.\n",
        "exampleA": "He would never commit a crime, even to save himself.",
        "exampleB": "The suspect was apprehended before he could commit a crime.",
        "exampleC": "Poverty does not excuse the decision to commit a crime.",
        "status": ""
    },
    {
        "id": "41860c43-bb4c-4735-8efe-5b8aa9638d4a",
        "word": "consequences",
        "persian": "\"Consequences\" در فارسی معمولاً به صورت \"پیامدها\"، \"نتایج\" یا \"عواقب\" ترجمه می‌شود.\n",
        "definition": "\"Consequences\" refer to the results or effects of an action or event. They can be positive or negative, immediate or delayed, intended or unintended. Essentially, they are what happens as a direct or indirect outcome of something.\n\nSynonyms: aftermath, repercussions, outcome, results.\n",
        "exampleA": "Every action has consequences, both positive and negative.",
        "exampleB": "He didn't think about the consequences of his decision before acting.",
        "exampleC": "The city is still dealing with the consequences of the economic downturn.",
        "status": ""
    },
    {
        "id": "d5d844d6-69cd-42ff-836b-d68ea977c7af",
        "word": "convict",
        "persian": "محکوم",
        "definition": "To convict means to formally declare someone guilty of a criminal offense after a legal trial. It signifies the legal determination that a person committed the crime they were accused of, resulting in a sentence or punishment.\n\nSynonyms: condemn, sentence, find guilty, judge.\n",
        "exampleA": "an escaped convict",
        "exampleB": "The evidence was strong enough to convict him of the crime.",
        "exampleC": "Even after serving his time, society still labeled him as a convict.",
        "status": "seen"
    },
    {
        "id": "cb786282-6690-468d-940a-499abc7a8ab3",
        "word": "convict a criminal",
        "persian": "مجرم را محکوم کردن",
        "definition": "To \"convict a criminal\" means to formally declare in a court of law that a person accused of a crime is guilty after a trial or legal proceedings. It signifies that the prosecution has presented sufficient evidence to prove beyond a reasonable doubt that the accused committed the offense, leading to a judgment of guilt.\n\nSynonyms: find guilty, condemn, sentence, doom.\n",
        "exampleA": "She was convicted of shoplifting.",
        "exampleB": "The evidence was overwhelming, and the jury was able to convict a criminal who had terrorized the community for years.",
        "exampleC": "Even with a strong defense team, the prosecution managed to convict a criminal of fraud and embezzlement.",
        "status": "seen"
    },
    {
        "id": "3b53ceea-1c57-4b89-b734-adc27118faea",
        "word": "crime",
        "persian": "جرم، جنایت، بزه یا خلاف، بسته به نوع و شدت عمل.\n",
        "definition": "A crime is an act or omission that violates a law punishable by a governmental authority. It is an offense against society as a whole, often involving harm or threat to individuals or property, and results in legal penalties like fines, imprisonment, or community service.\n\nSynonyms: offense, violation, felony, misdemeanor, wrongdoing.\n",
        "exampleA": "The increase in petty crime has alarmed local residents.",
        "exampleB": "He was found guilty of committing a serious crime.",
        "exampleC": "The detective dedicated his life to fighting crime.",
        "status": ""
    },
    {
        "id": "e1cbf1ab-921e-4bee-86ec-bd511ee7249b",
        "word": "crime rate",
        "persian": "نرخ جرم",
        "definition": "The crime rate represents the proportion of crimes committed within a specific geographic area or population group over a defined period, typically expressed as the number of crimes per 100,000 people. It serves as a standardized measure to compare criminal activity across different locations or timeframes, helping to identify trends and inform public safety policies.\n\nSynonyms: crime statistics, incidence of crime, level of criminality, crime frequency.\n",
        "exampleA": "The city's efforts to reduce the crime rate have been successful.",
        "exampleB": "There is a direct correlation between poverty and the crime rate in this area.",
        "exampleC": "Residents are concerned about the recent spike in the crime rate.",
        "status": "learned"
    },
    {
        "id": "18c929b3-1ff6-48ae-9338-113794efe0cd",
        "word": "criminal",
        "persian": "\"مجرم\"، \"جنایتکار\" یا \"متهم\" بسته به بافت جمله می‌تواند معادل‌های مناسبی برای \"criminal\" باشند.\n",
        "definition": "A \"criminal\" is a person who has committed an act prohibited by law and is thus subject to punishment. It denotes someone who has violated the established rules and norms of a society, often involving harm or wrongdoing to others or the state.\n\nSynonyms: offender, culprit, felon, transgressor, lawbreaker\n",
        "exampleA": "The criminal was apprehended after a high-speed chase.",
        "exampleB": "He was accused of being a criminal mastermind.",
        "exampleC": "The judge sentenced the criminal to five years in prison.",
        "status": ""
    },
    {
        "id": "303f13d0-3afd-4458-88bc-10dc10897f4f",
        "word": "criminal",
        "persian": "\"مجرم\"، \"جنایتکار\" یا \"متهم\" بسته به بافت جمله می‌تواند معادل‌های مناسبی برای \"criminal\" باشند.\n",
        "definition": "A \"criminal\" is a person who has committed an act prohibited by law and is thus subject to punishment. It denotes someone who has violated the established rules and norms of a society, often involving harm or wrongdoing to others or the state.\n\nSynonyms: offender, culprit, felon, transgressor, lawbreaker\n",
        "exampleA": "The criminal was apprehended after a high-speed chase.",
        "exampleB": "He was accused of being a criminal mastermind.",
        "exampleC": "The judge sentenced the criminal to five years in prison.",
        "status": ""
    },
    {
        "id": "70405a72-e1a1-4fb5-bbd2-053aff1bfede",
        "word": "deter",
        "persian": "\"Deter\" در فارسی به معنی منصرف کردن، بازداشتن، یا جلوگیری کردن است.\n",
        "definition": "To deter means to discourage someone from doing something, typically through fear or doubt. It involves dissuading or preventing an action by instilling apprehension about the consequences.\n\nSynonyms: discourage, dissuade, prevent, hinder, restrain\n",
        "exampleA": "The high price of the tickets may deter some fans from attending the concert.",
        "exampleB": "Police hope the increased patrols will deter crime in the neighborhood.",
        "exampleC": "The threat of punishment did not deter him from repeating the offense.",
        "status": ""
    },
    {
        "id": "2ee8ef51-f6f1-4bbb-bc96-1ae2694085ec",
        "word": "deterrent",
        "persian": "عامل بازدارنده",
        "definition": "A deterrent is something that discourages or prevents someone from doing something, typically through fear or doubt of the consequences. It aims to dissuade action by presenting a negative outcome or risk associated with that action.\n\nSynonyms: discouragement, impediment, restraint, hindrance, disincentive.\n",
        "exampleA": "Window locks are an effective deterrent against burglars.",
        "exampleB": "The high cost of the security system acted as a deterrent to potential burglars.",
        "exampleC": "Nuclear weapons are considered a deterrent to large-scale war.",
        "status": "seen"
    },
    {
        "id": "b31fd3e3-1369-4b41-a2cb-c9e8077431da",
        "word": "deter (someone from doing sth)",
        "persian": "بازداشتن",
        "definition": "\"Deter (someone from doing something)\" means to discourage or prevent someone from taking a particular action, often by instilling fear or doubt about the consequences. It involves using persuasion, threats, or other means to dissuade them and make them decide against it.\n\nSynonyms: discourage, dissuade, prevent, restrain, hinder.\n",
        "exampleA": "The security camera was installed to deter people from stealing.",
        "exampleB": "The high price of gasoline may deter some people from taking long road trips.",
        "exampleC": "A strong security system can deter burglars from attempting to break into a house.",
        "status": "seen"
    },
    {
        "id": "bbd37d6f-042c-46ce-82dc-fca728643ac7",
        "word": "drug-related",
        "persian": "مربوط به مواد مخدر",
        "definition": "\"Drug-related\" simply means connected to, caused by, or associated with the use, possession, production, or trafficking of illegal drugs, or the misuse of prescription drugs. It describes something that has a clear and direct link to drugs, often in a negative or problematic context.\n\nSynonyms: substance-related, drug-induced, narcotic-related, pharmacology-related.\n",
        "exampleA": "The city is trying to reduce drug-related crime.",
        "exampleB": "She was arrested on drug-related charges.",
        "exampleC": "Poverty and unemployment are often linked to drug-related problems.",
        "status": "learned"
    },
    {
        "id": "210791ea-47e7-4bd6-81c2-24fec6f786ab",
        "word": "elusive",
        "persian": "دور از دسترس",
        "definition": "\"Elusive\" describes something that is difficult to find, catch, understand, or achieve. It implies a quality of being evasive or hard to pin down, often disappearing quickly or slipping through one's grasp. In essence, it's something that tantalizes and evades capture or comprehension.\n\nSynonyms: evasive, slippery, intangible, fleeting, indefinable.\n",
        "exampleA": "The solution to the puzzle remained elusive despite hours of effort.",
        "exampleB": "Success can be elusive, requiring hard work and dedication to achieve.",
        "exampleC": "The rare snow leopard is an elusive creature, rarely seen in its natural habitat.",
        "status": "seen"
    },
    {
        "id": "a7c83cce-3b8e-4742-8ee4-3427600f8a18",
        "word": "enforce",
        "persian": "اجراکردن‌ ، (بازور) از پیش‌ بردن‌ ، وادار کردن‌ ،",
        "definition": "To enforce means to compel obedience to a law, rule, or command, often through the use of authority or power. It involves ensuring that established regulations are followed and that those who violate them are held accountable.\n\nSynonyms: Implement, execute, administer, impose, apply.\n",
        "exampleA": "Parking restrictions will be\t strictly enforced.",
        "exampleB": "The police will enforce the new traffic regulations.",
        "exampleC": "It's the company's responsibility to enforce its code of conduct.",
        "status": "seen"
    },
    {
        "id": "9d8391d5-7257-4d67-928e-ca3f77288ed5",
        "word": "evidence",
        "persian": "شواهد، مدارک، قرائن یا نشانه‌ها، همگی می‌توانند به عنوان ترجمه فارسی \"evidence\" به کار روند. انتخاب دقیق‌ترین کلمه به بافت جمله بستگی دارد.\n",
        "definition": "Evidence is any form of information, such as documents, testimony, or physical objects, that is presented to support a claim or belief, and used to determine the truth of a matter, especially in a legal or investigative context. It serves as proof to persuade someone of something's validity or existence.\n\nSynonyms: proof, confirmation, verification, indication, testimony.\n",
        "exampleA": "The police gathered evidence at the crime scene.",
        "exampleB": "There is overwhelming evidence to support his claim.",
        "exampleC": "The lawyer presented compelling evidence during the trial.",
        "status": ""
    },
    {
        "id": "f7310614-263a-409b-be19-fe81000625b5",
        "word": "evil",
        "persian": "بد، شر و شرورانه",
        "definition": "\"Evil\" refers to profound immorality, wickedness, and malevolence. It signifies a deep-seated desire to cause harm, suffering, or destruction to others, often without remorse or justification. Evil is the antithesis of good, representing the most extreme form of negativity in human behavior and thought.\n\nSynonyms: wickedness, depravity, malice, iniquity, villainy.\n",
        "exampleA": "The evil sorcerer plotted to steal the kingdom's magic.",
        "exampleB": "She fought against the evil that threatened to consume her city.",
        "exampleC": "His heart was filled with an evil desire for revenge.",
        "status": "learned"
    },
    {
        "id": "79edac82-378c-4e1f-8711-b05579b06201",
        "word": "fine",
        "persian": "معنی کلمه \"fine\" بسته به متن می‌تونه متفاوت باشه. چند تا از رایج‌ترین معانی اون عبارتند از:\n\n   خوب/عالی: (مثلاً: \"حالم خوبه\")\n   جریمه: (مثلاً: \"جریمه شدم\")\n   نازک/ظریف: (مثلاً: \"پارچه ظریفی است\")\n   قبول/باشه: (مثلاً: \"باشه، انجامش میدم\")\n",
        "definition": "\"Fine\" is a versatile word that generally implies something is satisfactory, acceptable, or of good quality. It can also mean a sum of money paid as a penalty for an offense. Context is crucial to understanding its specific meaning.\n\nSynonyms: acceptable, satisfactory, penalty, excellent, exquisite\n",
        "exampleA": "I am doing fine, thank you for asking.",
        "exampleB": "The antique vase was a fine example of Ming dynasty porcelain.",
        "exampleC": "You will have to pay a fine for parking in a restricted area.",
        "status": ""
    },
    {
        "id": "e1b1b578-e6ce-44c3-b21a-4915040e9150",
        "word": "fraud",
        "persian": "کلاهبرداری",
        "definition": "Fraud is intentional deception to secure unfair or unlawful gain, or to deprive a victim of a legal right. It often involves misrepresentation, concealment, or a violation of trust to manipulate someone for personal or financial benefit.\n\nSynonyms: deception, swindle, deceit, trickery, hoax.\n",
        "exampleA": "tax/insurance/credit card etc fraud",
        "exampleB": "The company was accused of committing accounting fraud to inflate its profits.",
        "exampleC": "He was arrested for credit card fraud after making several unauthorized purchases.",
        "status": "learned"
    },
    {
        "id": "89f8c7cd-34db-41db-8da7-f3b4a9bfbe6a",
        "word": "guilty",
        "persian": "مرتکب ،گناهکار،مقصر،بزهکار،مجرم ،محکوم",
        "definition": "\"Guilty\" signifies bearing responsibility for a wrongdoing, crime, or fault, and is often associated with feelings of remorse or shame. It indicates that someone has committed an offense and is therefore deserving of blame or punishment.\nSynonyms: culpable, blameworthy, responsible, at fault.\n",
        "exampleA": "The jury found him guilty of all charges.",
        "exampleB": "She felt guilty about eating the last cookie.",
        "exampleC": "He had a guilty conscience after lying to his friend.",
        "status": "seen"
    },
    {
        "id": "16885ec6-f61f-4ed9-9403-b83bdc510416",
        "word": "harsh",
        "persian": "تند و خشن، severe and unpleasant",
        "definition": "\"Harsh\" describes something severe, ungentle, or cruel, often causing pain or discomfort. It can apply to physical conditions like weather, treatment of others, or judgments. It implies a lack of leniency or compassion and a potentially damaging impact.\n\nSynonyms: severe, cruel, brutal, unforgiving, stringent.\n",
        "exampleA": "a harsh winter",
        "exampleB": "The desert climate is incredibly harsh, making survival difficult.",
        "exampleC": "His harsh words deeply hurt her feelings.",
        "status": "learned"
    },
    {
        "id": "496b80c3-106c-4f59-bc80-447217be0b9b",
        "word": "impose a fine",
        "persian": "جریمه اعمال کردن",
        "definition": "\"Impose a fine\" means to officially require someone to pay a sum of money as a penalty for breaking a law, rule, or agreement. It's a punishment designed to deter future undesirable behavior and provide a form of retribution.\n\nSynonyms: Penalize, levy a charge, fine, sanction.\n",
        "exampleA": "The judge decided to impose a fine of $500 for the traffic violation.",
        "exampleB": "The city council threatened to impose a fine on residents who didn't recycle.",
        "exampleC": "If you violate the terms of the agreement, we will have to impose a fine.",
        "status": "seen"
    },
    {
        "id": "a3f2a1f9-43e2-49b9-af3f-e40e8cc05e52",
        "word": "imprison",
        "persian": "به زندان انداختن",
        "definition": "\"Imprison\" means to confine someone in a prison or similar place, thereby depriving them of their freedom. It signifies the act of legally restraining a person against their will.\n\nSynonyms: incarcerate, jail, detain, confine, intern.\n",
        "exampleA": "The government imprisoned all opposition leaders.",
        "exampleB": "The corrupt official was imprisoned for accepting bribes.",
        "exampleC": "They threatened to imprison anyone who spoke out against the regime.",
        "status": "seen"
    },
    {
        "id": "352881dd-f040-4ed7-88bb-348c8652bfea",
        "word": "imprisonment",
        "persian": "حبس",
        "definition": "Imprisonment refers to the state of being confined or held in custody, typically as a punishment for a crime or offense. It involves the restriction of a person's freedom and movement within a defined space, like a jail or prison. Synonyms include incarceration, confinement, detention, and custody.\n",
        "exampleA": "They were sentenced to 6 years' imprisonment./ life imprisonment",
        "exampleB": "The judge sentenced him to five years of imprisonment for the crime.",
        "exampleC": "Her art explores themes of confinement and imprisonment, both physical and emotional.",
        "status": "seen"
    },
    {
        "id": "b6ba0c8d-f10e-4cdf-9afd-1b85886d62f3",
        "word": "inequality",
        "persian": "نابرابری",
        "definition": "Inequality refers to the state of not being equal, especially in status, rights, or opportunities. It describes situations where resources, power, or privileges are distributed unevenly among individuals or groups, often resulting in unfair advantages for some and disadvantages for others.\n\nSynonyms: disparity, inequity, imbalance, unevenness, discrimination\n",
        "exampleA": "There are inequalities in wealth distribution.",
        "exampleB": "The vast inequality in wealth distribution is a pressing social issue.",
        "exampleC": "Addressing inequality in education is crucial for creating a more just society.",
        "status": "seen"
    },
    {
        "id": "807d441a-d1a6-430e-9658-7c9aa58dd218",
        "word": "innocent",
        "persian": "بی گناه",
        "definition": "\"Innocent\" means being free from guilt or wrongdoing, lacking knowledge or awareness of evil or wrong, or having a pure and harmless nature. It signifies a state of being untainted by involvement in a crime, offense, or harmful action.\n\nSynonyms: blameless, guiltless, pure, naive, impeccable.\n",
        "exampleA": "The jury found the defendant innocent of all charges.",
        "exampleB": "She had an innocent look on her face, but she was hiding a secret.",
        "exampleC": "Even though he was cleared, the shadow of suspicion lingered, making it difficult for him to truly feel innocent.",
        "status": "seen"
    },
    {
        "id": "76da57b1-4b1b-4633-b205-5fd77c2bd4d9",
        "word": "insane",
        "persian": "شخص مجنون و دیوانه",
        "definition": "\"Insane\" describes a state of severe mental illness or irrationality that often leads to unpredictable or dangerous behavior. It implies a detachment from reality and a loss of sound judgment.\n\nSynonyms: Mad, Crazy, Lunatic, Deranged, Psychotic.\n",
        "exampleA": "The traffic this morning was absolutely insane.",
        "exampleB": "His plan was so daring, some people called it insane.",
        "exampleC": "That rollercoaster is insane; I'm too scared to ride it.",
        "status": "seen"
    },
    {
        "id": "7f05aa8f-c46c-45fa-9f88-63c42233996c",
        "word": "intent",
        "persian": "\"Intent\" بسته به متن می‌تونه به معانی مختلفی ترجمه بشه، اما در بیشتر موارد به معنی \"قصد\"، \"نیت\" یا \"هدف\" هست.\n",
        "definition": "\"Intent\" refers to a state of mind in which someone plans and desires to achieve a particular outcome or purpose. It's about having a clear goal and aiming to accomplish it. The word implies purposefulness and a commitment to taking action toward a specific objective.\n\nSynonyms: purpose, intention, aim, goal, objective.\n",
        "exampleA": "The judge questioned the defendant's intent behind the actions.",
        "exampleB": "Despite the difficulties, her intent was to finish the marathon.",
        "exampleC": "It's important to understand the underlying intent of the new policy.",
        "status": ""
    },
    {
        "id": "38006a54-984d-4c9b-a10d-35435d70da4d",
        "word": "intentional",
        "persian": "عمدی",
        "definition": "\"Intentional\" means done on purpose; something planned or deliberate, rather than accidental or unintentional. It implies a conscious decision and a specific aim or goal behind the action.\n\nSynonyms: Deliberate, planned, purposeful, conscious, calculated\n",
        "exampleA": "The mistake wasn't accidental; it was intentional.",
        "exampleB": "Her intentional disregard for the rules resulted in a penalty.",
        "exampleC": "The artist's intentional use of color created a striking effect.",
        "status": "seen"
    },
    {
        "id": "98b1b03f-f9e6-4845-849d-0718f7fa0e8a",
        "word": "intent (with intent to do sth)",
        "persian": "قصد و نیت",
        "definition": "\"Intent\" signifies a person's purpose or aim in doing something, reflecting their conscious decision and desire to achieve a particular outcome. When someone acts \"with intent,\" it means they have a deliberate plan and are purposefully trying to accomplish a specific goal.\n\nSynonyms: purpose, intention, aim, goal, objective, design, motivation.\n",
        "exampleA": "He is charged with possession of a gun with intent to commit a robbery.",
        "exampleB": "She entered the building with intent to steal the documents.",
        "exampleC": "He approached the situation with intent to find a peaceful resolution.",
        "status": "seen"
    },
    {
        "id": "7338cd73-4c85-457a-9daa-68359cc7836f",
        "word": "intrusion",
        "persian": "مزاحمت، ورود، دخول سرزده و بدون اجازه،",
        "definition": "\"Intrusion\" refers to the act of entering a place or situation where one is not welcome or permitted, often involving a disruption or violation of privacy or security. It implies an unwelcome and often disruptive presence.\n\nSynonyms: trespass, encroachment, invasion, infringement, interference.\n",
        "exampleA": "I resented this intrusion into my domestic affairs.",
        "exampleB": "The sudden intrusion of the paparazzi disrupted the peaceful wedding ceremony.",
        "exampleC": "The security system is designed to prevent any unauthorized intrusion into the network.",
        "status": "seen"
    },
    {
        "id": "9d5d9f72-152c-4104-bc55-edbb611cbb82",
        "word": "judge",
        "persian": "\"Judge\" در فارسی می‌تواند معانی مختلفی داشته باشد. بسته به متن، می‌تواند به معانی زیر ترجمه شود:\n\n   قاضی: وقتی که در مورد فردی در دادگاه صحبت می‌کنیم.\n   داور: وقتی در مورد یک مسابقه یا رقابت صحبت می‌کنیم.\n   ارزیابی کردن/قضاوت کردن: وقتی در مورد نظر دادن یا تصمیم‌گیری صحبت می‌کنیم.\n",
        "definition": "\"Judge\" refers to a person who presides over a court of law and is authorized to hear and decide legal cases, interpreting laws, assessing evidence, and ultimately rendering verdicts or sentences. They are central to the justice system, ensuring fair proceedings and upholding the rule of law.\n\nSynonyms: adjudicator, arbiter, magistrate, justice, referee.\n",
        "exampleA": "The judge banged the gavel to restore order in the courtroom.",
        "exampleB": "It's not fair to judge a book by its cover.",
        "exampleC": "I wouldn't want to judge their decision without knowing all the facts.",
        "status": ""
    },
    {
        "id": "9aa5a4a8-b437-433c-9d44-2c4cfc97a39f",
        "word": "jury",
        "persian": "\"هیئت منصفه\" بهترین و رایج‌ترین ترجمه برای کلمه \"jury\" به فارسی است.\n",
        "definition": "A jury is a group of ordinary citizens selected and sworn in to hear evidence and determine the facts in a legal case, ultimately reaching a verdict on matters of guilt, liability, or responsibility. They are an essential part of the legal system, ensuring a fair trial by providing an impartial judgment based on the evidence presented.\n\nSynonyms: panel, tribunal, body of jurors, peers.\n",
        "exampleA": "The jury deliberated for three days before reaching a verdict.",
        "exampleB": "Serving on a jury is a civic duty.",
        "exampleC": "The defense attorney argued to the jury that there was reasonable doubt.",
        "status": ""
    },
    {
        "id": "0c226e64-ed89-4b7d-a325-865be1c34e35",
        "word": "kidnapping",
        "persian": "گروگانگیری",
        "definition": "Kidnapping is the act of unlawfully seizing and detaining a person against their will, usually with the intent to hold them for ransom or other illegal purposes. It deprives the victim of their freedom and autonomy, causing significant distress and potentially lasting trauma.\n\nSynonyms: abduction, seizure, capture, snatching, hijacking.\n",
        "exampleA": "The police are investigating a case of kidnapping.",
        "exampleB": "The ransom demand was the first sign of the kidnapping.",
        "exampleC": "He was charged with conspiracy to commit kidnapping.",
        "status": "seen"
    },
    {
        "id": "ce24a8c7-30e3-4a04-93e4-4045cc61ca45",
        "word": "law-abiding",
        "persian": "تابع قانون",
        "definition": "\"Law-abiding\" describes someone who consistently obeys the laws and regulations of their society. It signifies a respect for legal authority and a commitment to upholding the rules that govern conduct. A law-abiding citizen typically avoids criminal activity and contributes positively to the community.\n\nSynonyms: compliant, obedient, lawful, upright, honest.\n",
        "exampleA": "a law-abiding citizen",
        "exampleB": "The law-abiding citizens paid their taxes on time.",
        "exampleC": "He was known as a law-abiding member of the community.",
        "status": "seen"
    },
    {
        "id": "e384e809-6917-4add-9918-6aba490eb149",
        "word": "lawyer",
        "persian": "\"Lawyer\" در فارسی به «وکیل» یا «حقوقدان» ترجمه می‌شود. «وکیل» بیشتر به کسی اشاره دارد که وکالت پرونده‌های قضایی را بر عهده دارد، در حالی که «حقوقدان» به کسی گفته می‌شود که دانش حقوقی دارد.\n",
        "definition": "A lawyer is a professional who is educated and licensed to practice law, representing clients in legal matters. They advise individuals and organizations on their legal rights and obligations, and advocate for them in court or through negotiations. They possess expertise in specific areas of law, such as criminal law, corporate law, or family law.\n\nSynonyms: Attorney, Counselor, Advocate, Solicitor, Barrister.\n",
        "exampleA": "She hired a lawyer to represent her in the divorce proceedings.",
        "exampleB": "The lawyer argued passionately for his client's innocence.",
        "exampleC": "He dreamed of becoming a lawyer and fighting for justice.",
        "status": ""
    },
    {
        "id": "ddfa5412-ce43-48ab-ba75-58b82240b1fc",
        "word": "monitor",
        "persian": "نظارت کردن، دیده بانی کردن",
        "definition": "\"Monitor\" means to observe, supervise, or keep track of something over a period of time, often for a specific purpose like ensuring quality, safety, or proper functioning. It implies paying close attention and potentially intervening if necessary.\n\nSynonyms: observe, supervise, track, oversee, watch, survey.\n",
        "exampleA": "Please monitor the patient's heart rate closely.",
        "exampleB": "The teacher uses a large screen to monitor student progress.",
        "exampleC": "I need to monitor my expenses to stay within budget.",
        "status": "learned"
    },
    {
        "id": "75e31677-a9fc-422d-b02d-157444a220c2",
        "word": "motive",
        "persian": "انگیزه پنهان، انگیزه",
        "definition": "A motive is the underlying reason or driving force behind someone's actions or decisions. It explains why someone does something, revealing their needs, desires, or goals. It can be conscious or subconscious, and it's often crucial in understanding and interpreting behavior.\n\nSynonyms: reason, intention, purpose, impetus, incentive.\n",
        "exampleA": "The police believe the motive for this murder was jealousy.",
        "exampleB": "The detective tried to understand the suspect's motive for the crime.",
        "exampleC": "Her primary motive for volunteering was to help others.",
        "status": "learned"
    },
    {
        "id": "a9adc1f1-12b6-43e1-b240-2c394bbb8e79",
        "word": "murder",
        "persian": "قتل",
        "definition": "Murder is the unlawful and intentional killing of another human being. It is a grave crime with severe legal consequences, typically involving malice aforethought. Synonyms include homicide, manslaughter, assassination, and slaying.\n",
        "exampleA": "The detective investigated the brutal murder.",
        "exampleB": "Witnesses were hesitant to come forward after the murder.",
        "exampleC": "The motive for the murder remains unknown.",
        "status": "learned"
    },
    {
        "id": "435f6161-261e-442d-8931-5f7fecb6746e",
        "word": "non-violent",
        "persian": "غیر خشونت آمیز",
        "definition": "\"Non-violent\" describes the practice of achieving social or political goals without using physical force, aggression, or violence. It emphasizes methods like peaceful protests, civil disobedience, dialogue, and negotiation to bring about change. It's a philosophy and a strategy rooted in respecting the dignity and worth of all individuals, even opponents.\n\nSynonyms: peaceful, pacifist, non-aggressive, bloodless, unarmed.\n",
        "exampleA": "The protesters engaged in non-violent resistance, refusing to fight back against the police.",
        "exampleB": "Martin Luther King Jr. was a staunch advocate for non-violent social change.",
        "exampleC": "The organization promotes non-violent conflict resolution strategies.",
        "status": "learned"
    },
    {
        "id": "dcc160e5-c175-40c4-9a53-d013c71d04d0",
        "word": "obey",
        "persian": "از قانون پیروی کردن",
        "definition": "To obey means to comply with a command, direction, or law. It involves submitting to authority and acting in accordance with the instructions received. Essentially, it's about following rules and directives, whether from a person, institution, or set of principles.\n\nSynonyms: comply, heed, submit, adhere, follow.\n",
        "exampleA": "The dog was trained to obey commands.",
        "exampleB": "Children should learn to obey their parents and teachers.",
        "exampleC": "Soldiers must obey orders without question.",
        "status": "learned"
    },
    {
        "id": "209ba50c-d167-4142-abfb-c796bda6ae64",
        "word": "offence",
        "persian": "قانون شکنی، جرم",
        "definition": "An offence refers to an act or omission that violates a law and is punishable by legal authorities. It is generally considered to be a wrongdoing against the state or public order, leading to consequences like fines, imprisonment, or other penalties.\n\nSynonyms: crime, violation, transgression, infraction, misdemeanor.\n",
        "exampleA": "a criminal/drink-driving offence",
        "exampleB": "He committed an offence by driving under the influence.",
        "exampleC": "The judge considered the severity of the offence when handing down the sentence.",
        "status": "seen"
    },
    {
        "id": "be1a6c46-313c-4f23-b3e7-f446ab270bc8",
        "word": "offend",
        "persian": "رنجاندن، دلخور کردن",
        "definition": "To offend means to cause someone to feel resentful, upset, or annoyed, often by doing or saying something considered rude, disrespectful, or inappropriate. It implies a violation of someone's sensibilities or expectations of courteous behavior.\n\nSynonyms: insult, affront, displease, irritate, anger.\n",
        "exampleA": "His remarks deeply offended many Scottish people.",
        "exampleB": "I didn't mean to offend anyone with my comment.",
        "exampleC": "His behavior was likely to offend many people.",
        "status": "seen"
    },
    {
        "id": "7467d89f-5405-4659-a973-afbd85dc43a8",
        "word": "offensive",
        "persian": "توهین آمیز",
        "definition": "\"Offensive\" describes something that causes displeasure, anger, or resentment. It suggests something that is rude, insulting, or likely to provoke a negative reaction due to its content, nature, or manner. It violates social norms or personal sensitivities.\n\nSynonyms: insulting, rude, disrespectful, objectionable, unpleasant.\n",
        "exampleA": "I found her remarks\t deeply offensive. offensive behaviour",
        "exampleB": "His joke was considered deeply offensive by many in the audience.",
        "exampleC": "The team removed the offensive mascot after years of protests.",
        "status": "seen"
    },
    {
        "id": "a69b7c0f-5b87-47f1-8025-2886167946a8",
        "word": "on trial",
        "persian": "در حال محاکمه",
        "definition": "\"On trial\" means that a person or entity is currently undergoing a formal legal examination in a court of law to determine their guilt or innocence concerning an alleged crime or wrongdoing. It signifies the stage in the legal process where evidence is presented, witnesses are questioned, and a judge or jury deliberates to reach a verdict.\n\nSynonyms: in court, under indictment, facing prosecution.\n",
        "exampleA": "He was on trial for assault and robbery.",
        "exampleB": "The defendant is on trial for alleged fraud.",
        "exampleC": "The new software is on trial with a select group of users.",
        "status": "seen"
    },
    {
        "id": "2cfc7f35-f6e8-4c24-9bab-1214fcfd8221",
        "word": "pass a law",
        "persian": "قانون تصویب کردن",
        "definition": "To \"pass a law\" means to formally enact a legislative bill, meaning it has successfully gone through all the required stages of review, debate, and voting within a legislative body (like a parliament or congress) and has been approved. The bill then becomes an official law of the land, carrying legal weight and consequences.\n\nSynonyms: enact, legislate, approve, ratify, adopt.\n",
        "exampleA": "Congress has been struggling to pass a law addressing climate change.",
        "exampleB": "The local council decided to pass a law banning single-use plastic bags.",
        "exampleC": "Citizens are petitioning the government to pass a law protecting endangered species.",
        "status": "seen"
    },
    {
        "id": "7eeef008-f1a0-4541-9443-5ded3931cee9",
        "word": "perpetrate",
        "persian": "\"Perpetrate\" در فارسی معمولاً به معنی \"مرتکب شدن\"، \"انجام دادن\" (به ویژه یک عمل بد یا جرم)، یا \"دست زدن به\" ترجمه می‌شود.\n",
        "definition": "commit",
        "exampleA": "Who could have perpetrated such a dreadful crime?",
        "exampleB": "The rebels planned to perpetrate acts of violence against the government.",
        "exampleC": "He was accused of helping to perpetrate the fraud.",
        "status": "seen"
    },
    {
        "id": "77f01bb2-6ff7-4519-bd2e-abb1e2f61513",
        "word": "petty (crime)",
        "persian": "\"Petty crime\" را می‌توان به فارسی «جرم‌های کوچک»، «جرم‌های جزئی» یا «خلاف‌های سبک» ترجمه کرد.\n",
        "definition": "A petty crime refers to a minor offense that is generally not considered a serious violation of the law. These crimes typically result in relatively light penalties, such as fines or community service, rather than imprisonment. Examples include things like shoplifting small items, traffic violations, or minor acts of vandalism.\n\nSynonyms: minor, trivial, insignificant, misdemeanor, petty offense.\n",
        "exampleA": "Shoplifting is often considered a petty crime.",
        "exampleB": "The defendant was charged with several counts of petty crime, including vandalism and loitering.",
        "exampleC": "Although the consequences of petty crime may seem insignificant, they can still impact communities.",
        "status": ""
    },
    {
        "id": "4ecadfe5-f7d8-4346-a527-a60c740a7427",
        "word": "petty crime",
        "persian": "جرم کوچک و خرده",
        "definition": "\"Petty crime\" refers to minor offenses that are not serious in nature and usually carry lighter penalties, such as fines or short jail sentences. These crimes typically involve little to no violence and cause minimal harm or financial loss to victims.\n\nSynonyms: misdemeanor, petty offense, minor infraction, summary offense.\n",
        "exampleA": "petty crime such as shoplifting",
        "exampleB": "The neighborhood watch aims to reduce petty crime like vandalism and shoplifting.",
        "exampleC": "He was arrested for a series of petty crime offenses, including public intoxication and trespassing.",
        "status": "learned"
    },
    {
        "id": "aced6348-1bf7-4396-b54f-a7fba86c0481",
        "word": "pickpocketing",
        "persian": "جیب بری",
        "definition": "Pickpocketing is the act of stealthily stealing items, typically wallets, money, or valuables, directly from a person's pockets or bags without their knowledge or consent. It relies on deception, sleight of hand, and exploiting crowded or distracting situations to go unnoticed by the victim.\n\nSynonyms: filching, dipping, purloining, thieving.\n",
        "exampleA": "He is a pickpocket",
        "exampleB": "The tourist was a victim of pickpocketing in the crowded market.",
        "exampleC": "The police are cracking down on pickpocketing in the city center.",
        "status": "seen"
    },
    {
        "id": "9ca78c97-cccd-49ee-982c-f8870e317ec5",
        "word": "prevent",
        "persian": "\"Prevent\" در فارسی معمولاً به صورت \"جلوگیری کردن\"، \"پیشگیری کردن\" یا \"ممانعت کردن\" ترجمه می‌شود. انتخاب دقیق‌ترین معادل بستگی به متن و موقعیت استفاده دارد.\n",
        "definition": "To prevent something means to stop it from happening or occurring. It involves taking action to avert, hinder, or block a future event, typically something undesirable.\n\nSynonyms: avert, hinder, preclude, forestall, impede\n",
        "exampleA": "Regular exercise can help prevent heart disease.",
        "exampleB": "The new regulations are designed to prevent pollution.",
        "exampleC": "We need to take action now to prevent a crisis.",
        "status": ""
    },
    {
        "id": "379ee21f-76e7-4497-8841-3c6a12b0efc3",
        "word": "prevention",
        "persian": "جلوگیری",
        "definition": "Prevention refers to actions taken to stop something undesirable from happening or arising in the first place. It involves proactive measures designed to avoid a negative outcome, such as illness, crime, or accidents. It's about minimizing risk and promoting well-being through foresight and intervention.\n\nSynonyms: avoidance, deterrence, precaution, prophylaxis\n",
        "exampleA": "Vaccination is a key strategy in disease prevention.",
        "exampleB": "Crime prevention is a shared responsibility of the community and law enforcement.",
        "exampleC": "Early detection and prevention are crucial for managing mental health issues.",
        "status": "learned"
    },
    {
        "id": "735b1eed-4fa5-4d38-b236-995cbadcb4ce",
        "word": "prison",
        "persian": "زندان",
        "definition": "A prison is a facility, typically run by the state or federal government, where individuals convicted of crimes are confined as punishment and to restrict their freedom. It serves to incapacitate offenders, deter crime, and sometimes rehabilitate inmates.\n\nSynonyms: jail, penitentiary, correctional facility, detention center.\n",
        "exampleA": "He was sentenced to five years in prison for his crime.",
        "exampleB": "The prison walls loomed large and intimidating.",
        "exampleC": "She works as a counselor helping inmates readjust to life after prison.",
        "status": "learned"
    },
    {
        "id": "c903beeb-18f2-4070-8967-9b3af0513c5c",
        "word": "prisoner",
        "persian": "زندانی",
        "definition": "A prisoner is someone who is being held against their will, typically in a jail or prison, as punishment for a crime they have committed or are accused of committing. Their freedom of movement and autonomy are severely restricted.\n\nSynonyms: inmate, captive, detainee, convict\n",
        "exampleA": "The prisoner paced nervously in his cell.",
        "exampleB": "She felt like a prisoner in her own home, trapped by fear.",
        "exampleC": "The warden addressed the assembled prisoners with a stern voice.",
        "status": "learned"
    },
    {
        "id": "20435680-e97d-46a9-8304-22098c115c46",
        "word": "property crime",
        "persian": "جرایم مالی",
        "definition": "Property crime encompasses offenses where the primary goal is to obtain money, property, or other valuables without causing direct physical harm to the victim. It involves the unlawful acquisition or damage of someone else's belongings.\n\nSynonyms: theft, larceny, property offenses, economic crime\n",
        "exampleA": "The neighborhood watch program aims to reduce property crime in the area.",
        "exampleB": "Insurance rates are higher in areas with a high incidence of property crime.",
        "exampleC": "Vandalism is considered a type of property crime.",
        "status": "seen"
    },
    {
        "id": "0ccf6ef0-d8b3-4046-be3f-48043e0d7f78",
        "word": "prosecutor",
        "persian": "معادل فارسی کلمه \"prosecutor\" می‌شه \"دادستان\".\n",
        "definition": "a lawyer who is trying to prove in a court of law that someone is guilty of a crime",
        "exampleA": "The prosecutor presented a compelling case against the defendant.",
        "exampleB": "The defense attorney argued that the prosecutor had not proven guilt beyond a reasonable doubt.",
        "exampleC": "The prosecutor's office decided not to pursue charges due to lack of evidence.",
        "status": "seen"
    },
    {
        "id": "94f3d50c-b3c9-48ba-b9cf-051368d4be18",
        "word": "protect",
        "persian": "محافظت کردن، حراست کردن، یا نگهداری کردن.\n",
        "definition": "To protect means to keep someone or something safe from harm or danger. It involves taking actions to defend, guard, or shield them from threats, injury, or loss. It implies a proactive effort to maintain well-being and prevent negative outcomes.\n\nSynonyms: defend, guard, shield, safeguard, preserve\n",
        "exampleA": "We must protect our natural resources for future generations.",
        "exampleB": "Wear a helmet to protect your head during sports.",
        "exampleC": "The bodyguard swore to protect the celebrity from harm.",
        "status": ""
    },
    {
        "id": "cd4c4138-501b-4dca-9602-9d08f5a04adc",
        "word": "protection",
        "persian": "حراست",
        "definition": "Protection refers to the act of shielding someone or something from harm, danger, or unwanted influence. It encompasses providing security, defense, and safety against potential threats. The goal is to preserve well-being and prevent negative consequences.\n\nSynonyms: defense, security, safeguard, shelter, preservation.\n",
        "exampleA": "The security system offers robust protection against intruders.",
        "exampleB": "Wearing a helmet provides crucial protection while cycling.",
        "exampleC": "The government implemented new laws to ensure consumer protection.",
        "status": "learned"
    },
    {
        "id": "41387963-2e61-4806-8395-30a1fe2086b0",
        "word": "prove",
        "persian": "ثابت کردن، اثبات کردن",
        "definition": "To prove something is to demonstrate or establish its truth or validity through evidence, reasoning, or argument. It means to show convincingly that something is factual and not just an assumption or possibility.\n\nSynonyms: verify, validate, substantiate, confirm, demonstrate.\n",
        "exampleA": "Can you prove your alibi for the night of the crime?",
        "exampleB": "The evidence seems to prove his innocence.",
        "exampleC": "Scientists are working to prove this new theory.",
        "status": "seen"
    },
    {
        "id": "e06a0fe3-1af0-4b8b-b143-4a253d01de47",
        "word": "punish",
        "persian": "مجازات کردن",
        "definition": "To punish someone means to inflict a penalty or suffering on them as retribution for a crime, offense, or misbehavior. It's the act of imposing a consequence to deter future wrongdoing, enforce rules, or deliver justice.\n\nSynonyms: penalize, discipline, chastise, correct, sanction.\n",
        "exampleA": "The teacher decided to punish the student for cheating on the exam.",
        "exampleB": "The law is designed to punish criminals and deter future crime.",
        "exampleC": "Don't punish yourself for mistakes you made in the past.",
        "status": "learned"
    },
    {
        "id": "63c7f6f0-1c06-49d2-8cf5-a6904543e8ce",
        "word": "punishable",
        "persian": "دارای مجازات، قابل مجازات",
        "definition": "\"Punishable\" means deserving or liable to a penalty or punishment, usually for a crime or offense. It implies that an action is against the law or a rule and that consequences, such as a fine, imprisonment, or other forms of retribution, will be imposed.\n\nSynonyms: culpable, liable, accountable, indictable, convictable.\n",
        "exampleA": "a\t punishable offence",
        "exampleB": "The crime of theft is punishable by a fine or imprisonment.",
        "exampleC": "His behavior was deemed punishable, resulting in a suspension from the team.",
        "status": "learned"
    },
    {
        "id": "a158d6a7-9543-41a5-b535-22564d263dd5",
        "word": "punishment",
        "persian": "مجازات",
        "definition": "Punishment is the infliction of a penalty or suffering on someone as retribution for a crime or wrongdoing. It's meant to deter future misconduct, provide justice for victims, and maintain order within society. Essentially, it's a negative consequence imposed due to an action deemed wrong or illegal.\n\nSynonyms: penalty, discipline, sanction, retribution, consequence.\n",
        "exampleA": "The severity of the punishment should fit the crime.",
        "exampleB": "He received a harsh punishment for his repeated offenses.",
        "exampleC": "Many believe that education is a more effective deterrent than punishment.",
        "status": "learned"
    },
    {
        "id": "068a6af5-f9cd-4695-bcb6-7d366b0fd0d8",
        "word": "random",
        "persian": "تصادفی و غیر عمد",
        "definition": "\"Random\" describes something that occurs without a predictable pattern, purpose, or bias. It means that each outcome has an equal chance of happening, and you can't guess the result beforehand based on any known factors. Essentially, it's a lack of order or intention in the selection or occurrence of something.\n\nSynonyms: arbitrary, haphazard, chance, unsystematic, fortuitous.\n",
        "exampleA": "The experiment used a random sample of participants.",
        "exampleB": "He picked a random card from the deck.",
        "exampleC": "We took a random walk through the city.",
        "status": "learned"
    },
    {
        "id": "6ec4971e-943e-4796-ba87-3cc53a44adda",
        "word": "recklessness",
        "persian": "بی ملاحظگی، بی کله بودن در رانندگی",
        "definition": "Recklessness is a disregard for danger or the consequences of one's actions; it's a state of being careless and impulsive, often resulting in harm or negative outcomes. It implies a lack of caution or consideration for the potential risks involved in a particular situation.\n\nSynonyms: Rashness, imprudence, foolhardiness, audacity, irresponsibility.\n",
        "exampleA": "His recklessness behind the wheel caused a multi-car accident.",
        "exampleB": "The company's financial recklessness led to its eventual bankruptcy.",
        "exampleC": "She regretted the recklessness of her youth and now valued stability.",
        "status": "seen"
    },
    {
        "id": "a6f5406d-f083-432f-abac-9e69504552f2",
        "word": "resent",
        "persian": "آزرده خاطر شدن ، دلخور شدن ، رنجیدن",
        "definition": "To resent means to feel bitterness, indignation, or ill will towards someone or something, often because you believe you have been treated unfairly. It implies a lingering feeling of anger and displeasure, often due to perceived injustice or envy.\n\nSynonyms: begrudge, dislike, be bitter about, take offense at.\n",
        "exampleA": "She resented being told what to do, especially by someone younger than her.",
        "exampleB": "He resented the implication that he was dishonest.",
        "exampleC": "I resented having to work late on a Friday night.",
        "status": "seen"
    },
    {
        "id": "1f19ab8e-669c-4695-bf36-09e12574a0a7",
        "word": "respect",
        "persian": "احترام گذاشتن",
        "definition": "Respect is a feeling of deep admiration for someone or something elicited by their abilities, qualities, or achievements. It involves treating others with politeness, consideration, and dignity, acknowledging their worth and value, regardless of differences. It can also mean showing due regard for rules, customs, and traditions.\n\nSynonyms: esteem, regard, honor, deference, reverence, appreciation\n",
        "exampleA": "We should always show respect for our elders.",
        "exampleB": "The students have a great deal of respect for their teacher.",
        "exampleC": "Mutual respect is essential for a healthy relationship.",
        "status": "learned"
    },
    {
        "id": "885e244c-f554-4037-a132-72d1deb23793",
        "word": "sanction",
        "persian": "تحریم، تنبیه",
        "definition": "\"Sanction\" can refer to two opposite things: either official permission or approval for something (like a sanction for building a new school), or a penalty or coercive measure intended to enforce compliance with a law or rule (like economic sanctions imposed on a country). The meaning depends heavily on the context.\n\nSynonyms: approval, permission, authorization (for the positive meaning); penalty, punishment, embargo (for the negative meaning).\n",
        "exampleA": "The international community imposed a sanction on the country for its human rights abuses.",
        "exampleB": "The referee issued a sanction against the player for unsportsmanlike conduct.",
        "exampleC": "The company decided to sanction the project despite the initial concerns.",
        "status": "learned"
    },
    {
        "id": "5404db2e-ae50-423d-9283-8586df5dc4dd",
        "word": "smuggling",
        "persian": "قاچاق",
        "definition": "Smuggling refers to the illegal transportation of goods, people, or substances across national borders or in violation of established laws and regulations. It's generally done to avoid customs duties, taxes, or prohibitions. This often involves concealing the items or individuals being transported and can have serious legal and ethical consequences.\n\nSynonyms: Trafficking, bootlegging, contraband, black marketeering, running.\n",
        "exampleA": "The authorities caught him smuggling drugs across the border.",
        "exampleB": "Art smuggling is a serious problem that deprives countries of their cultural heritage.",
        "exampleC": "They were accused of smuggling weapons into the conflict zone.",
        "status": "seen"
    },
    {
        "id": "e77b5ffb-b373-459d-b8c2-28320d7c4f1a",
        "word": "social system",
        "persian": "نطام اجتماعی",
        "definition": "A social system refers to a structured organization within a population where individuals interact with each other according to established norms, values, and roles. These interactions create patterns of behavior, social relationships, and institutions that contribute to the overall functioning of the group or society. The system helps to organize and regulate interactions, providing a framework for social life.\n\nSynonyms: social order, societal structure, social framework, community structure.\n",
        "exampleA": "The current social system perpetuates inequalities based on socioeconomic status.",
        "exampleB": "Understanding the dynamics of a social system requires analyzing its power structures and cultural norms.",
        "exampleC": "Education plays a crucial role in both reinforcing and challenging the existing social system.",
        "status": "learned"
    },
    {
        "id": "a18f1dd5-20fa-46ad-952c-62b8ce948321",
        "word": "solve a crime",
        "persian": "حل کردن معمای جنایی",
        "definition": "To solve a crime means to successfully investigate and determine the truth behind a criminal act, identifying the perpetrator(s) and often leading to their apprehension and conviction. It involves gathering evidence, interviewing witnesses, analyzing clues, and using deductive reasoning to piece together the events and establish responsibility.\n\nSynonyms: crack a case, investigate a crime, unravel a mystery, get to the bottom of something\n",
        "exampleA": "The detective dedicated his life to solve a crime.",
        "exampleB": "She dreamed of becoming a forensic scientist to help solve a crime.",
        "exampleC": "The amateur sleuth managed to solve a crime before the police did.",
        "status": "learned"
    },
    {
        "id": "0754d6c4-a6db-4565-a4f0-78959cac7dd9",
        "word": "strict",
        "persian": "سرسختانه",
        "definition": "\"Strict\" describes someone or something that adheres rigidly to rules, regulations, or principles, often with little tolerance for deviation or exceptions. It implies a firm and unwavering approach to maintaining standards and ensuring obedience.\n\nSynonyms: stringent, rigid, disciplined, severe, authoritarian\n",
        "exampleA": "The teacher was very strict about tardiness.",
        "exampleB": "My parents had strict rules about screen time.",
        "exampleC": "The company has a strict dress code.",
        "status": "learned"
    },
    {
        "id": "758570f5-511d-4988-8b1c-ba280905570f",
        "word": "swearing",
        "persian": "دشنام، فحش",
        "definition": "\"Swearing\" refers to the use of offensive, vulgar, or taboo language, often to express strong emotions like anger, frustration, or surprise. It can also be used informally for emphasis or humor within certain social groups.\nSynonyms: cursing, profanity, bad language, vulgarity, obscenity.\n",
        "exampleA": "The coach warned the players about swearing during the game.",
        "exampleB": "Her constant swearing offended many of the guests at the party.",
        "exampleC": "Despite the frustration, he managed to avoid swearing.",
        "status": "learned"
    },
    {
        "id": "002803ea-04fc-4b3d-b13b-9d644773ff45",
        "word": "the accused",
        "persian": "متهم",
        "definition": "\"The accused\" refers to a person or group of people who have been formally charged with a crime but have not yet been proven guilty in a court of law. They are presumed innocent until proven guilty beyond a reasonable doubt.\n\nSynonyms: defendant, suspect, alleged offender, respondent.\n",
        "exampleA": "The judge addressed the accused directly before the trial began.",
        "exampleB": "The lawyer argued that the evidence against the accused was circumstantial.",
        "exampleC": "Despite public opinion, the accused maintained their innocence throughout the proceedings.",
        "status": "seen"
    },
    {
        "id": "4e08144b-1ac3-4b5c-aade-8509f879eb27",
        "word": "toxic waste",
        "persian": "\"زباله سمی\" یا \"پسماند سمی\"\n",
        "definition": "Toxic waste refers to unwanted materials, often byproducts of industrial processes, that are harmful or poisonous to living organisms and the environment. Due to its dangerous properties, improper disposal can lead to severe health problems, environmental contamination, and ecological damage.\n\nSynonyms: hazardous waste, poisonous waste, dangerous waste, noxious waste.\n",
        "exampleA": "The illegal dumping of toxic waste contaminated the local river.",
        "exampleB": "Exposure to toxic waste can cause serious health problems.",
        "exampleC": "Proper disposal of toxic waste is crucial for environmental protection.",
        "status": ""
    },
    {
        "id": "b8b389d7-8180-4d42-b6d5-cb5c91a7a604",
        "word": "unintentional",
        "persian": "غیرعمدی",
        "definition": "\"Unintentional\" describes something that happens without being planned or intended. It means the action, result, or event was not deliberate or on purpose. It suggests a lack of conscious intent or forethought behind what occurred.\n\nSynonyms: accidental, inadvertent, unplanned, unwitting, unintended.\n",
        "exampleA": "The spill was completely unintentional; I didn't see the glass on the edge.",
        "exampleB": "His unintentional remark caused a great deal of offense.",
        "exampleC": "Sometimes the most profound discoveries are the result of unintentional experiments.",
        "status": "seen"
    },
    {
        "id": "00f2e894-6958-49ec-94b9-9d0f1b5e404a",
        "word": "vandalism",
        "persian": "خرابکاری، آسیب زدن به اموال عمومی",
        "definition": "Vandalism refers to the deliberate destruction or damage of public or private property. It is often considered a petty crime, but can range from minor defacement to significant and costly damage. The act is typically motivated by spite, boredom, or a desire for attention, and is generally illegal.\n\nSynonyms: defacement, destruction, damage, sabotage, malicious mischief.\n",
        "exampleA": "These schools are known to be vulnerable to vandalism.",
        "exampleB": "The local park suffered extensive vandalism over the weekend.",
        "exampleC": "Graffiti is often considered a form of vandalism.",
        "status": "seen"
    },
    {
        "id": "4aca3416-ef9d-458c-a0a6-9b91ddae1d4f",
        "word": "victim",
        "persian": "قربانی",
        "definition": "A victim is someone who suffers harm, loss, or damage as a result of an act, circumstance, or condition. This harm can be physical, emotional, financial, or psychological. The victim is typically innocent or at least less culpable than the person or thing that caused the harm.\n\nSynonyms: casualty, sufferer, target, prey.\n",
        "exampleA": "The police are trying to identify the victim of the crime.",
        "exampleB": "She portrayed the victim of domestic abuse in the play.",
        "exampleC": "He cast himself as the victim of a political conspiracy.",
        "status": "learned"
    },
    {
        "id": "861e79cd-dfb2-4402-ad2f-4475f87cac2f",
        "word": "victimless",
        "persian": "بدون قربانی",
        "definition": "\"Victimless\" describes an action or crime where there is no identifiable direct victim who suffers harm or loss. It's a controversial term, often used to describe activities some consider immoral or illegal but argue don't truly hurt anyone else. Debates frequently arise around whether certain actions truly are victimless, as indirect harms to society or individuals are often argued.\n\nSynonyms: harmless, non-injurious, innocuous, consensual.\n",
        "exampleA": "victimless",
        "exampleB": "Some argue that certain crimes, like recreational drug use, are victimless.",
        "exampleC": "He believed that online piracy was a victimless crime, since artists still made money from other sources.",
        "status": "seen"
    },
    {
        "id": "018d035a-8b23-4c42-8dc1-708b677cbaf9",
        "word": "violate",
        "persian": "نقض کردن",
        "definition": "To violate means to break or disregard a law, agreement, principle, or someone's rights. It implies an action that goes against what is established or expected and often carries a negative connotation of disrespect or harm.\n\nSynonyms: Infringe, breach, contravene, transgress, defy.\n",
        "exampleA": "34 protesters were arrested for violating criminal law.",
        "exampleB": "The protesters did not want to violate any laws.",
        "exampleC": "The company was found to violate safety regulations.",
        "status": "seen"
    },
    {
        "id": "b10f5a8d-b015-4b9f-9977-ed41a95be7cd",
        "word": "violation",
        "persian": "\"Violation\" بسته به متن می‌تونه به معنی \"نقض\"، \"تخلف\"، \"تجاوز\"، یا \"شکستن قانون\" باشه.\n",
        "definition": "A violation is an act that breaks a law, rule, agreement, or standard. It signifies a transgression or infringement upon established boundaries or expectations, resulting in some form of penalty or consequence.\n\nSynonyms: breach, infringement, contravention, transgression, infraction.\n",
        "exampleA": "The company received a hefty fine for the violation of environmental regulations.",
        "exampleB": "His actions were a clear violation of the school's code of conduct.",
        "exampleC": "The police officer cited the driver for a moving violation.",
        "status": ""
    },
    {
        "id": "a2333afe-4410-4fb6-904f-58261586dcb6",
        "word": "violation (of sth)",
        "persian": "نقض",
        "definition": "A violation refers to the act of breaking a law, rule, agreement, promise, or principle. It signifies a failure to comply with established norms or expectations, resulting in a transgression that can carry consequences depending on the severity and context.\n\nSynonyms: breach, infringement, contravention, transgression, defiance.\n",
        "exampleA": "violation of law/rule/agreement. human rights violations",
        "exampleB": "The company was fined for a serious violation of environmental regulations.",
        "exampleC": "His actions were a clear violation of the terms of the contract.",
        "status": "seen"
    }
]