[
    {
        "id": "7dc9ede1-dda2-4177-9e23-5625530e1b43",
        "word": "acute",
        "persian": "حاد",
        "definition": "\"Acute\" describes something that is sharp, intense, or severe, and often refers to a condition or problem that is sudden and brief in duration. It implies a high degree of intensity or sharpness, often associated with pain, illness, or a perceptive understanding.\n\nSynonyms: sharp, intense, severe, critical, keen\n",
        "exampleA": "The patient presented with acute abdominal pain and required immediate surgery.",
        "exampleB": "She has an acute sense of smell, able to detect the faintest aromas.",
        "exampleC": "The housing shortage is becoming an acute problem in many major cities.",
        "status": "seen"
    },
    {
        "id": "35a36333-ff84-4411-8e1d-256c308fd7ef",
        "word": "additive",
        "persian": "مواد افزودنی",
        "definition": "An additive is a substance added to something else, typically in small quantities, to improve or preserve it. This could be to enhance a product's characteristics, such as its color, flavor, stability, or functionality. Essentially, it's anything included to modify the properties of a base substance.\n\nSynonyms: supplement, amendment, ingredient, component, addition.\n",
        "exampleA": "The food company removed artificial additives from their products to appeal to health-conscious consumers.",
        "exampleB": "His enthusiasm was additive, spreading quickly through the team and boosting morale.",
        "exampleC": "Some scholars argue that technology has had an additive effect on societal progress, building upon previous achievements.",
        "status": "learned"
    },
    {
        "id": "ec8fd5aa-810a-49aa-a7b1-e9b09871e331",
        "word": "agony",
        "persian": "درد شدید",
        "definition": "Agony refers to extreme physical or mental suffering. It's a state of intense pain, distress, and anguish that can be almost unbearable, often associated with a feeling of helplessness and loss of control.\n\nSynonyms: torment, torture, suffering, anguish, distress\n",
        "exampleA": "She lay there screaming in agony.",
        "exampleB": "The injured runner finished the race in agony.",
        "exampleC": "She felt the agony of betrayal when she discovered her friend's secret.",
        "status": "seen"
    },
    {
        "id": "bc5bbf98-bd89-40d3-acdf-94200ff284db",
        "word": "allergic",
        "persian": "\"Allergic\" در فارسی معمولاً به صورت \"حساسیت داشتن\" یا \"آلرژی داشتن\" ترجمه می‌شود. بسته به بافت جمله، می‌توان از \"حساس\" یا \"دارای آلرژی\" نیز استفاده کرد.\n",
        "definition": "To be allergic means to have an immune system reaction to a substance (allergen) that is not normally harmful to most people. This reaction can range from mild symptoms like a rash or runny nose to severe, life-threatening reactions like anaphylaxis. Essentially, the body mistakenly identifies the allergen as a threat and launches an immune response.\n\nSynonyms: hypersensitive, reactive, sensitive, intolerant\n",
        "exampleA": "I'm allergic to peanuts, so I can't eat that candy bar.",
        "exampleB": "She's allergic to cats, so we can't visit her apartment.",
        "exampleC": "My skin is allergic to certain types of sunscreen.",
        "status": ""
    },
    {
        "id": "0212b3d1-a53b-4228-923b-1a9211b43770",
        "word": "allergy",
        "persian": "آلرژی به معنی حساسیت است، یعنی واکنش غیرطبیعی بدن به یک ماده خاص که معمولاً بی‌ضرر است.\n",
        "definition": "An allergy is a condition in which your immune system reacts abnormally to a foreign substance (allergen) like pollen, pet dander, certain foods, or insect stings. This overreaction can cause a range of symptoms, from mild skin rashes and sneezing to life-threatening anaphylaxis. The body essentially mistakes a harmless substance for a threat and launches an immune response to fight it off.\n\nSynonyms: Hypersensitivity, allergic reaction, sensitivity.\n",
        "exampleA": "She has a severe allergy to peanuts and must carry an EpiPen.",
        "exampleB": "The doctor performed allergy tests to determine the cause of his skin rash.",
        "exampleC": "Due to my allergy, I avoid dairy products altogether.",
        "status": ""
    },
    {
        "id": "78635506-887b-4267-a50a-43f6aa8fc0e6",
        "word": "alternate",
        "persian": "\"Alternate\" بسته به متن می‌تونه معانی مختلفی داشته باشه، اما رایج‌ترین ترجمه‌ها عبارتند از: \"جایگزین\"، \"متناوب\"، یا \"یکی در میان\".\n",
        "definition": "\"Alternate\" means to occur or perform by turns; to switch back and forth between two or more things. It can also describe something that is available instead of, or as a substitute for, something else.\n\nSynonyms: substitute, replacement, reciprocal, alternating, rotating.\n",
        "exampleA": "We had to find an alternate route due to the road closure.",
        "exampleB": "Is there an alternate explanation for what happened?",
        "exampleC": "He works on alternate Tuesdays and Wednesdays.",
        "status": ""
    },
    {
        "id": "8dfafc8b-16b3-4130-8547-df402de7edf4",
        "word": "anxiety",
        "persian": "اضطراب",
        "definition": "Anxiety is a feeling of worry, nervousness, or unease, typically about an imminent event or something with an uncertain outcome. It can manifest physically through symptoms like increased heart rate, sweating, and difficulty concentrating.\n\nSynonyms: worry, apprehension, dread, unease, nervousness.\n",
        "exampleA": "The constant deadlines gave her crippling anxiety.",
        "exampleB": "Meditation can be a helpful tool for managing anxiety.",
        "exampleC": "He felt a wave of anxiety wash over him before the presentation.",
        "status": "learned"
    },
    {
        "id": "88c03df2-35df-43ec-a2b5-1d94f293c43b",
        "word": "appetite",
        "persian": "\"Appetite\" در فارسی معمولاً به عنوان اشتها ترجمه می‌شود، که به معنی میل و رغبت به خوردن غذا است.\n",
        "definition": "\"Appetite\" refers to a natural desire to satisfy a bodily need, especially for food. It's the feeling of hunger or wanting to eat, but can also extend to other desires like a \"sexual appetite\" or an \"appetite for adventure.\" It signifies a craving or inclination towards something pleasurable or necessary for survival or fulfillment.\n\nSynonyms: hunger, craving, desire, yearning, inclination\n",
        "exampleA": "The long hike gave him a hearty appetite.",
        "exampleB": "Her appetite for knowledge was insatiable.",
        "exampleC": "The government's appetite for spending seems limitless.",
        "status": ""
    },
    {
        "id": "76140ff7-dafc-460b-9dcd-213f5f8807d3",
        "word": "artery",
        "persian": "شریان",
        "definition": "An artery is a blood vessel that carries oxygen-rich blood away from the heart to the body's tissues. It's a vital part of the circulatory system, responsible for distributing oxygen and nutrients throughout the body to keep everything functioning.\n\nSynonyms: blood vessel, conduit, channel, pathway.\n",
        "exampleA": "The doctor explained that the blockage was in a major artery.",
        "exampleB": "Hardening of the arteries can lead to serious health problems.",
        "exampleC": "Blood travels from the heart to the rest of the body through an artery.",
        "status": "learned"
    },
    {
        "id": "eaffa292-9e9d-4435-bd62-de3e9eb32753",
        "word": "asset",
        "persian": "دارائی ، سرمایه",
        "definition": "An asset is anything of economic value that an individual, company, or organization owns or controls that is expected to provide future benefit. These benefits can include generating income, increasing in value, or providing a competitive advantage. Assets represent resources that can be converted into cash.\n\nSynonyms: resource, possession, holding, property, capital.\n",
        "exampleA": "her eyes are her best assets",
        "exampleB": "The company's most valuable asset is its skilled workforce.",
        "exampleC": "A diversified portfolio helps protect your assets from market fluctuations.",
        "status": "learned"
    },
    {
        "id": "cb365cb6-762a-4e77-aa93-14c89aff83bd",
        "word": "avoid",
        "persian": "\"Avoid\" در فارسی معمولاً به صورت \"اجتناب کردن\"، \"پرهیز کردن\" یا \"دوری کردن\" ترجمه می‌شود. انتخاب دقیق‌ترین معادل بستگی به متن و مفهوم مورد نظر دارد.\n",
        "definition": "To avoid something means to deliberately stay away from it, prevent it from happening, or evade it altogether. It suggests a conscious effort to keep distance or steer clear of an undesirable or unwanted situation, person, or thing.\n\nSynonyms: evade, shun, dodge, circumvent, escape.\n",
        "exampleA": "Try to avoid processed foods for a healthier diet.",
        "exampleB": "I always avoid that street because of the heavy traffic.",
        "exampleC": "He wanted to avoid hurting her feelings.",
        "status": ""
    },
    {
        "id": "ceed96d5-b562-4880-8189-cf7673f663af",
        "word": "bathe",
        "persian": "آبتنی کردن",
        "definition": "\"Bathe\" means to cleanse oneself or something else by immersing in water or another liquid. It can refer to washing one's body for hygiene or relaxation, or to covering something in liquid.\nSynonyms: wash, cleanse, soak, immerse, drench.\n",
        "exampleA": "They bathed in the lake in the moonlight.",
        "exampleB": "The toddler loves to bathe with his rubber ducky.",
        "exampleC": "After a long hike, I like to bathe in the creek.",
        "status": "learned"
    },
    {
        "id": "1b055644-7957-476f-857a-7c930324a572",
        "word": "beneficial",
        "persian": "سودمند،مفيد،نافع ،پرمنفعت ،بااستفاده",
        "definition": "\"Beneficial\" means producing good or helpful results; advantageous. It describes something that is helpful, favorable, or provides a positive effect.\n\nSynonyms: advantageous, helpful, useful, favorable, profitable.\n",
        "exampleA": "Regular exercise is beneficial to your overall health.",
        "exampleB": "A strong support system can be beneficial during times of stress.",
        "exampleC": "Investing in education is often beneficial for future career prospects.",
        "status": "learned"
    },
    {
        "id": "b7e2da85-ef5b-4f58-8a71-49f43aabd242",
        "word": "benefit",
        "persian": "فایده رساندن به کسی",
        "definition": "A benefit is something that is advantageous or helpful; it's a gain or positive result obtained from something. It can be a tangible item like a health insurance policy or an intangible advantage like improved skills after a training program. Essentially, a benefit is anything that contributes to well-being or success.\n\nSynonyms: advantage, perk, gain, profit, favor, boon.\n",
        "exampleA": "One benefit of exercise is improved cardiovascular health.",
        "exampleB": "The company offers a comprehensive benefits package to its employees.",
        "exampleC": "We hope to benefit from the new policy.",
        "status": "learned"
    },
    {
        "id": "3a52920c-b582-49bc-9840-9a4e3c7c2937",
        "word": "benefit",
        "persian": "\"Benefit\" در فارسی می‌تواند به معانی مختلفی ترجمه شود، از جمله: سود، فایده، مزیت، بهره‌مندی، یا کمک‌هزینه. انتخاب دقیق‌ترین معادل بستگی به متن و مفهوم مورد نظر دارد.\n",
        "definition": "\"Benefit\" refers to an advantage or positive result obtained from something. It signifies a gain, improvement, or favorable outcome that enhances well-being, prosperity, or overall circumstances.\n\nSynonyms: Advantage, gain, profit, perk, boon.\n",
        "exampleA": "The new policy will benefit all employees.",
        "exampleB": "One major benefit of exercise is improved cardiovascular health.",
        "exampleC": "We weighed the costs and benefits before making a decision.",
        "status": ""
    },
    {
        "id": "99e17dbe-3bd9-4595-be9d-2bddb1ba9764",
        "word": "benefit",
        "persian": "نفع و فایده",
        "definition": "\"Benefit\" refers to something advantageous, favorable, or helpful that improves a situation or provides a positive result. It can be a tangible gain, like money or resources, or an intangible advantage, like improved well-being or knowledge. Essentially, a benefit is anything that leads to a better outcome for someone or something.\n\nSynonyms: advantage, gain, profit, perk, boon.\n",
        "exampleA": "The new policy will benefit all employees.",
        "exampleB": "One major benefit of exercise is improved sleep.",
        "exampleC": "I hope my experience will benefit the company.",
        "status": "learned"
    },
    {
        "id": "ee62b11c-c8e2-4d5a-9369-d873ba15d3e3",
        "word": "benefited",
        "persian": "ذینفع",
        "definition": "\"Benefited\" means to have gained an advantage, profit, or positive outcome as a result of something. It implies that a person or thing has experienced an improvement or received some sort of help.\n\nSynonyms: Helped, aided, profited, improved, favored.\n",
        "exampleA": "The community benefited from the new park.",
        "exampleB": "He benefited greatly from her advice.",
        "exampleC": "The company benefited from the new tax laws.",
        "status": "learned"
    },
    {
        "id": "2ae2d1df-af1a-42dd-a688-a4bd11b25a18",
        "word": "breath",
        "persian": "نفس",
        "definition": "\"Breath\" refers to the act of inhaling and exhaling air, or the air that is inhaled or exhaled. It's a fundamental biological process for sustaining life by supplying oxygen to the body and removing carbon dioxide. It can also metaphorically represent life, vitality, or a fleeting moment.\n\nSynonyms: respiration, exhalation, inhalation, gasp, pant, sigh\n",
        "exampleA": "to be out of breath, his breath smelled of garlic.",
        "exampleB": "I held my breath as I waited for the results.",
        "exampleC": "The mountain air was so crisp, I took a deep breath.",
        "status": "learned"
    },
    {
        "id": "43dd7e1d-be7f-4042-b2eb-79e7eef6a58a",
        "word": "breathe",
        "persian": "نفس کشیدن",
        "definition": "To breathe is to inhale and exhale air, a vital process for sustaining life in most organisms. It involves taking in oxygen, which is used for cellular respiration, and releasing carbon dioxide as a waste product. It's the rhythmic exchange of gases that keeps us alive.\n\nSynonyms: respire, inhale, exhale, gasp, pant.\n",
        "exampleA": "It's so airless in here - I can hardly breathe.",
        "exampleB": "Remember to breathe deeply during your yoga practice.",
        "exampleC": "The air was so thin at that altitude, it was hard to breathe.",
        "status": "learned"
    },
    {
        "id": "1c9fc029-b513-4a75-a484-02d92b800145",
        "word": "brisk",
        "persian": "چست و چابک",
        "definition": "\"Brisk\" describes something done with quickness, energy, and efficiency. It suggests a lively and invigorating pace, often associated with movement or action that is purposeful and active.\n\nSynonyms: energetic, lively, zippy, sprightly, swift.\n",
        "exampleA": "The brisk wind whipped through the city streets.",
        "exampleB": "She took a brisk walk to the park to clear her head.",
        "exampleC": "His brisk manner indicated he had little time for small talk.",
        "status": "learned"
    },
    {
        "id": "c4df91f9-ae6b-4a50-8e58-919349e54aad",
        "word": "chronic",
        "persian": "مزمن",
        "definition": "\"Chronic\" describes something that persists for a long time, often recurring or difficult to eradicate. It's typically used to refer to illnesses, conditions, or problems that are long-lasting or constantly reoccurring.\nSynonyms: Persistent, lingering, enduring, long-term, habitual\n",
        "exampleA": "She suffered from chronic back pain for years.",
        "exampleB": "The city's chronic unemployment problem requires immediate attention.",
        "exampleC": "He has a chronic cough that never seems to go away.",
        "status": "learned"
    },
    {
        "id": "e6023267-b1d7-4e07-9ae6-ae6c6de983ad",
        "word": "counteract",
        "persian": "بی اثر کردن، خنثی کردن",
        "definition": "To counteract means to act against something in order to reduce its force or neutralize its negative effects. It involves taking action to oppose or balance out a harmful or undesirable influence, often with the goal of preventing it from having its full impact.\n\nSynonyms: neutralize, offset, negate, impede, hinder.\n",
        "exampleA": "Drinking plenty of water can help counteract the effects of dehydration.",
        "exampleB": "The company implemented new safety measures to counteract the rising number of accidents.",
        "exampleC": "She took medication to counteract the side effects of the chemotherapy.",
        "status": "seen"
    },
    {
        "id": "a84421e1-c90f-436a-9d75-6505141127cb",
        "word": "craving (for sth)",
        "persian": "ویار، ولع",
        "definition": "A craving refers to a strong, intense desire for something, often something specific like a particular food, substance, or experience. It's more than just a simple want; it's a persistent and compelling urge that can be difficult to resist.\n\nSynonyms: yearning, longing, hankering, hunger, desire.\n",
        "exampleA": "I have a craving for chocolate.",
        "exampleB": "After weeks of dieting, I had an intense craving for chocolate cake.",
        "exampleC": "The artist had a deep craving for recognition, driving him to create increasingly ambitious works.",
        "status": "learned"
    },
    {
        "id": "58f8da27-1253-45eb-ad2c-e5f1275d8523",
        "word": "cravings",
        "persian": "\"Cravings\" بسته به متن می‌تونه به معادل‌های مختلفی ترجمه بشه، اما در حالت کلی به معنی میل شدید، هوس یا اشتیاق زیاد (به خصوص برای غذا یا یک ماده خاص) هست.\n",
        "definition": "Cravings are intense desires or urges for something specific, often food, but also substances like drugs or alcohol, or even activities. They're characterized by a feeling of need or longing that can be difficult to resist and can significantly influence behavior. The intensity and focus of cravings differentiate them from general hunger or desires.\n\nSynonyms: yearnings, hankerings, longings, urges, desires, addictions\n",
        "exampleA": "She satisfied her cravings with a large slice of chocolate cake.",
        "exampleB": "During pregnancy, she experienced intense cravings for pickles and ice cream.",
        "exampleC": "He was trying to manage his cravings for cigarettes after quitting.",
        "status": ""
    },
    {
        "id": "18948bc1-a2d9-4a4c-a3f7-c04e0f91e86b",
        "word": "curb",
        "persian": "مهار کردن، تحت کنترل در آوردن",
        "definition": "\"Curb\" means to restrain or control something, especially something undesirable. It implies limiting or suppressing an action, emotion, or tendency.\n\nSynonyms: restrain, check, suppress, control, limit.\n",
        "exampleA": "The city is trying to curb air pollution by encouraging public transportation.",
        "exampleB": "He lost control of the car and swerved to avoid the curb.",
        "exampleC": "New policies aim to curb spending and reduce the national debt.",
        "status": "learned"
    },
    {
        "id": "52046c86-cc65-43e2-905c-e879e20bf589",
        "word": "curb your appetite",
        "persian": "جلوی اشتها را گرفتن",
        "definition": "\"Curb your appetite\" means to restrain or control your desire to eat, usually with the goal of reducing your food intake. It implies managing or suppressing hunger and cravings to avoid overeating or sticking to a diet.\n\nSynonyms: suppress your appetite, control your hunger, restrain your cravings, limit your food intake.\n",
        "exampleA": "Try to curb your appetite with a healthy snack before dinner.",
        "exampleB": "The doctor advised him to curb your appetite to manage his weight.",
        "exampleC": "It's difficult to curb your appetite when surrounded by tempting desserts.",
        "status": "learned"
    },
    {
        "id": "80f25d35-38a5-46bd-96e8-20aa68dd0000",
        "word": "cure",
        "persian": "\"Cure\" در فارسی می‌تواند به معانی مختلفی مانند \"درمان\"، \"شفا\"، \"بهبودی\" یا \"معالجه\" ترجمه شود. انتخاب دقیق‌ترین معادل بستگی به متن و مفهوم مورد نظر دارد.\n",
        "definition": "\"Cure\" means to completely eliminate a disease or condition, restoring a person to full health. It signifies a permanent resolution, where the ailment is no longer present and is unlikely to return.\n\nSynonyms: Heal, remedy, eradicate, resolve, alleviate.\n",
        "exampleA": "Scientists are working tirelessly to find a cure for the disease.",
        "exampleB": "The doctor said rest and fluids were the best cure for my cold.",
        "exampleC": "Is there a cure for the common cold?",
        "status": ""
    },
    {
        "id": "b524e23f-52e9-4e47-a2f4-e3d2f8478304",
        "word": "depression",
        "persian": "\"افسردگی\" معادل فارسی کلمه \"depression\" است که به یک اختلال خلقی اشاره دارد که با احساس غم و اندوه مداوم و از دست دادن علاقه یا لذت مشخص می‌شود.\n",
        "definition": "Depression is a mood disorder characterized by persistent feelings of sadness, loss of interest or pleasure, and a range of emotional and physical symptoms that interfere with daily life. It's more than just feeling \"down\" for a few days; it's a serious condition that can affect how you think, feel, and behave.\n\nSynonyms: sadness, melancholy, despondency, despair, gloom.\n",
        "exampleA": "The long winter months often bring on feelings of depression.",
        "exampleB": "Therapy and medication can be effective treatments for depression.",
        "exampleC": "She struggled with depression after losing her job.",
        "status": ""
    },
    {
        "id": "2121d8a5-c91d-4449-8ba8-8633ad9472b6",
        "word": "diagnosis",
        "persian": "\"Diagnosis\" در فارسی معمولاً به \"تشخیص\" ترجمه می‌شود.\n",
        "definition": "Diagnosis is the process of identifying a disease, condition, or injury through the evaluation of symptoms, medical history, physical examination, and sometimes diagnostic tests. It is essentially determining the nature and cause of a person's health problem.\n\nSynonyms: Identification, assessment, determination, conclusion, analysis\n",
        "exampleA": "The doctor's diagnosis was confirmed by a second opinion.",
        "exampleB": "After several tests, they finally received a diagnosis for their child's condition.",
        "exampleC": "The early diagnosis of the disease significantly improved her chances of recovery.",
        "status": ""
    },
    {
        "id": "b2a901f9-9bc3-4400-8fd4-db68655e867c",
        "word": "diet",
        "persian": "رژیم غذایی، برنامه غذایی یا تغذیه. بسته به متن، هر کدوم از این‌ها می‌تونه معنی \"diet\" رو برسونه.\n",
        "definition": "\"Diet\" generally refers to the food and drink a person or animal regularly consumes. It can encompass both healthy and unhealthy eating habits. However, the word is often used specifically to describe a restricted or special course of food undertaken for weight loss, health reasons, or ethical considerations.\n\nSynonyms: regimen, nutrition, nourishment, fare, provisions\n",
        "exampleA": "She went on a strict diet to lose weight before her wedding.",
        "exampleB": "The doctor recommended a low-sodium diet for his high blood pressure.",
        "exampleC": "What does a balanced diet look like for a growing child?",
        "status": ""
    },
    {
        "id": "47a17ba3-607d-458a-9357-2016e4bbf2a4",
        "word": "dietary",
        "persian": "غذایی",
        "definition": "\"Dietary\" refers to anything related to a person's diet or the food they regularly consume. It encompasses the types of food eaten, the quantity, and how it impacts their health. Dietary considerations might involve making specific food choices based on nutritional needs, health conditions, or personal preferences.\n\nSynonyms: nutritional, alimentary, alimentational, food-related.\n",
        "exampleA": "dietary requirements",
        "exampleB": "The doctor recommended several dietary changes to improve my cholesterol levels.",
        "exampleC": "This supplement is intended to support your overall health, but it is not a substitute for a balanced dietary intake.",
        "status": "seen"
    },
    {
        "id": "87756938-3ebb-4ebb-abac-5ecb9bdea83f",
        "word": "dietician",
        "persian": "متخصص تغذیه",
        "definition": "A dietician is a healthcare professional qualified to assess, diagnose, and treat dietary and nutritional problems at an individual and wider public-health level. They provide evidence-based practical advice to help people manage their health through food and nutrition.\n\nSynonyms: Registered Dietitian, Nutritionist, Registered Dietitian Nutritionist (RDN).\n",
        "exampleA": "My doctor recommended that I see a dietician to help me manage my diabetes.",
        "exampleB": "The dietician created a personalized meal plan to address my specific nutritional needs.",
        "exampleC": "A registered dietician can provide expert advice on healthy eating habits and weight management.",
        "status": "learned"
    },
    {
        "id": "40ffd775-8484-4ac9-8b9d-04ddd2b26b0c",
        "word": "diminish",
        "persian": "کاهش دادن ، کم کردن ، دست کم گرفتن",
        "definition": "\"Diminish\" means to make or become smaller, less, or weaker. It implies a reduction in size, importance, intensity, or power. Think of it as something gradually decreasing over time.\n\nSynonyms: decrease, reduce, lessen, dwindle, abate.\n",
        "exampleA": "The heavy rain began to diminish after an hour.",
        "exampleB": "His enthusiasm for the project started to diminish as problems arose.",
        "exampleC": "Regular exercise can help diminish the risk of heart disease.",
        "status": "learned"
    },
    {
        "id": "d7456750-ad18-49d7-9c56-b2772dd2ffa0",
        "word": "disease",
        "persian": "مریضی",
        "definition": "A disease is a condition that impairs normal bodily function, typically producing specific signs or symptoms and negatively affecting the structure or function of part or all of an organism. It disrupts homeostasis and can be caused by factors like infection, genetics, or environmental influences.\n\nSynonyms: ailment, illness, malady, disorder, sickness.\n",
        "exampleA": "Heart disease is a leading cause of death worldwide.",
        "exampleB": "The doctor diagnosed her with a rare and debilitating disease.",
        "exampleC": "Early detection is crucial in managing many chronic diseases.",
        "status": "learned"
    },
    {
        "id": "32703625-7c9f-434d-830f-3ca14f05a830",
        "word": "disorder",
        "persian": "اختلال",
        "definition": "\"Disorder\" refers to a state of disarray, confusion, or disruption, lacking structure and organization. It implies a deviation from what is considered normal, orderly, or functional, often causing problems or inefficiencies.\n\nSynonyms: Chaos, turmoil, mess, disorganization, disruption.\n",
        "exampleA": "The city descended into complete disorder after the earthquake.",
        "exampleB": "He was diagnosed with a mental disorder that required specialized treatment.",
        "exampleC": "The filing system was in such disorder that it took hours to find the missing document.",
        "status": "learned"
    },
    {
        "id": "c7507cae-b1be-429c-a596-9c8e9c383d56",
        "word": "disrupt",
        "persian": "قطع کردن ، مختل کردن ، به هم زدن",
        "definition": "To disrupt means to interrupt the normal course of something, often causing problems or preventing it from continuing smoothly. It implies a forceful or significant alteration to an established process, system, or activity. It can also refer to a radical innovation that fundamentally changes an existing market or industry.\n\nSynonyms: interrupt, disturb, interfere, upset, unsettle, revolutionize.\n",
        "exampleA": "climate change could disrupt the agricultural economy",
        "exampleB": "New technology can disrupt established industries.",
        "exampleC": "Loud noises can disrupt a person's concentration.",
        "status": "learned"
    },
    {
        "id": "3a5a7fd3-0afa-42e4-a11e-7abd65c0cb13",
        "word": "(eating) disorder",
        "persian": "\"اختلال خوردن\" یا \"اختلال تغذیه\"\n",
        "definition": "An eating disorder is a serious mental health condition characterized by persistent disturbances in eating behaviors, thoughts, and emotions related to food and body weight or shape. These disorders can significantly impair physical health, psychological well-being, and social functioning. They are not simply about food; they are often related to underlying emotional issues, trauma, or distorted body image.\n\nSynonyms: disordered eating, feeding disorder, eating problem, unhealthy eating pattern.\n",
        "exampleA": "The doctor suspected she had an (eating) disorder due to her rapid weight loss.",
        "exampleB": "Support groups can be helpful for individuals struggling with an (eating) disorder.",
        "exampleC": "It's important to seek professional help when you suspect someone has an (eating) disorder.",
        "status": ""
    },
    {
        "id": "4a561865-1796-4966-9478-217a64073b6d",
        "word": "eliminate",
        "persian": "حذف کردن، از بین بردن، یا رفع کردن.\n",
        "definition": "To eliminate means to completely remove or get rid of something, often something undesirable or unnecessary. It implies a decisive action that ends the presence or existence of the thing being eliminated.\n\nSynonyms: Eradicate, remove, abolish, extinguish, obliterate.\n",
        "exampleA": "We need to eliminate unnecessary expenses to balance the budget.",
        "exampleB": "The doctor recommended surgery to eliminate the tumor.",
        "exampleC": "Proper training can help eliminate errors in the assembly process.",
        "status": ""
    },
    {
        "id": "92e65c91-58d6-4fa3-9bc0-c223b65d3d70",
        "word": "exercise",
        "persian": "\"Exercise\" در فارسی می‌تواند به \"ورزش\"، \"تمرین\" یا \"فعالیت بدنی\" ترجمه شود. انتخاب دقیق‌ترین معادل بستگی به متن و مفهوم مورد نظر دارد.\n",
        "definition": "\"Exercise\" refers to any bodily activity that enhances or maintains physical fitness and overall health and wellness. It is a planned, structured, and repetitive activity that aims to improve or maintain one or more components of physical fitness, such as cardiovascular health, strength, flexibility, and endurance.\n\nSynonyms: workout, physical activity, training, regimen, exertion\n",
        "exampleA": "Regular exercise is crucial for maintaining good health.",
        "exampleB": "The doctor recommended exercise to help manage my stress.",
        "exampleC": "She incorporates exercise into her daily routine.",
        "status": ""
    },
    {
        "id": "eeb633b3-73ec-43de-adf6-5ea780563ba9",
        "word": "factor",
        "persian": "عامل",
        "definition": "A factor is a circumstance, fact, or influence that contributes to a result or outcome. It's something that plays a part in making something else happen or be a certain way. In mathematics, it's a number or expression that divides another number or expression evenly.\n\nSynonyms: element, component, aspect, influence, cause, ingredient.\n",
        "exampleA": "Cost is a major factor in the decision-making process.",
        "exampleB": "Exercise and diet are key factors in maintaining good health.",
        "exampleC": "His lack of experience was a significant factor in not getting the job.",
        "status": "learned"
    },
    {
        "id": "edb82d01-df1a-45dd-86c5-725a98226792",
        "word": "fast food",
        "persian": "«فست فود» را می‌توان به فارسی به صورت «غذای فوری»، «غذای سریع» یا «غذای آماده» ترجمه کرد.\n",
        "definition": "Fast food refers to quickly prepared and easily accessible meals, typically served in restaurants with limited table service and designed for immediate consumption, either on-site or to take away. These meals are often characterized by their affordability and convenience, prioritizing speed of service over culinary complexity.\n\nSynonyms: Quick service restaurant (QSR) food, takeout food, drive-thru food, convenience food.\n",
        "exampleA": "I try to limit how much fast food I eat each week.",
        "exampleB": "The smell of fast food wafted through the air, tempting us to stop.",
        "exampleC": "He grabbed a bag of fast food on his way home from work.",
        "status": ""
    },
    {
        "id": "61e18ffb-b4db-4fe6-b115-fe0a0a53fe01",
        "word": "fat",
        "persian": "\"Fat\" در فارسی می‌تواند بسته به زمینه، به صورت‌های مختلفی ترجمه شود، از جمله: چربی، چاق، فربه، یا اضافه وزن.\n",
        "definition": "\"Fat\" refers to a naturally oily or greasy substance occurring in animal bodies, especially when deposited as a layer under the skin or around certain organs. It serves as an energy store, insulates the body, and cushions vital organs. In a broader sense, it also describes someone who is overweight or obese.\n\nSynonyms: adipose, blubber, lard, plump, stout.\n",
        "exampleA": "The doctor recommended a diet low in fat.",
        "exampleB": "He trimmed the fat off the steak before grilling it.",
        "exampleC": "The engine sputtered and died, probably due to a lack of fat in the fuel mixture.",
        "status": ""
    },
    {
        "id": "2e8bcb09-8f0f-49d7-8627-b375c0db1213",
        "word": "fatty foods",
        "persian": "غذاهای چرب",
        "definition": "\"Fatty foods\" refer to food items that are high in fats, which are a type of macronutrient that provides energy and supports cell growth. While some fats are essential for health, consuming excessive amounts, especially unhealthy fats like saturated and trans fats, can contribute to weight gain and increase the risk of heart disease.\n    \nSynonyms: high-fat foods, greasy foods, oily foods, rich foods.\n",
        "exampleA": "Eating too many fatty foods can lead to weight gain and health problems.",
        "exampleB": "The menu offered several healthy alternatives to fatty foods, such as salads and grilled chicken.",
        "exampleC": "I'm trying to cut back on fatty foods and eat more fruits and vegetables.",
        "status": "learned"
    },
    {
        "id": "e6d0b006-0bff-4a7c-a89e-224e09a65c1e",
        "word": "gain weight",
        "persian": "وزن گرفتن",
        "definition": "\"Gain weight\" means to increase one's body mass, typically due to an increase in muscle, fat, and/or fluid. It generally implies an increase in size and heaviness.\n\nSynonyms: put on weight, pack on pounds, bulk up, add pounds.\n",
        "exampleA": "I tend to gain weight easily if I don't exercise regularly.",
        "exampleB": "Many people gain weight during the holidays due to overeating.",
        "exampleC": "The doctor advised him to gain weight in order to improve his overall health.",
        "status": "learned"
    },
    {
        "id": "ad397ac8-1571-4e85-b4ea-8e9351d89734",
        "word": "harm",
        "persian": "\"harm\" در فارسی معمولاً به صورت \"آسیب\"، \"ضرر\"، \"صدمه\" یا \"گزند\" ترجمه می‌شود. انتخاب دقیق‌ترین معادل بستگی به متن و مفهوم مورد نظر دارد.\n",
        "definition": "Harm refers to physical or mental injury, damage, or suffering caused to a person or thing. It encompasses actions or events that result in negative consequences, ranging from minor discomfort to severe trauma. It implies a violation of safety, well-being, or integrity.\n\nSynonyms: injury, damage, hurt, wound, impairment.\n",
        "exampleA": "The doctor swore an oath to do no harm.",
        "exampleB": "Smoking can cause serious harm to your health.",
        "exampleC": "He meant no harm with his words, but they were hurtful.",
        "status": ""
    },
    {
        "id": "b12717e0-3880-4e3a-862a-f65d25fd054b",
        "word": "harmful",
        "persian": "مضر، آسیب‌زا، زیان‌آور یا مضر.\n",
        "definition": "\"Harmful\" describes something that is capable of causing damage, injury, or negative consequences. It implies a potential for causing detriment to health, well-being, or something else valued.\n\nSynonyms: detrimental, damaging, injurious, pernicious, noxious.\n",
        "exampleA": "The factory's emissions were found to be harmful to the environment.",
        "exampleB": "Spreading misinformation online can be harmful to public trust.",
        "exampleC": "Excessive sun exposure is harmful to your skin.",
        "status": ""
    },
    {
        "id": "24a107a9-eaa1-4767-9f6b-7660d3d9186e",
        "word": "health",
        "persian": "\"Health\" در فارسی می‌تواند به «سلامتی»، «تندرستی» یا «بهداشت» ترجمه شود که همگی به وضعیت جسمی و روانی خوب و دور از بیماری اشاره دارند.\n",
        "definition": "Health is a state of complete physical, mental, and social well-being, and not merely the absence of disease or infirmity. It encompasses a holistic approach to feeling good and functioning optimally in all aspects of life.\n\nSynonyms: Wellness, fitness, vigor, soundness, vitality.\n",
        "exampleA": "Regular exercise is crucial for maintaining good health.",
        "exampleB": "The local health department provides resources and information on disease prevention.",
        "exampleC": "Access to affordable health care is a pressing issue in many countries.",
        "status": ""
    },
    {
        "id": "ca6d6846-472c-40ad-aa75-edf16b43242e",
        "word": "health authorities",
        "persian": "دست اندرکاران سلامت",
        "definition": "\"Health authorities\" refers to government agencies and organizations, at local, regional, national, or international levels, responsible for overseeing and protecting public health. They develop and implement policies, regulations, and programs related to healthcare, disease prevention, health promotion, and emergency response to ensure the well-being of the population.\n\nSynonyms: public health agencies, health departments, health ministries, health organizations\n",
        "exampleA": "Health authorities are urging residents to get vaccinated against the flu.",
        "exampleB": "The new guidelines were developed in consultation with health authorities.",
        "exampleC": "Health authorities are investigating a potential outbreak of food poisoning.",
        "status": "learned"
    },
    {
        "id": "11dae94f-6ce6-454e-a3f5-18aa2a294ade",
        "word": "healthy",
        "persian": "\"سالم\" یا \"تندرست\" بهترین معادل‌ها برای کلمه \"healthy\" هستند.\n",
        "definition": "\"Healthy\" generally refers to a state of complete physical, mental, and social well-being, not merely the absence of disease or infirmity. It signifies optimal functioning and vitality, allowing individuals to thrive and enjoy life to the fullest.\n\nSynonyms: Fit, well, sound, robust, wholesome.\n",
        "exampleA": "Eating plenty of fruits and vegetables is essential for a healthy lifestyle.",
        "exampleB": "Regular exercise can help you maintain a healthy weight and improve your overall well-being.",
        "exampleC": "A healthy mind is just as important as a healthy body.",
        "status": ""
    },
    {
        "id": "2ba4746a-7e49-46a8-a3b7-4c4fa9194768",
        "word": "heart attack",
        "persian": "حمله قلبی",
        "definition": "A heart attack, also known as a myocardial infarction (MI), occurs when blood flow to a section of the heart muscle is suddenly blocked, usually by a blood clot. This lack of blood supply deprives the heart muscle of oxygen, and if not restored quickly, can cause irreversible damage or death to that section of the heart. It is a serious medical emergency requiring immediate treatment.\n\nSynonyms: Myocardial infarction, MI, coronary thrombosis, cardiac arrest (though technically refers to the stopping of the heart), coronary occlusion.\n",
        "exampleA": "The man collapsed suddenly, and it was later confirmed he had suffered a heart attack.",
        "exampleB": "Maintaining a healthy lifestyle can significantly reduce the risk of a heart attack.",
        "exampleC": "She experienced chest pain and shortness of breath, which were warning signs of a possible heart attack.",
        "status": "learned"
    },
    {
        "id": "6cbc4a41-7ab9-4aff-ade9-cda903f78c14",
        "word": "infection",
        "persian": "\"عفونت\" به فارسی به معنای ورود و تکثیر یک عامل بیماری‌زا (مانند باکتری، ویروس یا قارچ) در بدن و ایجاد واکنش و آسیب در آن است.\n",
        "definition": "An infection occurs when harmful microorganisms, like bacteria, viruses, fungi, or parasites, invade and multiply within the body, causing illness or disease. These microorganisms disrupt normal bodily functions and trigger an immune response, leading to a variety of symptoms depending on the type and location of the infection.\n\nSynonyms: infestation, contagion, disease, illness, ailment\n",
        "exampleA": "The doctor prescribed antibiotics to treat the infection.",
        "exampleB": "Washing your hands frequently can help prevent the spread of infection.",
        "exampleC": "The wound showed signs of infection, including redness and swelling.",
        "status": ""
    },
    {
        "id": "d1734400-b740-4a13-862c-ab34904f91e9",
        "word": "infectious",
        "persian": "معادل‌های فارسی برای \"infectious\" بسته به متن می‌تونه «مسری»، «واگیردار»، «عفونی» یا «سرایت‌کننده» باشه.\n",
        "definition": "\"Infectious\" describes something that is capable of spreading rapidly, especially a disease or a mood/feeling. It means something has the ability to transmit from one person or place to another.\n\nSynonyms: contagious, communicable, transmittable, catching, pervasive\n",
        "exampleA": "The child's cough was infectious, so he had to stay home from school.",
        "exampleB": "Her enthusiasm was infectious and spread throughout the team.",
        "exampleC": "The disease is highly infectious and requires immediate quarantine.",
        "status": ""
    },
    {
        "id": "339d8ab9-2845-4cd8-85f9-d7ca8510f061",
        "word": "ingredient",
        "persian": "ترکیبات، ",
        "definition": "An ingredient is any substance that is added to a mixture or compound, especially in the preparation of food or other products. It is a component part of a recipe or formula and contributes to the overall character of the final result.\n\nSynonyms: component, element, constituent, part, factor.\n",
        "exampleA": "active ingredients",
        "exampleB": "The recipe lists flour as a key ingredient.",
        "exampleC": "Patience is an essential ingredient for success.",
        "status": "learned"
    },
    {
        "id": "5fbf82d6-5ac7-439c-926c-3a4a5c818842",
        "word": "ingredients",
        "persian": "معادل‌های فارسی \"مواد لازم\"، \"عناصر\"، \"ترکیبات\" یا \"اجزاء تشکیل‌دهنده\" هستند که بسته به متن و کاربرد می‌توان از آن‌ها استفاده کرد.\n",
        "definition": "\"Ingredients\" refers to the individual components or substances that are combined to create something, most commonly food or a mixture. They are the building blocks that, when put together in a specific way, form a complete product.\n\nSynonyms: components, elements, constituents, parts.\n",
        "exampleA": "The recipe called for fresh, locally sourced ingredients.",
        "exampleB": "Be sure to check the ingredients list for any potential allergens.",
        "exampleC": "A skilled chef can transform simple ingredients into a culinary masterpiece.",
        "status": ""
    },
    {
        "id": "a9eb1093-4b13-419d-885e-a05a37b83785",
        "word": "insomnia",
        "persian": "بيخوابى( غير عادى)،مرض بيخوابى",
        "definition": "Insomnia is a sleep disorder characterized by persistent difficulty falling asleep, staying asleep, or experiencing restorative sleep, even when one has the opportunity to do so. It can lead to daytime fatigue, difficulty concentrating, and mood disturbances.\n\nSynonyms: sleeplessness, wakefulness, restlessness, sleepless nights.\n",
        "exampleA": "Her insomnia made it difficult to focus during the day.",
        "exampleB": "Stress and anxiety often contribute to insomnia.",
        "exampleC": "He tried various remedies to combat his chronic insomnia.",
        "status": "learned"
    },
    {
        "id": "534e5f33-22c0-49d3-8b83-26ed31450a59",
        "word": "insomniac",
        "persian": "بدخواب، بی خواب",
        "definition": "An insomniac is a person who regularly experiences difficulty falling asleep, staying asleep, or both, despite having the opportunity to do so. This can lead to daytime fatigue, difficulty concentrating, and mood disturbances.\n\nSynonyms: Sleepless, wakeful, restless, unable to sleep.\n",
        "exampleA": "As an insomniac, she often watched the sunrise.",
        "exampleB": "The doctor prescribed medication to help the insomniac get some sleep.",
        "exampleC": "He was a self-described insomniac, blaming his racing thoughts for his sleepless nights.",
        "status": "learned"
    },
    {
        "id": "0ebf6964-f756-4736-a863-40ea9603c279",
        "word": "intake",
        "persian": "ورودی و مصرف",
        "definition": "\"Intake\" refers to the act of taking something in, whether it's information, food, air, or even new members into an organization. It describes the process of receiving or absorbing something from an external source into an internal system or space.\n\nSynonyms: absorption, consumption, reception, admission, accession.\n",
        "exampleA": "The hospital had a high patient intake yesterday due to the flu.",
        "exampleB": "Please monitor your water intake throughout the day to stay hydrated.",
        "exampleC": "The new employee had a thorough intake session to learn about company policies.",
        "status": "seen"
    },
    {
        "id": "0e87ff4e-dc33-45e8-b673-bfc775c60948",
        "word": "isolation ward",
        "persian": "بخش قرنطینه",
        "definition": "An isolation ward is a specialized hospital unit designed to prevent the spread of contagious diseases. It physically separates patients with highly infectious illnesses from other patients, healthcare workers, and visitors, often employing strict protocols for entry, exit, and waste disposal to minimize the risk of transmission.\n\nSynonyms: quarantine ward, infectious disease unit, isolation unit, negative pressure room.\n",
        "exampleA": "The patient was immediately transferred to the isolation ward upon arrival.",
        "exampleB": "Nurses in the isolation ward wear full protective gear to prevent the spread of infection.",
        "exampleC": "The hospital built a new isolation ward to handle the surge of patients during the pandemic.",
        "status": "seen"
    },
    {
        "id": "be934901-731c-46b3-b9c5-f5555c61d861",
        "word": "junk food",
        "persian": "\"Junk food\" در فارسی معمولاً به عنوان \"غذای ناسالم\"، \"خوراکی‌های بی‌ارزش غذایی\" یا \"هله هوله\" ترجمه می‌شود.\n",
        "definition": "\"Junk food\" refers to processed foods that are low in nutritional value but high in calories, often containing excessive amounts of unhealthy fats, sugars, and sodium. These foods provide little to no essential vitamins, minerals, or fiber and are often associated with negative health consequences when consumed regularly.\n\nSynonyms: Unhealthy food, fast food, processed food, empty-calorie food\n",
        "exampleA": "Eating too much junk food can lead to health problems.",
        "exampleB": "My favorite guilty pleasure is indulging in junk food on the weekends.",
        "exampleC": "The vending machine at work is filled with tempting junk food options.",
        "status": ""
    },
    {
        "id": "fd0f690b-2d39-4066-b577-fb1d51eb6fff",
        "word": "lean",
        "persian": "لاغر و اندامی (با معنای مثبت)",
        "definition": "\"Lean\" describes a process or methodology focused on maximizing value for the customer while minimizing waste. It emphasizes efficiency, continuous improvement, and streamlining operations by eliminating unnecessary steps, resources, and costs. The goal is to deliver high-quality products or services with the least amount of effort, time, and resources.\n\nSynonyms: Streamlined, efficient, optimized, agile, waste-free.\n",
        "exampleA": "The old shed began to lean precariously to one side.",
        "exampleB": "She decided to lean into her strengths and focus on writing.",
        "exampleC": "The company adopted a lean manufacturing process to reduce waste.",
        "status": "learned"
    },
    {
        "id": "5a12b38d-d30b-436f-bfe4-2a048b79779d",
        "word": "maintain",
        "persian": "\"Maintain\" بسته به متن می‌تونه معانی مختلفی داشته باشه، اما رایج‌ترین ترجمه‌ها عبارتند از: \"نگهداری کردن\"، \"حفظ کردن\"، \"پایدار نگه داشتن\" یا \"ادامه دادن\".\n",
        "definition": "To maintain something means to keep it in good condition or working order, often by regularly checking and repairing it. It implies preventing decline or preserving a particular state. It can also mean to continue or preserve a certain situation or feeling.\n\nSynonyms: preserve, uphold, sustain, conserve, retain.\n",
        "exampleA": "It's important to maintain a healthy diet and exercise regularly.",
        "exampleB": "The museum staff works hard to maintain the artifacts in pristine condition.",
        "exampleC": "The company aims to maintain its market share despite increased competition.",
        "status": ""
    },
    {
        "id": "f6698957-eb13-48a8-a13b-cedb7ee23043",
        "word": "moderate",
        "persian": "\"Moderate\" بسته به متن می‌تونه به معانی مختلفی ترجمه بشه، اما رایج‌ترین معادل‌های فارسی اون عبارتند از: \"معتدل\"، \"میانه‌رو\"، \"ملایم\"، و \"متوسط\".\n",
        "definition": "\"Moderate\" implies avoiding extremes of behavior, opinion, or quality. It suggests a middle ground, characterized by restraint, balance, and reasonableness. Something moderate is neither excessive nor deficient, falling within a comfortable or acceptable range.\n\nSynonyms: temperate, mild, reasonable, balanced, average.\n",
        "exampleA": "The doctor recommended moderate exercise for improving my cardiovascular health.",
        "exampleB": "We need to find a moderate solution that satisfies both parties.",
        "exampleC": "The weather forecast predicts moderate rainfall tomorrow.",
        "status": ""
    },
    {
        "id": "831c8e10-f078-43be-9297-07754855919d",
        "word": "mouth",
        "persian": "لب خوانی کردن،",
        "definition": "The \"mouth\" is the opening in the face through which we eat, speak, and breathe. It's a primary entry point for sustenance and a key component in communication, allowing us to articulate sounds and express ourselves. It also plays a role in non-verbal communication, such as smiling or frowning.\n\nSynonyms: Oral cavity, maw, jaws, yap.\n",
        "exampleA": "It looks to me as if the singers are only mouthing the words .",
        "exampleB": "He stuffed the sandwich into his mouth.",
        "exampleC": "The word tasted bitter in her mouth.",
        "status": "learned"
    },
    {
        "id": "c8d1544b-5b0f-4bc0-9186-add2d5eb46d4",
        "word": "muscle",
        "persian": "ماهیچه، عضله یا ماهی همگی می‌توانند ترجمه‌های مناسبی برای کلمه \"muscle\" باشند، بسته به متن و منظور مورد نظر.\n",
        "definition": "\"Muscle\" refers to a body tissue composed of fibers that can contract, causing movement or maintaining the position of parts of the body. It is essential for everything from walking and talking to pumping blood and digesting food.\n\nSynonyms: sinew, brawn, strength, power, physique\n",
        "exampleA": "He strained a muscle while lifting the heavy box.",
        "exampleB": "Regular exercise helps build muscle and improve overall strength.",
        "exampleC": "The doctor checked the muscle's range of motion after the injury.",
        "status": ""
    },
    {
        "id": "4f26ed35-0aa8-4a1c-997a-5bb9506d8977",
        "word": "nourish",
        "persian": "تغذیه کردن ، پروراندن ، تقویت کردن",
        "definition": "To nourish means to provide with the food or other substances necessary for growth, health, and good condition. It implies actively supporting and sustaining something to allow it to thrive and develop properly.\n\nSynonyms: feed, nurture, sustain, cultivate, foster\n",
        "exampleA": "I was doing everything I could to nourish and protect the baby",
        "exampleB": "A healthy diet is essential to nourish both body and mind.",
        "exampleC": "The artist sought to nourish his creative spirit by spending time in nature.",
        "status": "learned"
    },
    {
        "id": "0cbba496-1eb1-4d7c-9712-4422a2af3068",
        "word": "nutrient",
        "persian": "«مغذی» یا «ماده مغذی» بهترین معادل برای کلمه \"nutrient\" هستند.\n",
        "definition": "A nutrient is a substance that provides nourishment essential for growth, metabolism, and repair in living organisms. These substances are obtained from food and are vital for maintaining life processes. Nutrients can be categorized into macronutrients (like carbohydrates, fats, and proteins) needed in larger amounts, and micronutrients (like vitamins and minerals) required in smaller quantities.\n\nSynonyms: nourishment, aliment, food, sustenance, dietary component.\n",
        "exampleA": "The soil was depleted of essential nutrients, hindering plant growth.",
        "exampleB": "A balanced diet provides the body with all the necessary nutrients for optimal health.",
        "exampleC": "The doctor recommended a supplement to address the nutrient deficiency.",
        "status": ""
    },
    {
        "id": "dac47aeb-97aa-43fa-8b7c-9400589643c4",
        "word": "Nutrient",
        "persian": "مقوي",
        "definition": "A food or substance that makes plants, humans or animals grow",
        "exampleA": "A balanced diet provides all the essential nutrients the body needs.",
        "exampleB": "The soil was tested to determine its nutrient content.",
        "exampleC": "Lack of sufficient nutrient intake can lead to various health problems.",
        "status": "learned"
    },
    {
        "id": "a74fad7b-c205-411f-84db-e32955714edf",
        "word": "nutrition",
        "persian": "\"Nutrition\" در فارسی معمولاً به \"تغذیه\" ترجمه می‌شود که به معنای فرایند دریافت و استفاده از مواد غذایی برای حفظ سلامتی و رشد است.\n",
        "definition": "Nutrition refers to the process of obtaining and utilizing food for growth, repair, and maintenance of the body. It encompasses the intake, absorption, and assimilation of nutrients from food, including vitamins, minerals, proteins, carbohydrates, and fats, all of which are essential for optimal health and well-being.\n\nSynonyms: nourishment, sustenance, dietetics, alimentation.\n",
        "exampleA": "Proper nutrition is essential for maintaining good health.",
        "exampleB": "The school provides information on nutrition to its students.",
        "exampleC": "She is studying nutrition to become a registered dietitian.",
        "status": ""
    },
    {
        "id": "d8de3b1d-dc83-4df8-9fc0-89eafb826fe3",
        "word": "nutritious",
        "persian": "مغذى",
        "definition": "\"Nutritious\" describes something that provides essential substances needed for growth, health, and good condition. It refers to food that is rich in vitamins, minerals, and other beneficial components that nourish the body.\n\nSynonyms: wholesome, nourishing, healthy, beneficial, valuable.\n",
        "exampleA": "A diet rich in fruits and vegetables is essential for providing nutritious meals.",
        "exampleB": "The doctor recommended adding more nutritious foods to her diet to improve her energy levels.",
        "exampleC": "Oatmeal with berries and nuts is a quick and nutritious breakfast option.",
        "status": "learned"
    },
    {
        "id": "b26c97da-08c5-4d65-b85b-c290849486ec",
        "word": "obese",
        "persian": "چاق، دارای اضافه وزن",
        "definition": "overweight",
        "exampleA": "The doctor advised the patient to lose weight, as he was considered obese.",
        "exampleB": "Childhood obesity is a growing concern in many developed countries.",
        "exampleC": "Studies show a correlation between processed food consumption and becoming obese.",
        "status": "learned"
    },
    {
        "id": "4dedd3de-d283-48fe-99b1-fe55431eaa11",
        "word": "obesity",
        "persian": "مرض چاقی",
        "definition": "Obesity is a complex disease involving an excessive amount of body fat. It's not just a cosmetic concern because it increases your risk of diseases and health problems, such as heart disease, diabetes, high blood pressure, and certain cancers. Obesity typically results from a combination of factors including genetics, environment, diet, physical inactivity, and, in some cases, underlying medical conditions.\n\nSynonyms: corpulence, overweight, plumpness, stoutness, fatness.\n",
        "exampleA": "Obesity is a major risk factor for heart disease and diabetes.",
        "exampleB": "Public health campaigns aim to raise awareness about the dangers of obesity.",
        "exampleC": "Genetic predisposition can contribute to a person's likelihood of developing obesity.",
        "status": "learned"
    },
    {
        "id": "9b0f917e-70dc-480c-850c-6009a948b662",
        "word": "onset",
        "persian": "شروع",
        "definition": "\"Onset\" refers to the beginning or start of something, especially something unpleasant or problematic like a disease, a storm, or a war. It signifies the initial stage or commencement of an event or process.\n\nSynonyms: commencement, beginning, start, inception, outbreak\n",
        "exampleA": "the onset of winter",
        "exampleB": "The onset of the disease was gradual and difficult to detect.",
        "exampleC": "With the onset of winter, the days grew shorter and colder.",
        "status": "seen"
    },
    {
        "id": "035256b3-2247-49e1-886c-4785cbc510bb",
        "word": "overdo",
        "persian": "زیاده روی کردن",
        "definition": "To \"overdo\" something means to do it to an excessive degree, going beyond what is necessary, appropriate, or effective. It implies pushing something past a healthy or desirable limit, often resulting in a negative consequence or undesirable outcome.\nSynonyms: exaggerate, overindulge, overkill, go overboard.\n",
        "exampleA": "Don't overdo the spices in the sauce.",
        "exampleB": "I tend to overdo it at the gym when I'm stressed.",
        "exampleC": "He didn't want to overdo the decorations for the party.",
        "status": "learned"
    },
    {
        "id": "4711b62f-35b3-4b56-97a5-35ce92e96145",
        "word": "overeat",
        "persian": "پرخوری کردن",
        "definition": "\"Overeat\" means to consume more food than your body needs or can comfortably process, often leading to feelings of fullness, discomfort, or even illness. It's exceeding your body's hunger signals and eating beyond the point of satisfaction.\n\nSynonyms: binge, gorge, stuff, gobble, devour.\n",
        "exampleA": "I tend to overeat when I'm stressed.",
        "exampleB": "It's easy to overeat at a buffet.",
        "exampleC": "The doctor warned him not to overeat due to his health condition.",
        "status": "learned"
    },
    {
        "id": "20f65939-315b-4ba4-af20-e5c524939566",
        "word": "overweight",
        "persian": "\"Overweight\" در فارسی معمولاً به صورت \"اضافه وزن\" یا \"دارای اضافه وزن\" ترجمه می‌شود.\n",
        "definition": "\"Overweight\" describes a condition where a person carries more body weight than is considered healthy for their height, typically due to excess body fat. It's a less clinical term than \"obese\" and generally indicates a level of weight that increases the risk of certain health problems.\n\nSynonyms: heavy, plump, stout, fleshy.\n",
        "exampleA": "The doctor advised him to lose weight as he was slightly overweight.",
        "exampleB": "Many people struggle with being overweight due to various lifestyle factors.",
        "exampleC": "She felt self-conscious about being overweight, but she was working towards a healthier lifestyle.",
        "status": ""
    },
    {
        "id": "4bff80e1-b53e-464c-8ce9-28a8490f24a5",
        "word": "persistent",
        "persian": "مداوم، شخص مصر",
        "definition": "\"Persistent\" describes someone or something that continues firmly or obstinately in a course of action despite difficulty or opposition. It implies a determined and unwavering effort to achieve a goal, refusing to give up easily.\n\nSynonyms: tenacious, determined, resolute, persevering, steadfast.\n",
        "exampleA": "Despite numerous setbacks, her persistent efforts eventually led to success.",
        "exampleB": "The persistent cough lingered for weeks after the initial illness.",
        "exampleC": "His persistent questioning annoyed the witness, but he was determined to get to the truth.",
        "status": "learned"
    },
    {
        "id": "4aeb227b-6161-40e3-8121-636c6707ee86",
        "word": "portion",
        "persian": "\"portion\" بسته به متن می‌تونه به معانی مختلفی ترجمه بشه، اما رایج‌ترین ترجمه‌ها عبارتند از: سهم، قسمت، مقدار، وعده.\n",
        "definition": "A portion refers to a specific amount or serving of something, often food, but it can also refer to a part of a whole, like a share or segment. It emphasizes that what is being described is less than the entirety and represents a defined quantity.\n\nSynonyms: serving, share, piece, segment, allotment.\n",
        "exampleA": "A large portion of the cake was gone before I even got a slice.",
        "exampleB": "He donated a significant portion of his salary to charity.",
        "exampleC": "Please only eat a small portion of the french fries, as dinner is coming soon.",
        "status": ""
    },
    {
        "id": "73c9d7b3-14a9-4aa7-b864-a914d61370f2",
        "word": "prevent",
        "persian": "\"Prevent\" در فارسی معمولاً به صورت \"جلوگیری کردن\"، \"پیشگیری کردن\" یا \"ممانعت کردن\" ترجمه می‌شود. انتخاب دقیق‌ترین معادل بستگی به متن و موقعیت استفاده دارد.\n",
        "definition": "To prevent something means to stop it from happening or occurring. It involves taking action to avert, hinder, or block a future event, typically something undesirable.\n\nSynonyms: avert, hinder, preclude, forestall, impede\n",
        "exampleA": "Regular exercise can help prevent heart disease.",
        "exampleB": "The new regulations are designed to prevent pollution.",
        "exampleC": "We need to take action now to prevent a crisis.",
        "status": ""
    },
    {
        "id": "acd7ba30-bf48-43c5-ba4b-04c7500bcfe0",
        "word": "recommend",
        "persian": "\"Recommend\" در فارسی معمولاً به صورت \"توصیه کردن\"، \"پیشنهاد کردن\" یا \"سفارش کردن\" ترجمه می‌شود. انتخاب دقیق‌ترین معادل بستگی به زمینه استفاده دارد.\n",
        "definition": "To recommend means to suggest or endorse someone or something as being suitable or good for a particular purpose or job. It's essentially advising someone to consider something positively.\n\nSynonyms: suggest, advise, endorse, commend, advocate, propose.\n",
        "exampleA": "I would recommend trying the pasta special; it's delicious.",
        "exampleB": "The doctor recommend that I get more exercise.",
        "exampleC": "Do you recommend any good books by this author?",
        "status": ""
    },
    {
        "id": "84e80592-75bc-4a6f-8bfe-945b2aa66f6b",
        "word": "recover",
        "persian": "\"Recover\" بسته به متن می‌تونه معانی مختلفی داشته باشه، اما به طور کلی می‌شه اون رو به این صورت‌ها ترجمه کرد: بهبود یافتن، بازیابی کردن، جبران کردن، پس گرفتن.\n",
        "definition": "To recover means to return to a normal state of health, strength, or condition after an illness, injury, shock, or setback. It can also mean to regain possession of something lost or stolen. Essentially, it signifies a return to a previous, desired state.\n\nSynonyms: bounce back, recuperate, reclaim, retrieve, get better.\n",
        "exampleA": "It took him several weeks to recover from the flu.",
        "exampleB": "The company is trying to recover from its financial losses.",
        "exampleC": "The police were able to recover the stolen artwork.",
        "status": ""
    },
    {
        "id": "9dc36a32-61fb-4c96-ba00-13b7aeb11b9e",
        "word": "reduce",
        "persian": "\"Reduce\" در فارسی می‌تواند بسته به زمینه به معانی مختلفی ترجمه شود، اما رایج‌ترین معادل‌ها عبارتند از: \"کاهش دادن\"، \"کم کردن\"، \"پایین آوردن\"، \"کوچک کردن\" و \"تقلیل دادن\".\n",
        "definition": "\"Reduce\" means to make something smaller in size, amount, degree, or intensity. It implies a decrease or lessening of something.\n\nSynonyms: lessen, diminish, decrease, lower, curtail.\n",
        "exampleA": "We need to reduce our carbon footprint to protect the environment.",
        "exampleB": "The doctor recommended I reduce my salt intake.",
        "exampleC": "The company decided to reduce the price of the software.",
        "status": ""
    },
    {
        "id": "0dbfcf6e-fac5-4e0c-a2b5-f9a7f41a18d9",
        "word": "regular",
        "persian": "\"Regular\" بسته به متن می‌تونه معانی مختلفی داشته باشه، اما رایج‌ترین ترجمه‌هاش این‌ها هستند: معمولی، مرتب، منظم، یا همیشگی.\n",
        "definition": "\"Regular\" generally means something that happens or is done frequently or habitually; it can also describe something that conforms to a standard pattern or arrangement. It implies consistency, ordinariness, and adherence to rules or norms. It also means a customer who frequents a specific establishment.\n\nSynonyms: habitual, usual, consistent, ordinary, typical, frequent.\n",
        "exampleA": "He orders the regular coffee every morning.",
        "exampleB": "She is a regular at the library.",
        "exampleC": "Ensure you perform regular maintenance on your vehicle.",
        "status": ""
    },
    {
        "id": "af542d9b-b471-4b89-bc12-fd7eb316e898",
        "word": "retired",
        "persian": "بازنشته",
        "definition": "\"Retired\" describes the state of having permanently left one's job or profession, typically after reaching a certain age or length of service. It implies a transition from active employment to a period of leisure, personal pursuits, or other activities outside of traditional work.\n\nSynonyms: separated, pensioned off, emeritus, inactive\n",
        "exampleA": "After 30 years of teaching, Mrs. Johnson finally retired.",
        "exampleB": "My father retired last year and has been traveling the world ever since.",
        "exampleC": "The old mill, once a bustling hub of activity, now sits retired and silent.",
        "status": "learned"
    },
    {
        "id": "f397e2ab-0602-4409-9393-fd1f59696c90",
        "word": "risk",
        "persian": "\"ریسک\" در فارسی به معنای خطر، احتمال وقوع یک اتفاق ناخوشایند، یا میزان آسیب‌پذیری در برابر یک خطر است.\n",
        "definition": "\"Risk\" refers to the possibility of experiencing harm, loss, or danger. It involves uncertainty about outcomes, where there's a chance that things may not go as planned and could result in negative consequences. Essentially, it's the potential for something bad to happen.\n\nSynonyms: peril, hazard, jeopardy, uncertainty, vulnerability.\n",
        "exampleA": "Investing in the stock market always involves a certain level of risk.",
        "exampleB": "He took a significant risk by quitting his job to start his own business.",
        "exampleC": "The doctor explained the risks and benefits of the surgery.",
        "status": ""
    },
    {
        "id": "4649b683-c3ef-4f0a-b7cb-e7acc9525c67",
        "word": "serving",
        "persian": "در حال خدمت",
        "definition": "\"Serving\" refers to the act of presenting food or drinks to someone, typically a meal or a portion of a meal. It encompasses the preparation, arrangement, and delivery of nourishment to be consumed.\n\nSynonyms: dispensing, offering, providing, distributing, dishing out.\n",
        "exampleA": "serving military officers",
        "exampleB": "The restaurant is known for serving authentic Italian cuisine.",
        "exampleC": "He dedicated his life to serving the community.",
        "status": "learned"
    },
    {
        "id": "08ee89db-08ee-442b-b15d-077d74eddd75",
        "word": "serving",
        "persian": "وعده غذایی، سهم عذایی",
        "definition": "\"Serving\" refers to the act of presenting or providing something, typically food or drinks, to someone. It can also encompass being employed in a position of duty or assistance. Essentially, it's the act of giving or helping in some capacity.\n\nSynonyms: distributing, dispensing, providing, assisting, helping.\n",
        "exampleA": "She enjoys serving her community through volunteer work.",
        "exampleB": "The restaurant is known for serving delicious, authentic Italian food.",
        "exampleC": "He is currently serving a five-year prison sentence.",
        "status": "learned"
    },
    {
        "id": "45a8ba66-cc18-4c70-9656-8284bb66a0c1",
        "word": "serving",
        "persian": "معنی \"serving\" بسته بهcontext  متفاوته. اینجا چند تا معنی رایجش رو میگم:\n\n   سرو کردن/تقدیم کردن: مثلاً سرو غذا یا نوشیدنی.\n   خدمت کردن: مثلاً خدمت در ارتش یا خدمت به مردم.\n   سِرو (غذا): یک واحد مشخص از غذا برای یک نفر.\n   انجام وظیفه: مثلاً انجام وظیفه در یک پست یا مقام.\n   زدن (تو ورزش): مثلاً زدن توپ سرویس در تنیس.\n",
        "definition": "\"Serving\" has multiple meanings, but generally refers to the act of providing something, whether it's food, a purpose, or fulfilling a duty. It implies an act of giving or assisting in some way, often with an element of responsibility or dedication. It can also refer to a specific portion of food.\n\nSynonyms: helping, assisting, providing, delivering, dispensing, attending to.\n",
        "exampleA": "The restaurant is known for its generous serving of pasta.",
        "exampleB": "He is serving a life sentence for his crimes.",
        "exampleC": "The tennis player was serving with impressive power.",
        "status": ""
    },
    {
        "id": "a20661c2-f4b2-4c35-bcad-6b6d1f810c2f",
        "word": "skip",
        "persian": "معنی \"skip\" بسته به متن می‌تونه متفاوت باشه، اما رایج‌ترین معادل‌های فارسی اون این‌ها هستن:\n\n   نادیده گرفتن/رد شدن: وقتی بخوایم بگیم از چیزی رد شدیم یا بهش توجه نکردیم.\n   صرف نظر کردن/چشم‌پوشی کردن: وقتی بخوایم بگیم از انجام کاری منصرف شدیم.\n   جا انداختن: وقتی بخوایم بگیم قسمتی از چیزی رو حذف کردیم.\n   فرار کردن/در رفتن: وقتی بخوایم بگیم از جایی یا چیزی فرار کردیم.\n   طناب زدن: به عنوان یک ورزش.\n",
        "definition": "\"Skip\" is a versatile word that generally means to omit, leave out, or not do something that would typically be expected. It can refer to missing a step while jumping, passing over something in a text, or neglecting a task or activity.\n\nSynonyms: omit, miss, disregard, bypass, jump, leap\n",
        "exampleA": "I decided to skip breakfast this morning.",
        "exampleB": "The record started to skip, ruining the song.",
        "exampleC": "Let's skip ahead to the interesting part of the movie.",
        "status": ""
    },
    {
        "id": "2a48084b-3b01-4004-96d0-89af413675e3",
        "word": "skip meals",
        "persian": "وعده غذایی را حذف کردن",
        "definition": "\"Skip meals\" means intentionally or unintentionally omitting or missing scheduled meals, such as breakfast, lunch, or dinner. It often implies a deviation from a regular eating pattern due to factors like lack of time, dieting, disinterest in food, or financial constraints.\n\nSynonyms: miss meals, omit meals, forego meals, go without food, neglect meals.\n",
        "exampleA": "Doctors warn that it's unhealthy to skip meals regularly.",
        "exampleB": "She tends to skip meals when she's feeling stressed about work.",
        "exampleC": "To save money, they sometimes skip meals and eat ramen noodles.",
        "status": "learned"
    },
    {
        "id": "6a58aa34-35c7-4801-890f-60a71a66e13c",
        "word": "staple",
        "persian": "منگنه",
        "definition": "A staple is a basic or essential item, food, or element that is consistently used or needed. It represents something fundamental and routinely relied upon for a particular purpose or in a certain context.\n\nSynonyms: essential, fundamental, mainstay, basic, necessity\n",
        "exampleA": "Rice is a staple food in many Asian countries.",
        "exampleB": "The little black dress is a staple in every woman's wardrobe.",
        "exampleC": "Staple the papers together in the upper left corner.",
        "status": "learned"
    },
    {
        "id": "52ae9fa6-d1f5-49ef-958a-99c95b5c9d1c",
        "word": "staple",
        "persian": "اساسی، عمده، اصلی",
        "definition": "A staple is a basic or essential item, food, or element that is regularly used or needed. It signifies something fundamental and indispensable to a particular context, whether it be a cuisine, a wardrobe, or a business operation.\n\nSynonyms: essential, fundamental, basic, key, necessity.\n",
        "exampleA": "The staple diet here is mutton, fish and boiled potatoes.",
        "exampleB": "Rice is a staple food in many Asian countries.",
        "exampleC": "A classic white shirt is a wardrobe staple.",
        "status": "learned"
    },
    {
        "id": "93537029-3cef-494e-bcc7-775dc779ec9a",
        "word": "staple diet",
        "persian": "رژیم غذایی عمده",
        "definition": "A staple diet refers to a food or a group of foods that forms the basis of a person's or a population's nutrition and provides a significant portion of their daily energy and nutrient intake. These foods are usually readily available, relatively inexpensive, and consumed frequently.\n\nSynonyms: dietary mainstay, primary food source, dietary staple, basic food, everyday food.\n",
        "exampleA": "Rice is a staple diet for many people in Asia.",
        "exampleB": "Potatoes were a staple diet during the Irish famine.",
        "exampleC": "For years, corn and beans have been a staple diet of the indigenous population.",
        "status": "learned"
    },
    {
        "id": "128ee5a7-24b5-4f3a-bad8-bec7d21207de",
        "word": "stimulate",
        "persian": "\"Stimulate\" بسته به متن می‌تونه به معانی مختلفی ترجمه بشه، اما رایج‌ترین معادل‌ها عبارتند از: تحریک کردن، برانگیختن، فعال کردن، یا تهییج کردن.\n",
        "definition": "To stimulate means to encourage activity or growth in something, or to make something more active. It involves a process of arousing, exciting, or prompting a particular response or action.\n\nSynonyms: activate, invigorate, provoke, incite.\n",
        "exampleA": "The teacher used a hands-on activity to stimulate the students' interest in science.",
        "exampleB": "Coffee can stimulate your nervous system and make you feel more alert.",
        "exampleC": "The government is implementing policies to stimulate economic growth.",
        "status": ""
    },
    {
        "id": "9096f112-de4a-4b8f-979b-00b76a5b15f6",
        "word": "stress",
        "persian": "\"استرس\" در فارسی به صورت‌های مختلفی ترجمه می‌شود که رایج‌ترین آن‌ها \"فشار روانی\"، \"تنش\"، \"اضطراب\" و یا \"استرس\" (به صورت وام‌واژه) است. انتخاب بهترین معادل بستگی به متن و موقعیت دارد.\n",
        "definition": "Stress is a state of mental or emotional strain or tension resulting from adverse or demanding circumstances. It's how our bodies and minds react to any kind of demand or pressure. This reaction can trigger physical and emotional symptoms, and prolonged stress can have negative impacts on our health.\n\nSynonyms: pressure, strain, tension, anxiety, worry.\n",
        "exampleA": "The constant deadlines at work cause him a lot of stress.",
        "exampleB": "Learning to manage stress is important for overall well-being.",
        "exampleC": "She found that exercise was a good way to relieve stress.",
        "status": ""
    },
    {
        "id": "b37dd3f3-87df-4075-ba12-9fa185b34386",
        "word": "stroke",
        "persian": "سکته",
        "definition": "A stroke, also known as a cerebrovascular accident (CVA), occurs when the blood supply to part of the brain is interrupted or reduced, depriving brain tissue of oxygen and nutrients. This can lead to brain cell damage or death, resulting in sudden neurological symptoms like weakness, numbness, difficulty speaking, or vision problems. Strokes are medical emergencies requiring immediate treatment to minimize long-term disability or death.\n\nSynonyms: Brain attack, cerebrovascular incident, CVA.\n",
        "exampleA": "She suffered/had a stroke that left her unable to speak.",
        "exampleB": "The artist finished the painting with a final, bold stroke of the brush.",
        "exampleC": "She was devastated when her grandfather suffered a stroke.",
        "status": "learned"
    },
    {
        "id": "20194f8f-e8bc-445a-8af6-d88bdf98cecb",
        "word": "tasty",
        "persian": "خوش طعم",
        "definition": "\"Tasty\" describes food that has a pleasant and enjoyable flavor. It implies a positive sensory experience related to taste, suggesting the food is delicious and appealing to eat.\n\nSynonyms: Delicious, flavorful, palatable, scrumptious, appetizing\n",
        "exampleA": "The chef prepared a tasty meal for the restaurant guests.",
        "exampleB": "This apple pie is incredibly tasty, I'll have another slice.",
        "exampleC": "Even though it was simple, the sandwich was surprisingly tasty.",
        "status": "learned"
    },
    {
        "id": "55bd8c11-480e-41c7-86c5-8e49aaea26ff",
        "word": "teethe",
        "persian": "دندان در آوردن",
        "definition": "To teethe means to grow teeth, especially referring to the process in babies where their first teeth erupt through the gums, often causing discomfort and irritability.\n\nSynonyms: Cutting teeth, dentition, erupting teeth.\n",
        "exampleA": "My sister was up most of the night with her baby who's teething.",
        "exampleB": "The baby started to teethe around six months old, causing a lot of drool and fussiness.",
        "exampleC": "Giving her a cold teething ring helped soothe her gums while she began to teethe.",
        "status": "learned"
    },
    {
        "id": "90256c46-9fb6-4125-b1d0-756c373e1239",
        "word": "therapy",
        "persian": "\"therapy\" در فارسی معمولاً به صورت \"درمان\"، \"روان‌درمانی\" یا \"تراپی\" ترجمه می‌شود که بسته به نوع و زمینه مورد استفاده، معنای دقیق آن مشخص می‌شود.\n",
        "definition": "Therapy, in its broadest sense, refers to the treatment of a disease or disorder. More specifically, it's often used to describe the process of working with a trained professional to improve mental health and well-being by addressing emotional, psychological, and behavioral challenges. It aims to help individuals understand themselves better, develop coping mechanisms, and make positive changes in their lives.\n\nSynonyms: Counseling, psychotherapy, treatment, rehabilitation.\n",
        "exampleA": "After the accident, she found therapy to be incredibly helpful in processing her trauma.",
        "exampleB": "Cognitive behavioral therapy is a common approach for treating anxiety disorders.",
        "exampleC": "He decided to seek therapy to improve his communication skills in relationships.",
        "status": ""
    },
    {
        "id": "d9fdd917-23b8-4988-a44b-c4d1672b9b6c",
        "word": "to be allergic to sth",
        "persian": "به چیزی حساسیت داشتن",
        "definition": "To be allergic to something means your body's immune system mistakenly identifies a harmless substance (allergen) as a threat and overreacts, triggering a range of symptoms like skin rashes, sneezing, or even more severe reactions. In essence, your body is hypersensitive to that specific substance.\n\nSynonyms: sensitive to, intolerant to, reactive to\n",
        "exampleA": "I found out I'm allergic to peanuts after eating a candy bar.",
        "exampleB": "She had to carry an EpiPen because she was allergic to bee stings.",
        "exampleC": "Many people are allergic to dairy products and have to find alternatives.",
        "status": "learned"
    },
    {
        "id": "bd3258b0-c553-4898-b5ea-ea003f5e10ba",
        "word": "treatment",
        "persian": "\"Treatment\" بسته به متن می‌تونه به معانی مختلفی مثل \"درمان\"، \"معالجه\"، \"رفتار\" یا \"برخورد\" ترجمه بشه.\n",
        "definition": "\"Treatment\" refers to the management and care of a patient to combat disease or disorder. It aims to cure, alleviate symptoms, prevent further progression, or improve overall well-being.\n\nSynonyms: Therapy, remedy, intervention, care, management\n",
        "exampleA": "The patient responded well to the treatment.",
        "exampleB": "Finding the right treatment can be a long process.",
        "exampleC": "He refused medical treatment despite his severe illness.",
        "status": ""
    },
    {
        "id": "d7d7717f-771e-4bfe-a875-e179334b58fa",
        "word": "trigger",
        "persian": "به جریان انداختن",
        "definition": "A \"trigger\" refers to something that initiates a process, reaction, or event. It's the specific action, stimulus, or circumstance that sets something else in motion, often a chain reaction or a particular response. It can be anything from a physical device that starts a machine to a psychological stimulus that evokes a memory or emotion.\n\nSynonyms: catalyst, stimulus, activator, spark, cause\n",
        "exampleA": "Loud noises can trigger her anxiety.",
        "exampleB": "The new policy was the trigger for the employee walkout.",
        "exampleC": "What was the trigger that caused the alarm to go off?",
        "status": "seen"
    },
    {
        "id": "0aa4bed2-78c1-48df-ad91-1b7b46f0e8cd",
        "word": "variety",
        "persian": "\"تنوع\" معادل دقیقی برای variety است. بسته به متن، می‌توان از کلماتی مانند \"گوناگونی\"، \"تفاوت\" یا \"تنوع‌پذیری\" هم استفاده کرد.\n",
        "definition": "\"Variety\" refers to the state of being diverse or having a range of different things. It suggests a lack of uniformity and the presence of multiple options or forms. This concept applies to everything from food and entertainment to people and ideas, adding interest and richness to life.\n\nSynonyms: diversity, assortment, range, selection, multiplicity\n",
        "exampleA": "The store offers a wide variety of cheeses from around the world.",
        "exampleB": "To maintain a healthy diet, it's important to eat a variety of fruits and vegetables.",
        "exampleC": "The art exhibit showcased a variety of styles, from abstract to realistic.",
        "status": ""
    },
    {
        "id": "10abf943-e786-47e5-8497-e63bfa0a8e91",
        "word": "vital",
        "persian": "\"Vital\" بسته به متن می‌تونه به صورت‌های مختلفی ترجمه بشه، اما رایج‌ترین معادل‌های اون \"حیاتی\"، \"ضروری\" یا \"مهم\" هستند.\n",
        "definition": "\"Vital\" means absolutely necessary or essential for life, success, or continuation of something. It signifies something indispensable and critically important. Without it, the subject in question would likely fail or cease to exist.\n\nSynonyms: crucial, essential, indispensable, key, fundamental.\n",
        "exampleA": "Water is vital for all living things.",
        "exampleB": "A strong economy is vital to a country's success.",
        "exampleC": "It is vital that you arrive on time for the meeting.",
        "status": ""
    },
    {
        "id": "810fabc4-106a-4592-8e46-a015430f99e3",
        "word": "weight",
        "persian": "\"Weight\" در فارسی بسته به context می‌تونه معانی مختلفی داشته باشه، اما رایج‌ترین ترجمه‌ها عبارتند از: وزن (برای اشیا و افراد) یا اهمیت (برای مسائل و نظرات).\n",
        "definition": "\"Weight\" refers to the heaviness of an object, determined by the force of gravity acting upon its mass. It's a measure of how strongly something is pulled downwards.\n\nSynonyms: heaviness, load, burden, heft.\n",
        "exampleA": "The weight of the package was heavier than I expected.",
        "exampleB": "She carefully monitored her weight after the holidays.",
        "exampleC": "The climber felt the weight of the rope pulling him upward.",
        "status": ""
    },
    {
        "id": "4d17462c-7885-438f-b3f5-10354f1daa11",
        "word": "writhe",
        "persian": "به خود پیچیدن",
        "definition": "\"Writhe\" means to twist and turn the body in a snakelike or contorted manner, often expressing pain, discomfort, or embarrassment. It suggests a struggling or squirming movement, usually involuntary.\n\nSynonyms: squirm, wriggle, contort, twist, agonize.\n",
        "exampleA": "The pain was so unbearable that he was writhing in agony.",
        "exampleB": "The wounded animal began to writhe in pain.",
        "exampleC": "She watched him writhe with embarrassment after he tripped on stage.",
        "status": "learned"
    }
]