[
    {
        "id": "3afe23fe-0d38-4a0d-b6fe-8bffbd756dd7",
        "word": "address",
        "persian": "پرداختن به یک موضوع،",
        "definition": "\"Address\" has multiple meanings, but in a common context, it refers to the location where someone lives or an organization is based. It's a specific set of details used for identification and delivery of mail or goods. It can also refer to a formal speech or communication.\n\nSynonyms: location, residence, abode; speech, lecture, discourse.\n",
        "exampleA": "The issue of funding has yet to be addressed. /a fundamental problem has still to be addressed",
        "exampleB": "Please address the package to my home.",
        "exampleC": "The CEO will address the company at the meeting.",
        "status": "seen"
    },
    {
        "id": "cd8527a1-a345-40fb-bf63-2c731d4ff930",
        "word": "adequate",
        "persian": "،کافی، به مقدار کافی",
        "definition": "\"Adequate\" means sufficient or satisfactory for a particular purpose. It implies that something meets the minimum requirements or is just good enough to fulfill a need without being outstanding or exceptional. It strikes a balance between being too little and being more than enough.\n\nSynonyms: sufficient, enough, acceptable, suitable, passable.\n",
        "exampleA": "It's not a big salary but it's adequate for our needs.",
        "exampleB": "The food provided was adequate, but not particularly exciting.",
        "exampleC": "Her skills are adequate for the entry-level position.",
        "status": "learned"
    },
    {
        "id": "998624e5-1143-42ec-9ab2-c0bff09fbfc5",
        "word": "adjust",
        "persian": "میزان کردن، تنظیم کردن، مرتب کردن لباس",
        "definition": "To adjust means to adapt or modify something to better suit a new situation or purpose. It involves making changes to bring something into a more favorable or correct alignment. It can refer to both physical changes, like adjusting the volume on a speaker, or more abstract changes, like adjusting your attitude to a new job.\n\nSynonyms: adapt, modify, alter, regulate, accommodate, conform\n",
        "exampleA": "Please adjust the thermostat to a more comfortable temperature.",
        "exampleB": "You may need to adjust your strategy to succeed in this competitive market.",
        "exampleC": "It's important to adjust to new situations and challenges in life.",
        "status": "learned"
    },
    {
        "id": "69004717-bd91-47e0-b474-b3acc7d91f47",
        "word": "advance",
        "persian": "پیش رفتن، پیش بردن",
        "definition": "\"Advance\" generally means to move forward or progress, either physically or figuratively. It implies making headway, improving a position, or developing in some way. It can refer to physical movement, like advancing an army, or abstract progress, like advancing knowledge or a career.\n\nSynonyms: proceed, progress, develop, promote, forward, improve.\n",
        "exampleA": "The army decided to advance despite the heavy enemy fire.",
        "exampleB": "Could I please have my salary advance to cover these unexpected expenses?",
        "exampleC": "Technological advance has revolutionized the way we communicate.",
        "status": "learned"
    },
    {
        "id": "58ad935f-1a2c-4392-a000-22cad0bc49f0",
        "word": "aggravate",
        "persian": "\"Aggravate\" در فارسی میتونه به معنی \"وخیم‌تر کردن\"، \"تشدید کردن\"، \"بدتر کردن\" یا \"تحریک کردن\" باشه. انتخاب بهترین معادل بستگی به context جمله داره.\n",
        "definition": "to make a bad situation or a disease  worse",
        "exampleA": "The treatment only aggravated the condition.",
        "exampleB": "The loud noise will only aggravate his headache.",
        "exampleC": "Ignoring the problem will only aggravate the situation.",
        "status": "seen"
    },
    {
        "id": "b7a7aa24-bf86-42c7-87d5-5ec7c125f806",
        "word": "amend",
        "persian": "\"Amend\" بسته به متن می‌تونه به معانی مختلفی ترجمه بشه، اما رایج‌ترین معادل‌های اون در فارسی عبارتند از: \"اصلاح کردن\"، \"تغییر دادن\"، \"بازنگری کردن\" یا \"اصلاحیه زدن\".\n",
        "definition": "to change the words of a text, especially a law or a legal document",
        "exampleA": "MPs were urged to amend the law to prevent another oil tanker disaster.",
        "exampleB": "Congress can amend the Constitution with a two-thirds vote.",
        "exampleC": "The company decided to amend its policy on remote work.",
        "status": "seen"
    },
    {
        "id": "a35b4793-fdfa-4bce-af31-882793ddc0f5",
        "word": "apparel",
        "persian": "معادل‌های فارسی برای \"apparel\" بسته به بافتار می‌توانند \"پوشاک\"، \"لباس\"، \"جامه\" یا \"تن‌پوش\" باشند. به طور کلی، \"پوشاک\" رایج‌ترین و جامع‌ترین ترجمه است.\n",
        "definition": "clothing",
        "exampleA": "they were dressed in bright apparel",
        "exampleB": "The store sells a wide variety of apparel, from casual wear to formal attire.",
        "exampleC": "The designer showcased their latest apparel collection at fashion week.",
        "status": "seen"
    },
    {
        "id": "4375ce2c-f1ce-40ee-abf6-bba7364815b9",
        "word": "basic",
        "persian": "\"Basic\" بسته به متن می‌تونه به معانی مختلفی ترجمه بشه، اما رایج‌ترین معادل‌ها عبارتند از: پایه، اساسی، ابتدایی، ساده.\n",
        "definition": "\"Basic\" typically refers to something simple, fundamental, or lacking in complexity or originality. It often implies a lack of sophistication or a focus on mainstream trends, sometimes used in a slightly derogatory way to describe someone or something as unoriginal or commonplace.\n\nSynonyms: simple, plain, fundamental, unoriginal, mainstream, commonplace.\n",
        "exampleA": "This is a basic recipe for pasta.",
        "exampleB": "The software has only the most basic features.",
        "exampleC": "He has a basic understanding of the subject.",
        "status": ""
    },
    {
        "id": "d9abc354-8282-488d-bef8-e8fb94beaf1e",
        "word": "benefit",
        "persian": "\"Benefit\" در فارسی می‌تواند به معانی مختلفی ترجمه شود، از جمله: سود، فایده، مزیت، بهره‌مندی، یا کمک‌هزینه. انتخاب دقیق‌ترین معادل بستگی به متن و مفهوم مورد نظر دارد.\n",
        "definition": "\"Benefit\" refers to an advantage or positive result obtained from something. It signifies a gain, improvement, or favorable outcome that enhances well-being, prosperity, or overall circumstances.\n\nSynonyms: Advantage, gain, profit, perk, boon.\n",
        "exampleA": "The new policy will benefit all employees.",
        "exampleB": "One major benefit of exercise is improved cardiovascular health.",
        "exampleC": "We weighed the costs and benefits before making a decision.",
        "status": ""
    },
    {
        "id": "a3753214-5d0e-4fcd-b252-9e565c43e413",
        "word": "booming",
        "persian": "مترقی، پرروتق",
        "definition": "\"Booming\" describes something that is experiencing rapid and significant growth, success, or expansion. It suggests a state of prosperity and high activity.\n\nSynonyms: Flourishing, thriving, expanding, prospering.\n",
        "exampleA": "the booming economy of the 1920s",
        "exampleB": "The city's economy is booming thanks to the influx of tech companies.",
        "exampleC": "Her booming voice echoed through the concert hall.",
        "status": "seen"
    },
    {
        "id": "4d7d971f-2477-4124-b918-60766830cdfc",
        "word": "catastrophic",
        "persian": "فاجعه‌آمیز، مصیبت‌بار یا فاجعه‌بار.\n",
        "definition": "\"Catastrophic\" describes something that involves or causes sudden and widespread damage or suffering; a complete disaster. It signifies a moment or event of immense and destructive proportions with devastating consequences.\n\nSynonyms: disastrous, devastating, calamitous, tragic, ruinous.\n",
        "exampleA": "The earthquake had a catastrophic impact on the city, leaving thousands homeless.",
        "exampleB": "A catastrophic failure in the engine caused the plane to crash.",
        "exampleC": "Ignoring climate change could lead to catastrophic environmental consequences.",
        "status": ""
    },
    {
        "id": "f29698b6-52ea-40fe-9f27-67ba1ccff872",
        "word": "cause",
        "persian": "\"Cause\" بسته به متن می‌تونه معانی مختلفی داشته باشه، اما رایج‌ترین ترجمه‌هاش این‌ها هستن:\n\n   علت\n   دلیل\n   باعث شدن (به عنوان فعل)\n   انگیزه\n   آرمان (در بعضی موارد خاص)\n",
        "definition": "\"Cause\" refers to the reason or motive behind an event, action, or condition. It's the underlying factor that makes something happen or leads to a particular outcome. Identifying the cause is crucial for understanding why things are the way they are and often for preventing or promoting similar outcomes in the future.\n\nSynonyms: reason, source, origin, root, motive.\n",
        "exampleA": "The heavy rain was the cause of the flooding.",
        "exampleB": "We need to identify the root cause of the problem.",
        "exampleC": "He dedicated his life to a worthy cause.",
        "status": ""
    },
    {
        "id": "64519b97-829c-466d-aba7-7f031e79fba2",
        "word": "challenge",
        "persian": "\"Challenge\" بسته به متن می‌تونه به صورت‌های مختلفی ترجمه بشه، اما رایج‌ترین ترجمه‌ها عبارتند از: چالش، مسئله، معضل، یا به مبارزه طلبیدن.\n",
        "definition": "A challenge is a situation presenting difficulty or a test of one's abilities, resources, or strength. It can be an obstacle to overcome, a task to achieve, or an invitation to compete or improve. It often implies an opportunity for growth or development, even in the face of adversity.\n\nSynonyms: difficulty, obstacle, test, problem, trial.\n",
        "exampleA": "The company faces a significant challenge in adapting to the changing market.",
        "exampleB": "Climbing Mount Everest is a physical and mental challenge.",
        "exampleC": "I challenge you to a game of chess.",
        "status": ""
    },
    {
        "id": "1d840235-6d8d-48d0-b049-d9c27d182f08",
        "word": "charity shop",
        "persian": "بازارچه خیریه",
        "definition": "A charity shop is a retail store operated by a charitable organization where donated goods, often clothing, books, and household items, are sold to raise money for the charity's cause. The revenue generated from these sales directly supports the charity's programs and services.\n\nSynonyms: thrift store, opportunity shop, second-hand shop.\n",
        "exampleA": "I found a beautiful vintage dress at the charity shop.",
        "exampleB": "She volunteers at the local charity shop every Saturday.",
        "exampleC": "We donated our unwanted clothes and books to the charity shop.",
        "status": "learned"
    },
    {
        "id": "ebf380e5-b4cd-4d2d-b144-8df0f8ecd2bc",
        "word": "compete",
        "persian": "رقابت کردن، مسابقه دادن، یا تلاش برای پیشی گرفتن از دیگران.\n",
        "definition": "To compete means to strive or struggle against others to achieve a goal, prize, or superior position. It involves actively trying to win or outperform rivals in a contest, game, business, or any other area of endeavor.\nSynonyms: contend, vie, challenge, rival, battle.\n",
        "exampleA": "Several companies compete fiercely in the smartphone market.",
        "exampleB": "The athletes will compete for a gold medal at the Olympics.",
        "exampleC": "Local businesses often struggle to compete with larger corporations.",
        "status": ""
    },
    {
        "id": "9c199654-4c21-4eaa-aee1-d7958f25104f",
        "word": "compound",
        "persian": "\"Compound\" بسته به زمینه می‌تونه معانی مختلفی داشته باشه. رایج‌ترین ترجمه‌ها عبارتند از: \"ترکیب\"، \"مخلوط\"، \"ترکیبی\"، \"مجتمع\" یا \"محوطه\".\n",
        "definition": "A compound is something made up of two or more separate elements or ingredients. It can refer to a substance formed when two or more elements are chemically bonded together, like water (H2O). Alternatively, it can describe something complex created by combining multiple components, such as a compound sentence in grammar.\n\nSynonyms: mixture, combination, blend, composite, complex.\n",
        "exampleA": "Water is a compound made of hydrogen and oxygen.",
        "exampleB": "The chemical compound was unstable and reacted violently.",
        "exampleC": "Interest can compound over time, leading to significant gains.",
        "status": ""
    },
    {
        "id": "5d3e99f4-9006-40f8-835f-33fe0bbd05c0",
        "word": "compromise",
        "persian": "سازش، توافق، مصالحه",
        "definition": "Compromise means reaching an agreement where each party involved gives up something they initially wanted to achieve a mutually acceptable solution. It's a process of negotiation and adjustment where everyone involved makes concessions to find common ground.\n\nSynonyms: settlement, accommodation, agreement, middle ground, trade-off.\n",
        "exampleA": "After a lengthy debate, the committee reached a compromise that satisfied most members.",
        "exampleB": "The couple decided to compromise on their vacation plans by visiting both the beach and the mountains.",
        "exampleC": "Finding a compromise between work and personal life is essential for maintaining a healthy balance.",
        "status": "seen"
    },
    {
        "id": "4fe901b6-944a-4c39-8fe1-3b19f9d882f6",
        "word": "consumerism",
        "persian": "مصرف گرایی",
        "definition": "Consumerism is the theory that an increasing consumption of goods and services is economically desirable, and further, the preoccupation of society with the acquisition of consumer goods. It promotes the belief that personal happiness and well-being depend largely on the level of consumption. In essence, it's the idea that buying more stuff leads to a better life.\n\nSynonyms: materialism, commercialism, affluenza, shopaholism.\n",
        "exampleA": "many people are becoming increasingly conscious of the environmental impact of consumerism",
        "exampleB": "The rampant consumerism during the holiday season puts a strain on many families' budgets.",
        "exampleC": "Environmentalists argue that unchecked consumerism is a major contributor to climate change.",
        "status": "learned"
    },
    {
        "id": "13ade530-6099-4f8f-bbff-025152acff80",
        "word": "consumer society",
        "persian": "جامعه مصرف گرا",
        "definition": "A consumer society is a society where the economy is driven by the consumption of goods and services, and where individuals are strongly encouraged to purchase and accumulate possessions. It's characterized by a focus on material wealth and a cultural emphasis on acquiring the latest products, often fueled by advertising and marketing.\n\nSynonyms: Affluent society, material society, acquisitive society, consumer culture.\n",
        "exampleA": "Our consumer society encourages the constant pursuit of new products.",
        "exampleB": "Critics argue that the consumer society prioritizes materialism over genuine happiness.",
        "exampleC": "Environmental concerns are growing due to the waste generated by our consumer society.",
        "status": "learned"
    },
    {
        "id": "a19fcc28-b0e6-458b-8153-0df610d4f18c",
        "word": "contractor",
        "persian": "پیمان کار",
        "definition": "A contractor is an individual or company hired to perform a specific job or service, typically on a temporary basis. They are often self-employed or work for a contracting company, and unlike employees, they are usually responsible for their own taxes, benefits, and equipment. They operate under a contract outlining the scope of work, payment terms, and project timelines.\n\nSynonyms: freelancer, independent contractor, consultant, vendor, subcontractor.\n",
        "exampleA": "The homeowner hired a contractor to remodel the kitchen.",
        "exampleB": "As a contractor, she sets her own hours and chooses her projects.",
        "exampleC": "The city council awarded the construction contract to the lowest bidding contractor.",
        "status": "learned"
    },
    {
        "id": "52609aae-fb9e-4625-891a-cc14b35e7468",
        "word": "crowded",
        "persian": "شلوغ",
        "definition": "\"Crowded\" describes a space or location filled to capacity, often with people or things, leaving little room for movement or comfort. It implies a feeling of being packed in and possibly overwhelmed by the sheer number of occupants.\n\nSynonyms: packed, congested, overflowing, teeming, jammed\n",
        "exampleA": "The subway car was so crowded that I could barely breathe.",
        "exampleB": "We decided to leave the beach because it was too crowded for us to relax.",
        "exampleC": "The concert venue was extremely crowded, but the energy was amazing.",
        "status": "learned"
    },
    {
        "id": "cb370c3a-251a-4b0d-90b8-6e7c1036372d",
        "word": "deal with",
        "persian": "مقابله کردن با یک مشکل یا موضوع",
        "definition": "\"Deal with\" means to take action to solve a problem, manage a situation, or handle a person. It implies addressing something directly and effectively, often requiring effort and strategy.\n\nSynonyms: handle, manage, address, cope with, tackle.\n",
        "exampleA": "you’ll have to find a way of dealing with those feelings",
        "exampleB": "The company had to deal with a major PR crisis after the product recall.",
        "exampleC": "I'll deal with the paperwork later; I need to focus on this meeting now.",
        "status": "learned"
    },
    {
        "id": "d1a319ae-34a6-4b22-8923-514493106752",
        "word": "decent",
        "persian": "آبرومند، مناسب و معقول",
        "definition": "\"Decent\" generally refers to something that is acceptable, satisfactory, or respectable in quality or character. It implies a standard that is adequate but not necessarily exceptional. It suggests propriety, fairness, and a lack of offensive or immoral behavior.\n\nSynonyms: acceptable, respectable, adequate, suitable, appropriate, honorable.\n",
        "exampleA": "The majority of residents here are decent citizens./ a decent salary",
        "exampleB": "He earned a decent salary at his new job.",
        "exampleC": "The movie wasn't great, but it was decent.",
        "status": "seen"
    },
    {
        "id": "63c89336-69cd-43be-b2b0-143b2b929ea2",
        "word": "deteriorate",
        "persian": ",وخیم تر کردن، بدتر کردن",
        "definition": "\"Deteriorate\" means to become progressively worse or to decline in quality, condition, or value. It implies a gradual process of decay or degeneration.\n\nSynonyms: worsen, decline, degrade, degenerate, decay.\n",
        "exampleA": "The political situation in the region has deteriorated rapidly.",
        "exampleB": "The old house began to deteriorate after years of neglect.",
        "exampleC": "His health started to deteriorate rapidly after the diagnosis.",
        "status": "seen"
    },
    {
        "id": "0afd1bb5-87a3-4ea3-a40e-738e3c0d1382",
        "word": "developing",
        "persian": "\"Developing\" بسته بهContext می‌تونه به صورت‌های مختلفی ترجمه بشه، اما رایج‌ترین معادل‌ها عبارتند از:\n\n   در حال توسعه: برای اشاره به یک فرآیند یا پروژه که در حال پیشرفت است.\n   توسعه‌یابنده: برای اشاره به فرد یا چیزی که در حال توسعه چیزی است.\n   در حال رشد: برای اشاره به یک موجود زنده یا یک بازار که در حال بزرگ شدن است.\n   در حال تکامل: برای اشاره به یک ایده یا نظریه که در حال تغییر و بهبود است.\n",
        "definition": "\"Developing\" implies a process of growth, progress, or evolution from one stage to another, typically towards improvement or maturity. It suggests a gradual and ongoing change, often involving the addition of new features, capabilities, or complexity.\n\nSynonyms: evolving, advancing, growing, maturing, unfolding\n",
        "exampleA": "The city is developing a new public transportation system.",
        "exampleB": "She is developing a strong interest in photography.",
        "exampleC": "They are developing a new software application.",
        "status": ""
    },
    {
        "id": "1a5d1535-5a7c-434b-ae3f-a7c3a238ba30",
        "word": "difficulty",
        "persian": "\"Difficulty\" بسته به متن می‌تونه به صورت‌های مختلفی ترجمه بشه، اما رایج‌ترین معادل‌ها عبارتند از: \"مشکل\"، \"دشواری\"، \"سختی\" و \"مانع\".\n",
        "definition": "he fact of not being easy to do or understand, a problem",
        "exampleA": "People with asthma have difficulty in breathing.",
        "exampleB": "The student had some difficulty understanding the complex equation.",
        "exampleC": "We experienced considerable difficulty in obtaining the necessary permits.",
        "status": "learned"
    },
    {
        "id": "7ba3e1eb-b759-4a6b-b157-9926dc3f1769",
        "word": "dilemma",
        "persian": "معضل",
        "definition": "A dilemma is a situation where a difficult choice has to be made between two or more options, often undesirable ones. It implies a predicament where there's no clear or easy solution, leaving the decision-maker conflicted and facing potentially negative consequences regardless of the chosen path.\n\nSynonyms: predicament, quandary, plight, catch-22, impasse.\n",
        "exampleA": "The president is clearly in a dilemma about/over how to tackle the crisis.",
        "exampleB": "He faced a difficult dilemma: stay in a job he hated or risk starting his own business.",
        "exampleC": "The ethical dilemma of choosing between two patients, both in critical condition, weighed heavily on the doctor.",
        "status": "seen"
    },
    {
        "id": "406194e0-b222-45b1-8279-0054eb535f49",
        "word": "double-edged",
        "persian": "\"دولبه\"، \"دوپهلو\"، یا \"تیغ دولبه\" معادل‌های مناسبی برای این عبارت هستند و بسته به زمینه می‌توان از آن‌ها استفاده کرد. این اصطلاح معمولاً به چیزی اشاره دارد که هم جنبه‌های مثبت دارد و هم جنبه‌های منفی.\n",
        "definition": "\"Double-edged\" describes something that appears to be good or beneficial on the surface but also carries significant risks or negative consequences. It implies a duality where a seemingly positive aspect is intrinsically linked to a negative one, meaning the potential benefit comes at a certain cost or risk.\n\nSynonyms: ambivalent, two-sided, having mixed blessings, a double-edged sword.\n",
        "exampleA": "Her sharp wit was double-edged; it could be both hilarious and hurtful.",
        "exampleB": "The new policy was double-edged, offering increased security but also limiting personal freedoms.",
        "exampleC": "Fame is often double-edged, bringing adulation and scrutiny in equal measure.",
        "status": ""
    },
    {
        "id": "95befa6e-11c6-4265-acf2-1c6b7262ab74",
        "word": "double-edged comment",
        "persian": "نظر دوپهلو",
        "definition": "A double-edged comment is a statement that seems positive or complimentary on the surface, but simultaneously contains a negative or critical implication. It can be interpreted in two conflicting ways, often depending on the context and the recipient's perception. The speaker might intend the positive interpretation, but the potential for a negative reading always exists, making it a risky and potentially hurtful way to communicate.\n\nSynonyms: backhanded compliment, left-handed compliment, two-edged sword, ambivalent remark.\n",
        "exampleA": "Her \"compliment\" about my cooking skills felt like a double-edged comment, leaving me unsure if she genuinely liked it or was subtly criticizing my abilities.",
        "exampleB": "The manager's feedback was a double-edged comment; while he praised my initiative, he also implied I was overstepping my boundaries.",
        "exampleC": "Saying someone looks 'young for their age' can be a double-edged comment, as it might also suggest they're acting immaturely.",
        "status": "learned"
    },
    {
        "id": "da2f5dca-6569-4312-8496-3a56dda9447e",
        "word": "double-edged sword",
        "persian": "تیغ دولبه",
        "definition": "A double-edged sword is something that appears beneficial but also carries significant risks or negative consequences. It refers to a situation, decision, or object that has both advantages and disadvantages, and the disadvantages can be as pronounced or more pronounced than the advantages. Using it requires careful consideration of both potential positive and negative outcomes.\n\nSynonyms: two-edged sword, double-edged, double-faced, a mixed blessing, a trade-off.\n",
        "exampleA": "Being famous is often a double-edged sword.",
        "exampleB": "Social media can be a double-edged sword, connecting people globally but also fostering negativity and misinformation.",
        "exampleC": "His ambition was a double-edged sword, driving him to success but also causing him immense stress.",
        "status": "learned"
    },
    {
        "id": "e40fcd72-059a-480a-a7b5-a2e9870db7e5",
        "word": "employment",
        "persian": "استخدام، وضعیت اشتغال",
        "definition": "Employment refers to the state of having a paid job or occupation, typically involving regular work for an employer. It signifies being engaged in an activity for which one receives compensation, contributing to the economy, and often developing skills and experience.\n\nSynonyms: work, occupation, job, career, livelihood, profession.\n",
        "exampleA": "The company offers excellent opportunities for employment.",
        "exampleB": "She is seeking employment in the field of education.",
        "exampleC": "His previous employment was at a local grocery store.",
        "status": "learned"
    },
    {
        "id": "bda1cb9d-bab4-40fa-a114-c3580ce737c2",
        "word": "enhance",
        "persian": "ارتقا دادن، بهبود دادن",
        "definition": "\"Enhance\" means to improve the quality, value, or extent of something. It suggests making something better than it already is, often by adding to it or refining it.\n\nSynonyms: Improve, augment, boost, enrich, strengthen.\n",
        "exampleA": "These scandals will not enhance the organization's reputation.",
        "exampleB": "The new software update will enhance the user experience.",
        "exampleC": "Regular exercise can enhance your overall health and well-being.",
        "status": "learned"
    },
    {
        "id": "f57d17e4-8b1e-46e6-983f-fa5085411236",
        "word": "eventually",
        "persian": "بالاخره",
        "definition": "\"Eventually\" means at some later time; in the end or after a long delay. It implies that something is going to happen, but not immediately. It emphasizes the process and the passage of time leading to the final outcome.\n\nSynonyms: Ultimately, finally, in the end, sooner or later.\n",
        "exampleA": "Eventually, the rain stopped and the sun came out.",
        "exampleB": "She studied hard and eventually achieved her goal of becoming a doctor.",
        "exampleC": "If we keep polluting the planet, eventually there will be dire consequences.",
        "status": "learned"
    },
    {
        "id": "15bfb4dc-add0-48a1-bd45-8668ed43790e",
        "word": "exacerbate",
        "persian": "تشدید کردن، بدتر کردن",
        "definition": "To exacerbate something means to make it worse, more severe, or more intense. It implies that a situation, problem, or negative feeling is already present, and something is done (often unintentionally) that aggravates it.\n\nSynonyms: Worsen, aggravate, intensify, inflame, heighten.\n",
        "exampleA": "rising inflation was exacerbated by the collapse of oil prices",
        "exampleB": "The rising tensions only exacerbate the conflict between the two countries.",
        "exampleC": "His smoking habit will only exacerbate his already severe respiratory problems.",
        "status": "seen"
    },
    {
        "id": "2f2a396c-a1e6-4e8b-8f46-29931696954c",
        "word": "exclude",
        "persian": "\"Exclude\" بسته به متن می‌تونه به معانی مختلفی ترجمه بشه، اما رایج‌ترین معادل‌ها عبارتند از: \"حذف کردن\"، \"مستثنی کردن\"، \"خارج کردن\"، یا \"در نظر نگرفتن\".\n",
        "definition": "\"Exclude\" means to prevent someone or something from entering a place, being included in a group, or participating in an activity. It signifies a deliberate act of leaving someone or something out.\nSynonyms: omit, reject, ban, eliminate, preclude\n",
        "exampleA": "The club rules explicitly exclude members who have been convicted of a felony.",
        "exampleB": "We will exclude the lowest grade from the final calculation.",
        "exampleC": "Please exclude me from any further email correspondence regarding this matter.",
        "status": ""
    },
    {
        "id": "e6db3e88-b2bf-40ed-991a-fdcee6d5899d",
        "word": "exclude (from sth)",
        "persian": "راه ندادن، مستثنی کردن، در نظر نگرفتن",
        "definition": "To exclude someone or something from something means to prevent them from participating in or being included in that activity, group, or place. It implies a deliberate act of barring or leaving out.\n\nSynonyms: omit, bar, ban, shut out, leave out, reject.\n",
        "exampleA": "The new regulations exclude small businesses from the tax break.",
        "exampleB": "He was excluded from the team due to his poor attendance.",
        "exampleC": "Please exclude my name from the list of invitees.",
        "status": "seen"
    },
    {
        "id": "1c02778a-c230-45f5-bd19-2b0a4031807b",
        "word": "face",
        "persian": "مواجه شدن با",
        "definition": "The \"face\" is the front part of the head, from the forehead to the chin, containing the eyes, nose, mouth, and cheeks. It's the primary area for expressing emotions and for individual identification.\n Synonyms: Visage, Countenance, Features, Mug\n",
        "exampleA": "You're faced with a very difficult choice there.",
        "exampleB": "She had a smile on her face that lit up the room.",
        "exampleC": "He had to face his fears in order to succeed.",
        "status": "learned"
    },
    {
        "id": "8ef19596-30ce-42f0-96b8-6703a3893a31",
        "word": "fertilizer",
        "persian": "کود",
        "definition": "Fertilizer is any natural or synthetic substance added to soil to supply one or more plant nutrients essential for plant growth. It helps to supplement the existing nutrients in the soil, promoting healthier and more productive plants by providing them with the necessary building blocks for development.\nSynonyms: plant food, soil enrichment, nutrient supplement, manure.\n",
        "exampleA": "The farmer spread fertilizer on the fields to increase crop yield.",
        "exampleB": "Overuse of fertilizer can lead to water pollution.",
        "exampleC": "This organic fertilizer is made from composted plant matter.",
        "status": "seen"
    },
    {
        "id": "c37c69b8-cff3-44c1-a23c-639879c8b84a",
        "word": "find a solution",
        "persian": "راه حل پیدا کردن",
        "definition": "To \"find a solution\" means to discover or create a way to resolve a problem, difficulty, or unanswered question. It implies identifying a course of action or a set of actions that will lead to a desired outcome or eliminate an obstacle.\n\nSynonyms: resolve, figure out, work out, solve, crack, answer\n",
        "exampleA": "The team worked tirelessly to find a solution to the complex problem.",
        "exampleB": "We need to find a solution that is both effective and affordable.",
        "exampleC": "The company is committed to helping customers find a solution to their technical issues.",
        "status": "learned"
    },
    {
        "id": "a885b7ea-9739-407e-874b-543c2baeeb54",
        "word": "flourish",
        "persian": "«Flourish» بسته به متن، می‌تونه به معانی مختلفی ترجمه بشه، اما در حالت کلی و رایج‌ترین معانی، می‌تونیم از کلمات زیر استفاده کنیم:\n\n   رونق یافتن\n   شکوفا شدن\n   بالیدن\n   پیشرفت کردن\n   رشد کردن\n",
        "definition": "to develop well and be successful [= thrive]",
        "exampleA": "Watercolour painting began to flourish in Britain around 1750.",
        "exampleB": "The arts began to flourish during the Renaissance.",
        "exampleC": "The writer's career began to flourish after the publication of her first novel.",
        "status": "learned"
    },
    {
        "id": "6d0f5de1-8961-4b7b-a598-38a04827c1db",
        "word": "household cast-offs",
        "persian": "دور ریزهای خانگی",
        "definition": "\"Household cast-offs\" refers to unwanted or discarded items from a home, typically things that are no longer needed, used, or considered valuable by the residents. These items are often thrown away, donated, or sold.\n\nSynonyms: discards, refuse, junk, trash, waste, unwanted belongings.\n",
        "exampleA": "The charity shop gladly accepted our household cast-offs.",
        "exampleB": "We held a garage sale to get rid of our household cast-offs.",
        "exampleC": "Her art project was made entirely from household cast-offs.",
        "status": "seen"
    },
    {
        "id": "58cb1080-961b-4270-b8fc-bed67730344e",
        "word": "identify",
        "persian": "شناسایی کردن",
        "definition": "To identify something means to recognize or establish what it is, who someone is, or where something belongs. It involves discerning its key characteristics or features to distinguish it from others. It also means figuring out what it is or what it is supposed to be.\n\nSynonyms: recognize, pinpoint, determine, discover, detect, diagnose.\n",
        "exampleA": "Can you identify the bird in that tree?",
        "exampleB": "The police were able to identify the suspect using DNA evidence.",
        "exampleC": "It's important to identify your strengths and weaknesses.",
        "status": "learned"
    },
    {
        "id": "94303550-f252-4343-830a-733fe31478a2",
        "word": "improve",
        "persian": "بهبود بخشیدن، ارتقا دادن، بهتر کردن، و توسعه دادن.\n",
        "definition": "To improve means to make something better, more desirable, or of a higher quality. It involves enhancing existing features, fixing flaws, or adding new elements to achieve a superior state or outcome. Essentially, it's about taking something from where it is to a more advantageous position.\n\nSynonyms: enhance, refine, ameliorate, upgrade.\n",
        "exampleA": "Regular exercise can significantly improve your overall health.",
        "exampleB": "The company is implementing new strategies to improve customer satisfaction.",
        "exampleC": "He attended a workshop to improve his public speaking skills.",
        "status": ""
    },
    {
        "id": "d53ddd30-873a-4ff1-9923-dc66ec63f0c9",
        "word": "include",
        "persian": "بسته به متن، «include» می‌تونه معانی مختلفی داشته باشه، اما به طور کلی می‌شه اون رو به این صورت‌ها ترجمه کرد:\n   شامل شدن/بودن\n   در بر گرفتن\n   اضافه کردن\n   وارد کردن\n   گنجاندن\n",
        "definition": "\"Include\" means to contain something as a part of a whole, or to allow something to be considered or dealt with as belonging to a larger group. It suggests bringing something into a set or category that already exists.\n\nSynonyms: comprise, incorporate, encompass, involve, contain.\n",
        "exampleA": "Please include all relevant documents in your application.",
        "exampleB": "The price will include all taxes and fees.",
        "exampleC": "We need to include more diversity in our recruitment efforts.",
        "status": ""
    },
    {
        "id": "54ceb590-50a5-44e1-afdc-62b483de20a5",
        "word": "industrialisation",
        "persian": "صنعتی شدن",
        "definition": "Industrialisation refers to the process by which an economy is transformed from primarily agricultural to one based on the manufacturing of goods, using advanced technology and large-scale production methods. It typically involves the development of factories, the growth of cities, and increased reliance on machinery.\n\nSynonyms: manufacturing expansion, economic development, mechanization, modernization.\n",
        "exampleA": "The rapid industrialisation of the country led to significant economic growth.",
        "exampleB": "Environmental concerns are often raised in the context of unchecked industrialisation.",
        "exampleC": "Industrialisation brought about major changes in social structures and urban landscapes.",
        "status": "learned"
    },
    {
        "id": "beb33349-f19d-48d6-a320-2ef4ab45b728",
        "word": "infrastructure",
        "persian": "زیرساخت",
        "definition": "Infrastructure refers to the basic physical and organizational structures and facilities needed for the operation of a society or enterprise. This includes essential services and systems like transportation networks (roads, bridges, railways), communication systems (telecommunications, internet), power grids, water and waste management systems, and public institutions (schools, hospitals). Essentially, it's the foundation upon which a community or organization functions and thrives.\n\nSynonyms: framework, foundation, groundwork, underpinning, support system\n",
        "exampleA": "The war has badly damaged the country's infrastructure.",
        "exampleB": "The city invested heavily in its transportation infrastructure to improve commutes.",
        "exampleC": "Reliable internet infrastructure is crucial for modern businesses to thrive.",
        "status": "learned"
    },
    {
        "id": "f5a4c2e5-da5e-4494-92ba-b2290d4507c4",
        "word": "inhabitant",
        "persian": "«ساکن» یا «اهل» بهترین معادل‌های فارسی برای کلمه inhabitant هستند. بسته به بافت جمله، می‌توان از کلماتی مانند «باشنده» یا «مقیم» هم استفاده کرد.\n",
        "definition": "An inhabitant is a person or animal that lives in a particular place, such as a city, country, or building. It simply denotes someone or something that dwells or resides within a specific location.\n\nSynonyms: resident, dweller, occupant, denizen.\n",
        "exampleA": "The island is home to a diverse group of inhabitants.",
        "exampleB": "As a long-time inhabitant of the city, she had seen many changes.",
        "exampleC": "Every inhabitant of the building was required to evacuate during the fire drill.",
        "status": ""
    },
    {
        "id": "6f11befa-360c-445e-9728-09ee6446897a",
        "word": "isolated",
        "persian": "\"منزوی\"، \"جدا افتاده\" یا \"تک افتاده\"\n",
        "definition": "\"Isolated\" means being separated or set apart from others, either physically, emotionally, or socially. It implies a lack of connection, support, or interaction, often leading to feelings of loneliness or detachment.\n    \nSynonyms: alone, secluded, detached, solitary, alienated.\n",
        "exampleA": "The remote cabin felt isolated from the rest of the world.",
        "exampleB": "She felt isolated and alone after moving to a new city.",
        "exampleC": "The island is geographically isolated, leading to unique species.",
        "status": ""
    },
    {
        "id": "4c1382d2-769f-49b1-bcaa-03d448827f45",
        "word": "isolation",
        "persian": "\"Isolation\" در فارسی می‌تواند به «انزوا»، «جداسازی»، «گوشه‌گیری» یا «ایزوله شدن» ترجمه شود. انتخاب دقیق‌ترین معادل بستگی بهContext  جمله دارد.\n",
        "definition": "Isolation refers to the state of being separated or set apart from others. It can be physical, emotional, or social, involving a lack of connection, interaction, or support from other people. This separation can be voluntary or involuntary, leading to feelings of loneliness, detachment, and sometimes even negative mental and physical health outcomes.\n\nSynonyms: solitude, segregation, quarantine, detachment, seclusion.\n",
        "exampleA": "The long period of isolation took a toll on her mental health.",
        "exampleB": "The remote island offered a unique sense of isolation from the modern world.",
        "exampleC": "We need to combat the social isolation experienced by many elderly people.",
        "status": ""
    },
    {
        "id": "d7d7db71-95a9-45d5-8774-7f027c8ed36b",
        "word": "issue",
        "persian": "\"Issue\" بسته به متن می‌تونه معانی مختلفی داشته باشه. رایج‌ترین ترجمه‌ها عبارتند از: \"مسئله\"، \"موضوع\"، \"مشکل\"، \"شماره (مجله یا روزنامه)\" و \"بحث\".\n",
        "definition": "\"Issue\" refers to a point or matter of discussion, dispute, or concern that requires attention, action, or resolution. It can also describe something that has been published, like a magazine or journal. Essentially, it's a focal point that needs to be addressed.\n\nSynonyms: problem, matter, concern, topic, subject, point.\n",
        "exampleA": "We need to address the issue of rising inflation.",
        "exampleB": "The software update fixed a critical security issue.",
        "exampleC": "I have an issue with the proposed changes to the project.",
        "status": ""
    },
    {
        "id": "6730e32a-7008-4efe-bcc8-bd652982ac36",
        "word": "linger",
        "persian": "باقی ماندن، ماندن",
        "definition": "To linger means to stay in a place or remain present longer than necessary or expected, often due to a desire to prolong a pleasant experience or hesitation to leave. It implies a gentle, unhurried continuation.\n\nSynonyms: remain, tarry, delay, dawdle, loiter.\n",
        "exampleA": "The scent of her perfume seemed to linger in the air long after she left.",
        "exampleB": "We decided to linger a little longer at the cafe, enjoying the warm afternoon sun.",
        "exampleC": "Doubts about the decision continued to linger in his mind.",
        "status": "seen"
    },
    {
        "id": "5b083668-00af-470d-ad29-a2190ef7f7e6",
        "word": "long-sighted",
        "persian": "\"Long-sighted\" در فارسی معمولاً به \"دوربین\" یا \"دوردید\" ترجمه می‌شود.\n",
        "definition": "Long-sightedness, also known as hyperopia or hypermetropia, is a common vision condition where distant objects are seen clearly, but nearby objects appear blurry. This occurs because the eye focuses light behind the retina instead of directly on it. People with long-sightedness may experience eye strain, headaches, and difficulty concentrating, particularly when doing close-up work.\n\nSynonyms: hyperopia, hypermetropia, far-sightedness.\n",
        "exampleA": "My grandfather is long-sighted and needs glasses to read.",
        "exampleB": "The company took a long-sighted approach to investing in renewable energy.",
        "exampleC": "Being long-sighted, she could easily spot distant objects.",
        "status": ""
    },
    {
        "id": "a2fb80f1-8eaf-4bd5-b8c7-e8f28a360fec",
        "word": "long-term",
        "persian": "\"درازمدت\"، \"بلندمدت\" یا \"طولانی‌مدت\"\n",
        "definition": "\"Long-term\" refers to something that extends over a considerable period, typically several years or more, and is not expected to change or end quickly. It implies a lasting commitment, investment, or impact that unfolds gradually over time. Synonyms include: enduring, prolonged, sustained, lasting, and protracted.\n",
        "exampleA": "Investing in renewable energy is a smart long-term strategy.",
        "exampleB": "The company is focused on building long-term relationships with its clients.",
        "exampleC": "She has a long-term plan to travel the world after retirement.",
        "status": ""
    },
    {
        "id": "18220d00-1af0-426d-8e2f-e4a00cde74ff",
        "word": "marginal reward",
        "persian": "پاداش اندک",
        "definition": "Marginal reward refers to the additional benefit or satisfaction gained from consuming or producing one more unit of a good or service. It is essentially the increment of reward received for each incremental increase in activity. The concept is central to understanding decision-making under scarcity, where individuals weigh the marginal reward against the marginal cost.\n\nSynonyms: incremental reward, additional utility, extra benefit, marginal return.\n",
        "exampleA": "The executive questioned whether the marginal reward of pursuing the lawsuit justified the significant legal costs.",
        "exampleB": "After working late every night for a month, the employee felt the marginal reward wasn't worth the burnout.",
        "exampleC": "The company decided to discontinue the project because the marginal reward of continuing was minimal compared to the potential risks.",
        "status": "seen"
    },
    {
        "id": "8f9505eb-3974-4ac6-9169-5ec597be6c2a",
        "word": "megacity",
        "persian": "کلان شهر",
        "definition": "A megacity is a very large urban area, typically one with a population of over 10 million people. These sprawling metropolitan areas are characterized by high population density, extensive infrastructure, complex economies, and often significant social and environmental challenges.\n\nSynonyms: metropolis, conurbation, urban agglomeration, megalopolis.\n",
        "exampleA": "Tokyo is a sprawling megacity with a vibrant cultural scene.",
        "exampleB": "The challenges of managing resources in a megacity like Mumbai are immense.",
        "exampleC": "Rapid urbanization has led to the emergence of more and more megacities around the world.",
        "status": "learned"
    },
    {
        "id": "99639844-fd1b-40ac-aa86-5fee4067feb0",
        "word": "migrant",
        "persian": "مهاجر",
        "definition": "A migrant is a person who moves from one place to another, especially in order to find work or better living conditions. This movement can be within a country (internal migration) or across international borders (international migration). The decision to migrate is often driven by factors such as economic opportunity, political instability, or environmental changes.\n\nSynonyms: emigrant, immigrant, mover, transient.\n",
        "exampleA": "The cities are full of migrants looking for work.",
        "exampleB": "The city is struggling to provide adequate housing for the influx of migrants.",
        "exampleC": "Many migrants send remittances home to support their families.",
        "status": "seen"
    },
    {
        "id": "9dc05ce4-ca5e-42ba-bcda-bf18d9bd84c5",
        "word": "modify",
        "persian": "اصلاح کردن، تغییر و بهبود دادن",
        "definition": "To modify something means to make changes to it, usually to improve it, adapt it to a new purpose, or alter its form or function. It implies a deliberate and controlled adjustment rather than a complete replacement.\n\nSynonyms: adjust, alter, amend, change, revise, adapt.\n",
        "exampleA": "Please modify the document to reflect the latest changes.",
        "exampleB": "You may need to modify the program's settings to get the desired output.",
        "exampleC": "Can you modify the recipe to be vegetarian?",
        "status": "learned"
    },
    {
        "id": "0f820cea-de3c-496a-bcd4-6040623e11d6",
        "word": "notorious",
        "persian": "بدنام، بدسابقه",
        "definition": "\"Notorious\" describes someone or something widely and unfavorably known, typically for a negative reason like bad behavior or scandal. It implies a level of public awareness or infamy stemming from those negative actions or qualities.\n\nSynonyms: infamous, scandalous, disreputable, ill-famed.\n",
        "exampleA": "The company is notorious for paying its bills late",
        "exampleB": "The pirate Blackbeard was notorious for his cruelty and daring raids.",
        "exampleC": "The neighborhood is notorious for its high crime rate.",
        "status": "seen"
    },
    {
        "id": "2414e50c-a965-45ab-9cc0-5a3ccbb17812",
        "word": "obstacle",
        "persian": "مانع و مشکل",
        "definition": "An obstacle is something that blocks your path or prevents you from achieving a goal. It's a challenge or hurdle that you need to overcome in order to progress or succeed. Obstacles can be physical, like a mountain range, or abstract, like a lack of resources or a difficult problem.\n\nSynonyms: barrier, impediment, hurdle, roadblock, hindrance.\n",
        "exampleA": "Lack of funding proved to be a significant obstacle to the project's completion.",
        "exampleB": "She overcame every obstacle in her path with determination and grace.",
        "exampleC": "The language barrier was a major obstacle when traveling in a foreign country.",
        "status": "seen"
    },
    {
        "id": "ca9cb74b-1c66-4217-9d05-6982495cbd3c",
        "word": "one-sided",
        "persian": "یک طرفه ، مغرضانه",
        "definition": "\"One-sided\" describes something that presents only one perspective or viewpoint, lacking balance or fairness. It suggests a bias where only one side of an issue, argument, or story is considered or presented, often to the exclusion or detriment of other viewpoints.\nSynonyms: biased, partial, unfair, prejudiced, skewed, lopsided.\n",
        "exampleA": "a one-sided contest/game/ The conversation was very one-sided.",
        "exampleB": "The argument felt one-sided, as I didn't have a chance to voice my opinion.",
        "exampleC": "The documentary presented a one-sided view of the historical event, neglecting other perspectives.",
        "status": "seen"
    },
    {
        "id": "91ca4ceb-5542-4318-b3c5-4782d400dd80",
        "word": "overcome",
        "persian": "\"غلبه کردن\"، \"پیروز شدن\"، \"فائق آمدن\" یا \"پشت سر گذاشتن\" معادل‌های مناسبی برای \"overcome\" هستند و بسته به بافت جمله می‌توان از آن‌ها استفاده کرد.\n",
        "definition": "To overcome something means to successfully deal with or defeat a difficulty, obstacle, or challenge. It implies a struggle and ultimately achieving victory or mastery over the thing that was holding you back.\n\nSynonyms: conquer, prevail, surmount, defeat, triumph.\n",
        "exampleA": "She had to overcome many obstacles to achieve her goals.",
        "exampleB": "They worked together to overcome the challenges they faced.",
        "exampleC": "With determination, he was able to overcome his fear of public speaking.",
        "status": ""
    },
    {
        "id": "ea131f25-dfc5-4a2a-8092-6ac360d9940b",
        "word": "overcome a difficulty",
        "persian": "بر مشکل غلبه کردن",
        "definition": "To overcome a difficulty means to successfully deal with and resolve a challenging problem or obstacle. It implies pushing through adversity, finding solutions, and ultimately achieving a desired outcome despite the initial hindrance.\n\nSynonyms: conquer, surmount, prevail over, triumph over, get over.\n",
        "exampleA": "Through perseverance, she was able to overcome a difficulty and achieve her goals.",
        "exampleB": "The team worked together to overcome a difficulty in the project's timeline.",
        "exampleC": "Learning a new language can help you overcome a difficulty communicating in foreign countries.",
        "status": "learned"
    },
    {
        "id": "1435dc9a-1fa7-4e53-9627-dc83b866afaf",
        "word": "overpopulation",
        "persian": "ازدیاد جمعیت",
        "definition": "Overpopulation refers to a situation where the number of individuals of a species exceeds the carrying capacity of their environment, meaning the environment cannot sustainably provide enough resources like food, water, and shelter to support everyone. This leads to resource depletion, environmental degradation, increased competition, and potentially a decline in the population's health and well-being.\n\nSynonyms: overcrowding, population explosion, overabundance, superpopulation\n",
        "exampleA": "Overpopulation is one of the country's most pressing social problems.",
        "exampleB": "Overpopulation can lead to increased strain on resources like water and food.",
        "exampleC": "Many scientists believe that addressing overpopulation is crucial for environmental sustainability.",
        "status": "learned"
    },
    {
        "id": "e5716c30-eae3-4010-a0e1-edda7de8fff2",
        "word": "overpriced",
        "persian": "«گران‌تر از ارزش واقعی» یا «بیش از حد گران» معادل‌های مناسبی برای این عبارت هستند.\n",
        "definition": "too expensive",
        "exampleA": "These shoes are very nice, but they're terribly overpriced.",
        "exampleB": "The food was good, but definitely overpriced for the portion sizes.",
        "exampleC": "I refuse to buy that designer handbag; it's completely overpriced.",
        "status": "learned"
    },
    {
        "id": "38acae2b-d889-4684-9a6a-cec3477abf6e",
        "word": "overworked",
        "persian": "\"Overworked\" در فارسی معمولاً به صورت «بیش از حد کار کردن»، «کار کشیدن زیاد»، «فشار کاری بالا» یا «زیر فشار کار زیاد» ترجمه می‌شود. بسته به متن، می‌توان از معادل‌های دیگری مانند «کار فرسا» یا «از رمق افتاده» نیز استفاده کرد.\n",
        "definition": "having to work too much",
        "exampleA": "They're overworked and understaffed.",
        "exampleB": "The nurses were incredibly overworked and exhausted after dealing with the pandemic.",
        "exampleC": "He felt overworked and underappreciated in his current role, leading him to seek a new job.",
        "status": "learned"
    },
    {
        "id": "5beb60db-7e79-4c78-b7e3-4a9b88b415b3",
        "word": "pawnbroker",
        "persian": "معادل دقیق \"pawnbroker\" در فارسی «نزول‌خور» یا «رهن‌دهنده» است، اما امروزه بیشتر از عبارت «صاحبِ رهن» یا «محل رهن و امانت» برای اشاره به این شغل یا مکان استفاده می‌شود.\n",
        "definition": "a person who lends money at interest on the security of an article pawned.",
        "exampleA": "Desperate for cash, he took his grandfather's watch to the pawnbroker.",
        "exampleB": "The pawnbroker examined the ring carefully, assessing its value before offering a loan.",
        "exampleC": "She hoped to redeem her necklace from the pawnbroker before her birthday.",
        "status": "seen"
    },
    {
        "id": "d55c9c1f-4b2a-4a4b-bacd-4b262938d6af",
        "word": "population",
        "persian": "\"Population\" در فارسی معمولاً به صورت \"جمعیت\" ترجمه می‌شود.\n",
        "definition": "\"Population\" refers to the entire group of individuals, objects, or events that are of interest in a particular study or area. It's the complete set from which a sample might be drawn, or the entire group being analyzed or discussed.\n\nSynonyms: inhabitants, community, populace, citizenry.\n",
        "exampleA": "The city's population has grown rapidly in recent years.",
        "exampleB": "Conservation efforts are crucial for maintaining the wild animal population.",
        "exampleC": "A large percentage of the population lacks access to clean water.",
        "status": ""
    },
    {
        "id": "7506eacd-f925-46c1-8767-6502d19246a9",
        "word": "poverty",
        "persian": "فقر",
        "definition": "Poverty refers to the state of lacking sufficient financial resources and essential material possessions or access to necessities like food, shelter, clean water, healthcare, and education to maintain a minimum standard of living. It's a complex issue encompassing economic, social, and political dimensions, leading to hardship and limited opportunities for individuals and communities.\n\nSynonyms: destitution, indigence, penury, impoverishment, deprivation\n",
        "exampleA": "Poverty can limit access to education and healthcare.",
        "exampleB": "The organization works to alleviate poverty in rural communities.",
        "exampleC": "Rising inflation can push more families into poverty.",
        "status": "learned"
    },
    {
        "id": "86108958-1eba-4ae5-894a-e9cd9619872f",
        "word": "present",
        "persian": "کلمه \"present\" بسته به context معانی مختلفی می‌تواند داشته باشد. رایج‌ترین معانی آن عبارتند از:\n\n   حاضر: وقتی که به حضور فیزیکی یا وضعیت فعلی اشاره دارد.\n   هدیه: وقتی که به چیزی اشاره دارد که به کسی داده می‌شود.\n   حال: وقتی که به زمان حال اشاره دارد.\n   ارائه: وقتی که به ارائه یک ایده یا اطلاعات اشاره دارد.",
        "definition": "\"Present\" can refer to the current time or era, as opposed to the past or future. It signifies something that exists or is happening now. It can also mean to be in a specific place or to introduce something.\nSynonyms: current, existing, now, today, contemporary, gift.\n",
        "exampleA": "I need to present my findings to the board next week.",
        "exampleB": "She received a lovely present for her birthday.",
        "exampleC": "The actor had a charismatic present on stage.",
        "status": ""
    },
    {
        "id": "64ab2559-46f1-449f-9c92-3b1f3a9d0480",
        "word": "pressing",
        "persian": "مبرم، عاجل",
        "definition": "\"Pressing\" describes something that is urgent, crucial, or requiring immediate attention. It implies a situation or matter that cannot be delayed without serious consequences.\n\nSynonyms: Urgent, critical, imperative, exigent, crucial.\n",
        "exampleA": "a pressing need for housing./The most pressing question is what do we do next?",
        "exampleB": "The need for clean water in the refugee camp is a pressing issue that requires immediate attention.",
        "exampleC": "He had a pressing engagement and couldn't stay for the entire meeting.",
        "status": "seen"
    },
    {
        "id": "11b8ba15-4444-4811-8f68-9c4a580bb267",
        "word": "progress",
        "persian": "پیشرفت کردن",
        "definition": "\"Progress\" signifies movement towards a desired goal or a state of improvement. It embodies advancement, development, and positive change, indicating a shift from a less favorable condition to a more desirable one. It can refer to personal growth, societal development, or technological advancement.\n\nSynonyms: advancement, development, improvement, growth, headway.\n",
        "exampleA": "The construction crew has made significant progress on the new bridge.",
        "exampleB": "My doctor is pleased with my progress since starting the new medication.",
        "exampleC": "We are monitoring the students' progress closely throughout the semester.",
        "status": "seen"
    },
    {
        "id": "4676a07a-0294-4718-bf40-efacf314abd9",
        "word": "rag",
        "persian": "پارچه کهنه، لباس کهنه",
        "definition": "A \"rag\" can refer to a worthless piece of cloth, often old and torn. It can also describe a newspaper or magazine, especially one considered of low quality or sensationalist. Figuratively, \"rag\" can also refer to someone dressed in tattered or disreputable clothing.\n\nSynonyms: cloth, tatter, tabloid, scandal sheet\n",
        "exampleA": "I keep these rags for cleaning the car.",
        "exampleB": "She used an old rag to clean the spilled milk.",
        "exampleC": "The newspaper article was more of a political rag than a source of reliable information.",
        "status": "seen"
    },
    {
        "id": "bf6b52e4-bf75-4fc6-ad7e-1d623e3006a8",
        "word": "raise",
        "persian": "معنی \"raise\" بسته به جمله می‌تونه متفاوت باشه، اما رایج‌ترین معادل‌هاش این‌ها هستن:\n\n   بلند کردن: (مثلاً بلند کردن یک جسم)\n   افزایش دادن: (مثلاً افزایش حقوق)\n   مطرح کردن: (مثلاً مطرح کردن یک سوال)\n   پرورش دادن: (مثلاً پرورش دادن کودک)\n   جمع‌آوری کردن: (مثلاً جمع‌آوری پول)\n",
        "definition": "\"Raise\" generally means to lift something to a higher position, increase in amount or level, or bring something into being. It implies an upward or developmental movement.\n\nSynonyms: elevate, increase, nurture, rear, boost.\n",
        "exampleA": "The company decided to raise salaries to retain employees.",
        "exampleB": "Could you please raise the window a little?",
        "exampleC": "I had to raise my voice to be heard in the noisy room.",
        "status": ""
    },
    {
        "id": "16c2fc82-4276-4745-bc2f-57e150bf3fe0",
        "word": "raw material",
        "persian": "ماده خام",
        "definition": "Raw materials are basic substances in their natural or unprocessed state, used as inputs to produce finished goods or other intermediate products. They are the fundamental ingredients from which manufactured items are created.\nSynonyms: feedstock, primary commodity, basic material, input material.\n",
        "exampleA": "The factory needs more raw material to continue production.",
        "exampleB": "Wood pulp is the primary raw material for paper manufacturing.",
        "exampleC": "Investing in sustainable sources of raw material is crucial for long-term business success.",
        "status": "learned"
    },
    {
        "id": "912cc366-e7c6-4ce7-bb85-d027b654abd8",
        "word": "reach a compromise",
        "persian": "به مصالحه دست یافتن",
        "definition": "To reach a compromise means to come to an agreement where each party involved gives up something they initially wanted in order to find a mutually acceptable solution. It involves negotiation, concession, and a willingness to meet in the middle, rather than insisting on getting everything one's own way.\n\nSynonyms: meet halfway, find common ground, settle, make a deal, strike an agreement.\n",
        "exampleA": "After hours of negotiation, the union and management were able to reach a compromise on salary increases.",
        "exampleB": "The warring factions decided to reach a compromise in order to avoid further bloodshed.",
        "exampleC": "To reach a compromise, both sides had to be willing to concede some of their demands.",
        "status": "seen"
    },
    {
        "id": "85a706cf-21f9-4681-ba47-79c7f3badb6f",
        "word": "reach (find) a compromise",
        "persian": "به یک سازش رسیدن/دست یافتن.\n",
        "definition": "To reach a compromise means to find a mutually acceptable agreement where each party involved makes concessions to accommodate the others' interests. It involves negotiation and a willingness to give up some individual desires or demands to achieve a resolution that is satisfactory to everyone, even if it's not a perfect outcome for any single party.\n\nSynonyms: reach an agreement, settle, meet halfway, find common ground.\n",
        "exampleA": "After hours of debate, the committee was finally able to reach (find) a compromise on the budget.",
        "exampleB": "Both sides were unwilling to budge, making it difficult to reach (find) a compromise.",
        "exampleC": "To avoid a strike, the union and management had to reach (find) a compromise that addressed the workers' concerns.",
        "status": ""
    },
    {
        "id": "ca0be532-f829-446d-b083-7a37787b0b30",
        "word": "reform",
        "persian": "\"اصلاح\" یا \"بهبود\"\n",
        "definition": "to make an improvement, especially by changing a person's behaviour or the structure of something",
        "exampleA": "The government is planning to reform the healthcare system.",
        "exampleB": "The prison reform movement aims to rehabilitate offenders.",
        "exampleC": "He vowed to reform his behavior after the incident.",
        "status": "seen"
    },
    {
        "id": "e50dc390-ff52-4e84-bc7b-6400a9ecfb09",
        "word": "regulate",
        "persian": "تنظیم کردن، وضع کردن",
        "definition": "To regulate means to control or maintain something according to a set of rules or guidelines, ensuring proper functioning or order. It involves adjusting or governing activities, processes, or systems to achieve a desired outcome or standard.\n\nSynonyms: control, manage, govern, adjust, direct.\n",
        "exampleA": "The government needs to regulate the use of pesticides to protect the environment.",
        "exampleB": "Our company must regulate its spending to stay within budget.",
        "exampleC": "The human body has mechanisms to regulate its temperature.",
        "status": "seen"
    },
    {
        "id": "4062939d-e187-41a5-8afa-251a015523c9",
        "word": "remedy",
        "persian": "درست کردن، حل کردن",
        "definition": "A remedy is a means of counteracting or eliminating something undesirable, like a disease, problem, or wrong. It's essentially a cure, solution, or corrective measure designed to improve a situation.\n\nSynonyms: cure, solution, fix, treatment, antidote, panacea.\n",
        "exampleA": "The doctor prescribed a remedy for my persistent cough.",
        "exampleB": "Meditation can be a helpful remedy for stress.",
        "exampleC": "There is no easy remedy to solve the problem.",
        "status": "learned"
    },
    {
        "id": "33c71bcc-38a7-4755-ad66-2a19abbd1d21",
        "word": "remedy a situation",
        "persian": "درست کردن وضعیت",
        "definition": "To remedy a situation means to correct, improve, or fix a problem or undesirable condition. It implies taking action to alleviate or resolve something that is wrong or needs fixing.\n\nSynonyms: rectify, resolve, amend, correct, fix, improve, alleviate.\n",
        "exampleA": "The company took swift action to remedy a situation that threatened its reputation.",
        "exampleB": "Mediation was used to remedy a situation where communication had completely broken down.",
        "exampleC": "Additional resources were allocated to remedy a situation that was hindering project progress.",
        "status": "learned"
    },
    {
        "id": "01c737e1-6360-4837-9f7f-a82c778b698d",
        "word": "resolution",
        "persian": "رفع و حل مشکل، مصوبه",
        "definition": "\"Resolution\" refers to a firm decision to do or not to do something, or the quality of being determined and unwavering in pursuit of a goal. It embodies a commitment to a specific course of action, often involving overcoming obstacles or resisting temptations.\n\nSynonyms: determination, resolve, intention, commitment, purpose\n",
        "exampleA": "a successful resolution to the crisis",
        "exampleB": "The city council passed a resolution supporting the new environmental regulations.",
        "exampleC": "The photograph's resolution was too low to see the details clearly.",
        "status": "learned"
    },
    {
        "id": "1c00f2e6-4c87-4ae3-a44a-1276e8f929e7",
        "word": "resolve",
        "persian": "رفع کردن، حل کردن مشکل",
        "definition": "\"Resolve\" signifies a firm decision to do something or to find a solution to a problem. It implies determination, commitment, and a strong will to overcome obstacles and achieve a desired outcome. It can also mean to settle or clarify something that is unclear or disputed.\n\nSynonyms: determination, decisiveness, resolve, solve, settle, figure out.\n",
        "exampleA": "The committee met to resolve the dispute between the two departments.",
        "exampleB": "I need to resolve this issue with my bank account as soon as possible.",
        "exampleC": "She was determined to resolve her personal problems before starting a new job.",
        "status": "learned"
    },
    {
        "id": "ffe577e8-e88e-4a7d-b063-fe81c3fcde4a",
        "word": "resolve an issue",
        "persian": "رفع کردن مساله",
        "definition": "To \"resolve an issue\" means to find a solution or settlement that effectively deals with a problem, difficulty, or dispute, bringing it to a satisfactory conclusion. It implies taking action to understand the issue, identify potential solutions, and implement a course of action that eliminates or mitigates the problem.\n\nSynonyms: solve, fix, address, settle, rectify, remedy.\n",
        "exampleA": "The customer service representative was able to resolve the issue quickly and efficiently.",
        "exampleB": "We need to meet as a team to resolve the issue before it escalates further.",
        "exampleC": "The software update is expected to resolve an issue that caused intermittent system crashes.",
        "status": "learned"
    },
    {
        "id": "8f93dc30-34a6-489c-844f-8b680cfba061",
        "word": "rural",
        "persian": "\"روستایی\" یا \"دهاتی\" بهترین ترجمه برای کلمه \"rural\" هستند.\n",
        "definition": "\"Rural\" refers to geographic areas located outside of towns and cities, typically characterized by open land, agricultural activities, and lower population densities. It often implies a slower pace of life, a close connection to nature, and a strong sense of community, though resources and amenities can be limited compared to urban areas.\n\nSynonyms: rustic, pastoral, country, agricultural, bucolic\n",
        "exampleA": "The rural landscape was dotted with farms and small villages.",
        "exampleB": "Many people are moving from urban centers to rural areas seeking a quieter lifestyle.",
        "exampleC": "Access to healthcare can be limited in some rural communities.",
        "status": ""
    },
    {
        "id": "d40e697c-cfdc-4e8b-af57-86be13c3d482",
        "word": "Second-hand clothing",
        "persian": "پوشاک دسته دوم",
        "definition": "Second-hand clothing refers to clothing that has been previously owned and used by someone else. It is often resold, donated, or recycled, offering a more sustainable and affordable alternative to buying new clothes. Buying or wearing second-hand clothing can reduce textile waste and the environmental impact associated with manufacturing new garments.\n\nSynonyms: Used clothing, pre-owned clothing, vintage clothing, thrift store finds, consignment clothing.\n",
        "exampleA": "She loves finding unique pieces in second-hand clothing stores.",
        "exampleB": "Buying second-hand clothing is a great way to be more sustainable.",
        "exampleC": "The charity shop had a large selection of second-hand clothing for all ages.",
        "status": "learned"
    },
    {
        "id": "c38abfc2-c1ac-4aa2-a94b-50b8eaddcab3",
        "word": "setback",
        "persian": "وقفه، پیشامد، مشکل",
        "definition": "A setback is a temporary halt or reversal in progress, a minor difficulty that delays or prevents the achievement of a goal. It signifies a step backward, a disappointment, or an obstacle that hinders forward momentum.\n\nSynonyms: reversal, hurdle, hiccup, impediment, difficulty.\n",
        "exampleA": "There has been a slight/temporary setback in our plans.",
        "exampleB": "The team faced a significant setback when their star player was injured.",
        "exampleC": "Despite the initial setback, the project is now back on track.",
        "status": "seen"
    },
    {
        "id": "cedae0b9-65b9-4f8a-9898-109c84a37e7c",
        "word": "sewage disposal",
        "persian": "دفع فاضلاب",
        "definition": "Sewage disposal refers to the process of collecting, treating, and safely removing wastewater and excrement (sewage) from homes, businesses, and industries. This is crucial for public health and environmental protection, preventing the spread of diseases and contamination of water sources.\n\nSynonyms: wastewater treatment, effluent disposal, sanitation, waste management.\n",
        "exampleA": "The city is investing in a new system for sewage disposal.",
        "exampleB": "Improper sewage disposal can lead to serious health problems.",
        "exampleC": "Environmental regulations require improved methods of sewage disposal.",
        "status": "seen"
    },
    {
        "id": "a6c64caf-2466-49da-9bec-e7bf9755e04f",
        "word": "sewerage",
        "persian": "شبکه جمع اوری فاضلاب",
        "definition": "Sewerage refers to the system of drains, pipes, and structures used to collect and carry sewage or wastewater from homes, businesses, and other sources to treatment facilities or disposal points. It encompasses the physical infrastructure necessary for the safe and hygienic removal of liquid waste from a community, preventing the spread of disease and environmental contamination.\n\nSynonyms: drainage, sanitation, waste disposal system, sewage system.\n",
        "exampleA": "The city is investing heavily in upgrading its sewerage system.",
        "exampleB": "Poor sewerage infrastructure can lead to significant public health problems.",
        "exampleC": "The smell emanating from the nearby treatment plant was due to a problem with the sewerage processing.",
        "status": "seen"
    },
    {
        "id": "06f81a0f-d463-4e5b-b443-b573163be258",
        "word": "short-sighted",
        "persian": "کوتاه‌بین، نزدیک‌بین، یا سطحی‌نگر. انتخاب بهترین معادل بستگی به بافت جمله دارد.\n",
        "definition": "\"Short-sighted\" describes a lack of foresight or planning, focusing primarily on immediate concerns and failing to consider the long-term consequences of actions or decisions. It implies a narrow perspective that prioritizes short-term gains over future risks or opportunities.\n\nSynonyms: myopic, imprudent, shortsighted, near-sighted, unthinking.\n",
        "exampleA": "The company's short-sighted focus on immediate profits led to long-term losses.",
        "exampleB": "His short-sighted decision to drop out of school haunted him for years.",
        "exampleC": "We need leaders with vision, not short-sighted politicians worried only about the next election.",
        "status": ""
    },
    {
        "id": "517b44fe-80ce-4c40-a671-99d66588d425",
        "word": "short-term",
        "persian": "کوتاه مدت\n",
        "definition": "\"Short-term\" refers to something that lasts for a brief period, usually weeks, months, or up to a year. It's often used in contrast to \"long-term\" and implies a focus on immediate goals or results rather than sustained or enduring effects.\n\nSynonyms: temporary, transient, brief, immediate, provisional.\n",
        "exampleA": "The company is focused on short-term profits, which may hurt its long-term growth.",
        "exampleB": "We need a short-term solution to address the immediate crisis.",
        "exampleC": "The loan has a short-term repayment plan of only six months.",
        "status": ""
    },
    {
        "id": "755bfc4a-e2a4-40ba-bcb4-4d0344df3417",
        "word": "slum",
        "persian": "محلات پر جمعیت وپست شهر",
        "definition": "A slum is a densely populated urban area characterized by substandard housing, poverty, and often, a lack of basic services like clean water, sanitation, and electricity. It's a place where people live in overcrowded and dilapidated conditions, often facing social problems like crime, unemployment, and health issues.\n\nSynonyms: shantytown, favela, ghetto, squatter settlement.\n",
        "exampleA": "The city's rapid growth led to the expansion of the slum areas.",
        "exampleB": "She grew up in a slum, but she never let her surroundings define her.",
        "exampleC": "Efforts are underway to improve living conditions in the slum and provide residents with better opportunities.",
        "status": "seen"
    },
    {
        "id": "0976ac73-ecf3-4de8-8b06-fce5d896ce00",
        "word": "solution",
        "persian": "راه حل",
        "definition": "A solution is a means of solving a problem or dealing with a difficult situation. It represents a way to overcome an obstacle and achieve a desired outcome. It can be a plan, a method, or an answer that effectively addresses the issue at hand.\n\nSynonyms: answer, resolution, fix, remedy.\n",
        "exampleA": "The solution to the puzzle eluded her for days.",
        "exampleB": "A change in policy is not always the best solution.",
        "exampleC": "We need to find a solution that benefits everyone involved.",
        "status": "learned"
    },
    {
        "id": "0bb492c2-60ad-4e99-ad67-141175ec6022",
        "word": "staggering",
        "persian": "سرسام آور",
        "definition": "\"Staggering\" describes something that is astonishing, overwhelming, or shocking due to its size, impact, or nature. It suggests a feeling of being taken aback or almost incapacitated by the enormity or unexpectedness of something.\n\nSynonyms: astounding, breathtaking, overwhelming, shocking, astonishing, unbelievable\n",
        "exampleA": "The cost was a staggering $10 million./ The financial impact on the town was staggering.",
        "exampleB": "The cost of the project was staggering, exceeding all initial estimates.",
        "exampleC": "She achieved a staggering victory, winning by a landslide.",
        "status": "seen"
    },
    {
        "id": "13e26deb-8bfe-4e31-a948-322fdb3bdba0",
        "word": "tackle",
        "persian": "از عهده مشکلی برآمدن",
        "definition": "\"Tackle\" generally means to confront or deal with a difficult problem, task, or opponent head-on with the intention of overcoming it. It implies a direct and often energetic approach to something challenging.\n\nSynonyms: address, handle, confront, grapple with, take on.\n",
        "exampleA": "There are many ways of tackling this problem./ I tackled him about his careless work.",
        "exampleB": "The linebacker's job is to tackle the running back before he reaches the end zone.",
        "exampleC": "We need to tackle the issue of climate change before it's too late.",
        "status": "seen"
    },
    {
        "id": "48223acf-f310-47d8-a506-e99ab3fd5d79",
        "word": "take responsibility",
        "persian": "مسؤولیت پذبرفتن",
        "definition": "To \"take responsibility\" means to accept accountability for one's actions, decisions, and their consequences, both positive and negative. It involves acknowledging your role in a situation and being willing to be held accountable for the outcome, rather than shifting blame or avoiding consequences.\n\nSynonyms: own up, be accountable, face the music, accept blame.\n",
        "exampleA": "It's time to take responsibility for your actions and apologize.",
        "exampleB": "The manager decided to take responsibility for the team's failure.",
        "exampleC": "We must all take responsibility for protecting the environment.",
        "status": "learned"
    },
    {
        "id": "81e09e32-664a-49f5-a26b-be03d9ae1b4c",
        "word": "to face the fact",
        "persian": "با حقیقت مواجه شدن",
        "definition": "\"To face the fact\" means to acknowledge and accept something, often unpleasant or difficult, as true and undeniable. It implies confronting reality directly and ceasing to deny or ignore it.\n\nSynonyms: Accept the truth, come to terms with, acknowledge, confront reality, own up to.\n",
        "exampleA": "She needed to face the fact that her relationship was over.",
        "exampleB": "It was hard, but he had to face the fact that he wasn't going to win.",
        "exampleC": "To move forward, they must face the fact that mistakes were made.",
        "status": "learned"
    },
    {
        "id": "8c876698-4332-4e1b-a9d8-d2db5ce06a6d",
        "word": "tolerance",
        "persian": "\"Tolerance\" بسته به متن می‌تونه به «مدارا»، «بردباری»، «تحمل» یا «رواداری» ترجمه بشه.\n",
        "definition": "Tolerance is the ability or willingness to accept the existence of opinions or behavior that one dislikes or disagrees with. It involves recognizing and respecting the rights and beliefs of others, even when they are different from your own. It is essential for creating a harmonious and inclusive society where diverse perspectives can coexist peacefully.\n\nSynonyms: acceptance, forbearance, open-mindedness, patience, understanding.\n",
        "exampleA": "Tolerance of different viewpoints is crucial for a healthy democracy.",
        "exampleB": "The patient showed good tolerance to the medication, with no adverse side effects.",
        "exampleC": "Building a society based on tolerance and understanding is essential for lasting peace.",
        "status": ""
    },
    {
        "id": "e108ae57-b376-4201-9095-d4888173e424",
        "word": "tolerance (towards/ to sth)",
        "persian": "مدارا، قدرت تحمل نسبت به بیماری",
        "definition": "Tolerance towards something signifies the ability or willingness to accept, endure, or respect differences or things one might normally dislike or disapprove of. It involves putting up with behaviors, beliefs, opinions, or practices that are divergent from one's own, even if they are perceived as negative or unwanted.\nSynonyms: Acceptance, forbearance, patience, open-mindedness, understanding.\n",
        "exampleA": "tolerance towards religious minorities./ Many old people have a very limited tolerance to cold.",
        "exampleB": "Her tolerance towards spicy food increased over time.",
        "exampleC": "The community showed great tolerance to the refugees' difficult circumstances.",
        "status": "learned"
    },
    {
        "id": "43761ecd-6f68-4791-b4de-54fb27359f26",
        "word": "tolerant",
        "persian": "\"tolerant\" در فارسی می‌تواند به \"بردبار\"، \"شکیبا\"، \"مدارا کننده\" یا \"با تساهل\" ترجمه شود. انتخاب دقیق‌ترین واژه بستگی به زمینه جمله دارد.\n",
        "definition": "\"Tolerant\" means showing acceptance of or patience with differing opinions, behaviors, or beliefs, even when one might disagree with them. It implies a willingness to coexist peacefully and respectfully with individuals or groups who hold different views or practice different lifestyles.\n\nSynonyms: accepting, patient, understanding, liberal, open-minded.\n",
        "exampleA": "She was incredibly tolerant of his eccentric habits.",
        "exampleB": "A tolerant society values diversity and respect for different viewpoints.",
        "exampleC": "The teacher was tolerant of the students' mistakes, using them as learning opportunities.",
        "status": ""
    },
    {
        "id": "dbba8d72-9b42-45a8-989e-8123fc321c80",
        "word": "tolerate",
        "persian": "معنی tolerate در فارسی بسته به متن می‌تونه «تحمل کردن»، «تاب آوردن»، «مدارا کردن» یا «چشم‌پوشی کردن» باشه.\n",
        "definition": "To tolerate means to allow something to happen or exist even though you do not like it or agree with it. It implies enduring or putting up with something unpleasant, annoying, or difficult without active opposition.\n\nSynonyms: endure, bear, stand, put up with, stomach, brook, abide.\n",
        "exampleA": "I cannot tolerate his rude behavior any longer.",
        "exampleB": "Many people tolerate the long commute to work because they love their jobs.",
        "exampleC": "The plant can tolerate a wide range of soil conditions.",
        "status": ""
    },
    {
        "id": "1819f801-5175-4912-9bf8-9be7a3a13e4a",
        "word": "traffic",
        "persian": "بسته به متن، \"traffic\" می‌تونه به معانی مختلفی ترجمه بشه. رایج‌ترین معادل‌ها عبارتند از:\n\n   ترافیک: این کلمه به صورت مستقیم از انگلیسی وارد فارسی شده و برای اشاره به حجم رفت و آمد وسایل نقلیه استفاده می‌شه.\n   رفت و آمد: این عبارت عمومی‌تره و می‌تونه برای اشاره به حرکت افراد، وسایل نقلیه یا حتی داده‌ها استفاده بشه.\n   عبور و مرور: این عبارت رسمی‌تر از \"رفت و آمد\" است و معمولاً در تابلوها و اعلانات استفاده می‌شه.\n   حجم: وقتی منظور میزان استفاده از یک مسیر یا شبکه (مثل اینترنت) باشه.\n",
        "definition": "\"Traffic\" generally refers to the movement of people, vehicles, or data along a specific route or through a particular network. It describes the volume or flow of these entities and often implies potential congestion or delays when the volume is high.\n\nSynonyms: flow, movement, congestion, passage, transit.\n",
        "exampleA": "The morning traffic was especially heavy today, causing delays for many commuters.",
        "exampleB": "We need to find a solution to reduce traffic congestion in the downtown area.",
        "exampleC": "The loud traffic noise made it difficult to concentrate on my work.",
        "status": ""
    },
    {
        "id": "4e3bf6e0-2919-46c8-b420-e98b06903eae",
        "word": "transform",
        "persian": "دگرگون کردن، تبدیل کردن",
        "definition": "\"Transform\" means to change something completely, often improving its appearance, form, character, or condition. It implies a significant and fundamental alteration, moving beyond simple adjustments.\n\nSynonyms: convert, metamorphose, revolutionize, transmute.\n",
        "exampleA": "The caterpillar will transform into a butterfly.",
        "exampleB": "Modern technology can transform our lives in many ways.",
        "exampleC": "The artist used digital tools to transform the photograph into a painting.",
        "status": "learned"
    },
    {
        "id": "2300ac76-48a9-4f6f-bbc6-0c08fa3f3c7d",
        "word": "urbanisation",
        "persian": "\"شهرنشینی\" یا \"توسعه شهری\" بهترین معادل‌ها برای واژه \"urbanisation\" در فارسی هستند.\n",
        "definition": "Urbanisation refers to the increasing proportion of a population living in urban areas (cities and towns) rather than rural areas. It's a process that involves both rural-to-urban migration and natural population growth within urban centers, leading to the expansion of cities and the adoption of urban lifestyles.\n\nSynonyms: City growth, urban sprawl, urban development, metropolitanisation.\n",
        "exampleA": "Rapid urbanisation has led to increased pressure on infrastructure.",
        "exampleB": "Sustainable urbanisation requires careful planning and resource management.",
        "exampleC": "The challenges of urbanisation include pollution, poverty, and inequality.",
        "status": ""
    },
    {
        "id": "0394c76d-754e-4917-b726-040544df6cba",
        "word": "waste disposal",
        "persian": "دفع زباله",
        "definition": "Waste disposal refers to the process of collecting, processing, and eliminating unwanted materials and byproducts generated by human activities. It encompasses a range of methods aimed at managing waste in a way that minimizes environmental impact and protects public health.\n\nSynonyms: garbage disposal, refuse removal, waste management, trash disposal.\n",
        "exampleA": "The city implemented a new system for waste disposal to reduce landfill waste.",
        "exampleB": "Improper waste disposal can lead to environmental pollution and health hazards.",
        "exampleC": "Our company is committed to sustainable waste disposal practices.",
        "status": "seen"
    },
    {
        "id": "f03a72dc-527f-48ce-af07-148cf77f17f5",
        "word": "worsen",
        "persian": "بدتر کردن، بدتر جلوه دادن",
        "definition": "\"Worsen\" means to become or make something become worse; to deteriorate or decline in quality, condition, or severity. It suggests a negative change from a previous state.\nSynonyms: deteriorate, exacerbate, aggravate, decline, degenerate.\n",
        "exampleA": "The heavy rain will likely worsen the flooding in low-lying areas.",
        "exampleB": "His health began to worsen after the surgery.",
        "exampleC": "Ignoring the problem will only worsen the situation.",
        "status": "seen"
    }
]