[
    {
        "id": "c7610cdf-5e61-4947-a94a-149a5d8768d0",
        "word": "achievable",
        "persian": "قابل دستیابی",
        "definition": "\"Achievable\" means something that can be successfully accomplished or attained. It describes a goal, task, or objective that is realistic and within the realm of possibility, given the available resources, skills, and time. It implies that with effort and planning, the desired outcome can be reached.\n\nSynonyms: attainable, feasible, possible, realistic, doable.\n",
        "exampleA": "Setting achievable goals is crucial for maintaining motivation.",
        "exampleB": "The project's success hinges on whether the deadlines are achievable.",
        "exampleC": "While ambitious, the plan is ultimately achievable with sufficient resources.",
        "status": "learned"
    },
    {
        "id": "844f1f81-585b-4e21-b41a-a123ada56463",
        "word": "acid rain",
        "persian": "باران اسیدی",
        "definition": "Acid rain is precipitation that is unusually acidic, meaning it possesses elevated levels of hydrogen ions. This occurs when pollutants like sulfur dioxide and nitrogen oxides, released primarily from burning fossil fuels, react with water, oxygen, and other chemicals in the atmosphere to form sulfuric and nitric acids. These acids then fall to the earth as rain, snow, fog, or dry deposition, harming ecosystems, buildings, and human health.\n\nSynonyms: Acid deposition, acidic precipitation, polluted rain.\n",
        "exampleA": "Acid rain damages forests and aquatic ecosystems.",
        "exampleB": "The burning of fossil fuels is a major contributor to acid rain.",
        "exampleC": "International agreements aim to reduce emissions that cause acid rain.",
        "status": "learned"
    },
    {
        "id": "bc02e850-c0db-47b7-a285-e988706f093f",
        "word": "advantageous",
        "persian": "مفید",
        "definition": "\"Advantageous\" describes something that is favorable, beneficial, or provides a positive outcome or edge. It suggests that the thing being described offers a benefit or puts someone in a more desirable or successful position compared to others or a previous state.\n\nSynonyms: beneficial, favorable, profitable, useful, helpful.\n",
        "exampleA": "The new tax laws are advantageous to small businesses.",
        "exampleB": "Having a mentor can be advantageous when starting a new career.",
        "exampleC": "Investing in renewable energy is not only environmentally responsible but also financially advantageous.",
        "status": "learned"
    },
    {
        "id": "357940ea-653e-49e0-92ea-ea943a3b369b",
        "word": "at risk",
        "persian": "در خطر",
        "definition": "\"At risk\" signifies a state of vulnerability or potential danger, indicating that someone or something is susceptible to harm, damage, or failure. It implies a higher probability of experiencing negative outcomes compared to others in a similar situation.\n\nSynonyms: endangered, threatened, vulnerable, susceptible, in jeopardy.\n",
        "exampleA": "The endangered species is at risk of extinction.",
        "exampleB": "Children living in poverty are at risk of falling behind in school.",
        "exampleC": "The old building is at risk of collapse due to structural damage.",
        "status": "learned"
    },
    {
        "id": "0134d7c3-a87d-4697-91be-ef0d7880d0e3",
        "word": "be in danger of sth",
        "persian": "در معرض خطر چیزی بودن",
        "definition": "\"To be in danger of something\" means there's a significant possibility that something bad or undesirable will happen to someone or something. It indicates a state of risk or vulnerability to a specific negative outcome.\n\nSynonyms: at risk of, liable to, exposed to, vulnerable to, prone to.\n",
        "exampleA": "The company is in danger of losing its market share if it doesn't innovate.",
        "exampleB": "The old building is in danger of collapsing due to neglect.",
        "exampleC": "He is in danger of failing his exams if he doesn't start studying.",
        "status": "learned"
    },
    {
        "id": "94fb3905-527f-4b85-967d-a064734f0168",
        "word": "beneficial",
        "persian": "\"Beneficial\" در فارسی می‌تواند به صورت‌های «سودمند»، «مفید»، «به نفع» یا «سودآور» ترجمه شود که انتخاب بهترین گزینه بستگی به متن و کاربرد آن دارد.\n",
        "definition": "\"Beneficial\" means producing good results or effects; it describes something that is advantageous or helpful. It implies that something is likely to improve a situation or lead to a positive outcome.\nSynonyms: advantageous, helpful, favorable, useful, profitable.\n",
        "exampleA": "Regular exercise is beneficial for both physical and mental health.",
        "exampleB": "The new policy changes will be beneficial to the company's overall growth.",
        "exampleC": "A good night's sleep can be beneficial in improving concentration and focus.",
        "status": ""
    },
    {
        "id": "44c300a3-bca8-461d-acc9-0c48ee7a316c",
        "word": "be under threat from sth",
        "persian": "در معرض تهدید بودن",
        "definition": "\"Be under threat from something\" means to be in a situation where something poses a risk of harm, danger, or negative consequences. It suggests vulnerability and the potential for something bad to happen due to an external force or condition.\n\nSynonyms: be endangered by, be at risk from, be imperiled by, be jeopardized by, be threatened by.\n",
        "exampleA": "The coral reefs are under threat from rising ocean temperatures.",
        "exampleB": "The local economy is under threat from the closure of the factory.",
        "exampleC": "The endangered species is under threat from habitat loss and poaching.",
        "status": "learned"
    },
    {
        "id": "f87029c0-456a-413b-b750-7ab07c3ba622",
        "word": "biodiversity",
        "persian": "تنوع زیستی",
        "definition": "Biodiversity refers to the variety of life on Earth at all its levels, from genes to ecosystems, and the ecological and evolutionary processes that sustain it. It encompasses the different species of plants, animals, fungi, and even microorganisms, as well as the diverse habitats they inhabit and the interactions between them. Essentially, it's the richness and complexity of the natural world.\n\nSynonyms: biological diversity, variety of life, species richness, ecological diversity.\n",
        "exampleA": "The Amazon rainforest is renowned for its incredible biodiversity.",
        "exampleB": "Protecting biodiversity is crucial for maintaining healthy ecosystems.",
        "exampleC": "Loss of habitat is a major threat to global biodiversity.",
        "status": "learned"
    },
    {
        "id": "3c54aa88-5386-4f49-83ac-f6c4858d2f64",
        "word": "chronic",
        "persian": "مزمن، پایدار، یا طولانی‌مدت.\n",
        "definition": "\"Chronic\" describes a condition or problem that is persistent, long-lasting, and recurring. It typically implies a situation that is difficult to eradicate or cure and continues over a long period of time.\n\nSynonyms: Persistent, Long-term, Enduring, Incurable, Habitual.\n",
        "exampleA": "She suffered from chronic back pain for years.",
        "exampleB": "The city's chronic unemployment problem requires innovative solutions.",
        "exampleC": "He developed a chronic cough after years of smoking.",
        "status": ""
    },
    {
        "id": "334121a7-52de-421d-849d-f8f32e24d0fd",
        "word": "climate change",
        "persian": "تغییرات آب و هوایی\n",
        "definition": "Climate change refers to long-term shifts in temperatures and weather patterns, primarily driven by human activities, especially the burning of fossil fuels, which release greenhouse gases into the atmosphere. These gases trap heat, causing the Earth's average temperature to rise, leading to a wide range of effects including rising sea levels, more frequent and intense heatwaves, changes in precipitation patterns, and disruptions to ecosystems.\n\nSynonyms: global warming, climate crisis, environmental change.\n",
        "exampleA": "Scientists overwhelmingly agree that climate change is primarily caused by human activities.",
        "exampleB": "The impacts of climate change, such as rising sea levels and extreme weather events, are becoming increasingly evident.",
        "exampleC": "Addressing climate change requires global cooperation and a transition to sustainable energy sources.",
        "status": ""
    },
    {
        "id": "5a95c3fa-bb21-4813-b926-73415a69eb22",
        "word": "conceivable",
        "persian": "ممکن و قابل تصور",
        "definition": "\"Conceivable\" means capable of being imagined or grasped mentally; possible to believe or understand. It suggests something is within the realm of possibility, even if it is not necessarily probable or likely.\n\nSynonyms: imaginable, thinkable, possible, believable, plausible\n",
        "exampleA": "It is conceivable that the weather will improve by tomorrow.",
        "exampleB": "The project's success is conceivable, but it will require a lot of hard work.",
        "exampleC": "No conceivable explanation could justify his actions.",
        "status": "seen"
    },
    {
        "id": "dc39a08b-d01a-40aa-9f84-3a6057a1a590",
        "word": "conflict",
        "persian": "مغایرت داشتن، برخورد (دعوا) کردن",
        "definition": "Conflict refers to a serious disagreement or argument, typically involving a perceived or actual incompatibility of goals, interests, or values. It can manifest in various forms, from interpersonal disputes to large-scale wars, and involves tension, opposition, and often a struggle for power or resources.\n\nSynonyms: dispute, strife, discord, clash, contention.\n",
        "exampleA": "The ongoing conflict between the two nations has displaced thousands of people.",
        "exampleB": "His internal conflict stemmed from choosing between his career and his family.",
        "exampleC": "The novel explores the conflict between tradition and modernity in a small town.",
        "status": "learned"
    },
    {
        "id": "99ec7050-8e03-4506-a958-089501dcb8d3",
        "word": "confront",
        "persian": "\"Confront\" بسته به متن می‌تونه معانی مختلفی داشته باشه، اما رایج‌ترین ترجمه‌هاش این‌ها هستن: \"مواجه شدن\"، \"روبرو شدن\"، \"مقابله کردن\"، \"برخورد کردن\" یا \"درگیر شدن\".\n",
        "definition": "To confront means to face something, someone, or a situation directly and often assertively, typically dealing with a challenge, problem, or opponent head-on. It implies a willingness to engage with something difficult or unpleasant rather than avoiding it.\n\nSynonyms: challenge, oppose, face, address, tackle, encounter.\n",
        "exampleA": "I needed to confront my fear of public speaking.",
        "exampleB": "The police decided to confront the suspect at his home.",
        "exampleC": "She chose to confront him about his rude behavior.",
        "status": ""
    },
    {
        "id": "db042591-1888-4b93-9bac-7e56b72bcf2f",
        "word": "confront (sth, be confronted with sth)",
        "persian": "روبرو شدن با",
        "definition": "To confront something or be confronted with something means to face it directly and deal with it, often when it's challenging, unpleasant, or problematic. It implies acknowledging and addressing a difficult situation, person, or issue rather than avoiding it.\n\nSynonyms: face, encounter, address, tackle, deal with.\n",
        "exampleA": "The city must confront the growing problem of homelessness.",
        "exampleB": "She was confronted with evidence that contradicted her statement.",
        "exampleC": "We are confronted with a difficult choice between two undesirable options.",
        "status": "seen"
    },
    {
        "id": "d267e53d-3ca9-4795-a10d-3b0bef51ae05",
        "word": "contaminate",
        "persian": "آلوده کردن، کثیف کردن، یا مسموم کردن.\n",
        "definition": "To contaminate means to make something impure or unsuitable by adding a polluting or poisonous substance. It implies introducing something harmful or unwanted that degrades the quality or integrity of the original item.\n\nSynonyms: pollute, taint, defile, adulterate, corrupt.\n",
        "exampleA": "The oil spill will likely contaminate the nearby beaches.",
        "exampleB": "Be careful not to contaminate the sample during the experiment.",
        "exampleC": "Rumors can contaminate a person's reputation unfairly.",
        "status": ""
    },
    {
        "id": "a08bfed3-39e5-485c-8bba-39fddfe59c06",
        "word": "contaminated",
        "persian": "\"آلوده شده\" یا \"آلوده\"\n",
        "definition": "\"Contaminated\" means to make something impure or unsuitable by adding a polluting or poisonous substance to it. It implies a state of being corrupted or tainted, rendering the affected thing unusable or harmful.\nSynonyms: polluted, tainted, defiled, infected, adulterated.\n",
        "exampleA": "The river was contaminated with industrial waste.",
        "exampleB": "Eating contaminated food can cause serious illness.",
        "exampleC": "The evidence was considered inadmissible because it was contaminated during collection.",
        "status": ""
    },
    {
        "id": "581ed5b9-30a4-4cd3-ac64-8ebc512d58e0",
        "word": "contamination",
        "persian": "آلودگی (بخاطر افزوده شدن سموم یا مواد شیمیایی)ه",
        "definition": "Contamination refers to the presence of an unwanted, impure, or harmful substance that compromises the cleanliness, purity, or usability of something. It essentially means making something dirty, polluted, or dangerous through the introduction of foreign elements.\nSynonyms: Pollution, adulteration, taint, defilement, infection.\n",
        "exampleA": "radioactive contamination",
        "exampleB": "The accidental contamination of the water supply led to widespread illness.",
        "exampleC": "Strict laboratory protocols are necessary to prevent contamination of the samples.",
        "status": "seen"
    },
    {
        "id": "f7db1c1d-54cd-469f-ac3d-da5e970d8444",
        "word": "crucial",
        "persian": "اساسی، مهم وتعیین کننده",
        "definition": "\"Crucial\" means extremely important or essential; something upon which the success or failure of something else depends. It signifies a decisive or critical role.\n\nSynonyms: vital, pivotal, critical, essential, key.\n",
        "exampleA": "This aid money is crucial to the government's economic policies.",
        "exampleB": "Getting enough sleep is crucial for maintaining good health.",
        "exampleC": "The evidence found at the crime scene was crucial to solving the case.",
        "status": "seen"
    },
    {
        "id": "44d9e5f7-d27b-4641-bffd-b0f1bff3ffdd",
        "word": "deforestation",
        "persian": "جنگل زدایی",
        "definition": "Deforestation refers to the clearing or removal of forests and woodlands for other land uses, such as agriculture, urban development, or logging. This process significantly reduces biodiversity, contributes to climate change by releasing stored carbon, and disrupts vital ecosystem services like water regulation and soil conservation.\n\nSynonyms: forest clearing, forest destruction, forest loss, woodland removal.\n",
        "exampleA": "Deforestation is a major contributor to climate change.",
        "exampleB": "The rapid deforestation in the Amazon rainforest threatens countless species.",
        "exampleC": "Sustainable forestry practices are crucial to combat deforestation.",
        "status": "learned"
    },
    {
        "id": "87ba9858-cc0b-4160-a700-b5038499629e",
        "word": "devastating",
        "persian": "ویرانگر",
        "definition": "\"Devastating\" describes something that causes immense damage, destruction, or overwhelming grief. It implies a catastrophic impact that leaves a lasting negative effect.\n\nSynonyms: ruinous, catastrophic, crushing, tragic, calamitous.\n",
        "exampleA": "The drought has had devastating consequences/effects.",
        "exampleB": "The hurricane had a devastating impact on the coastal communities.",
        "exampleC": "The news of his sudden passing was devastating to everyone who knew him.",
        "status": "seen"
    },
    {
        "id": "ed56913a-dc43-4ca6-87d9-bf6b9cfc12aa",
        "word": "disposal",
        "persian": "\"Disposal\" بسته به متن می‌تونه معانی مختلفی داشته باشه، اما به طور کلی به معنی \"دور ریختن\"، \"امحا\"، \"تخلیه\"، \"دفع\" یا \"واگذاری\" است.\n",
        "definition": "Disposal refers to the act or process of getting rid of something that is no longer wanted or needed. This can involve discarding, selling, recycling, or otherwise eliminating the item. It implies a final action to remove the object from one's possession or environment.\n\nSynonyms: removal, riddance, elimination, clearance, ejection\n",
        "exampleA": "The proper disposal of hazardous waste is crucial for environmental protection.",
        "exampleB": "The old furniture was offered for sale before its disposal.",
        "exampleC": "The company is responsible for the safe disposal of its chemical byproducts.",
        "status": ""
    },
    {
        "id": "e7b4321b-841a-4e71-a06b-8df10712f916",
        "word": "dispose of",
        "persian": "\"دور انداختن\"، \"خلاص شدن از\"، \"از شر چیزی خلاص شدن\" یا \"از بین بردن\". انتخاب بهترین گزینه بستگی به بافت جمله دارد.\n",
        "definition": "\"Dispose of\" means to get rid of something, typically because it's no longer wanted or needed. It implies removing or eliminating something from your possession or control.\n\nSynonyms: discard, eliminate, throw away, get rid of, remove\n",
        "exampleA": "Please dispose of the trash properly in the designated bins.",
        "exampleB": "We need to dispose of the old equipment before we can order new models.",
        "exampleC": "It's important to dispose of confidential documents securely.",
        "status": ""
    },
    {
        "id": "ea62c675-ca8f-40cc-a546-6f675029494a",
        "word": "dispose of sb/sth",
        "persian": "دور ریختن چیزی",
        "definition": "\"Dispose of\" means to get rid of something or someone, often implying that the item is no longer wanted or needed, or that the person is no longer considered useful or desirable. It can refer to discarding unwanted objects or eliminating a problem or threat.\n\nSynonyms: discard, eliminate, get rid of, throw away, abolish, remove\n",
        "exampleA": "The detective had to dispose of the evidence carefully.",
        "exampleB": "I need to dispose of these old newspapers.",
        "exampleC": "He disposed of his opponent with a swift knockout.",
        "status": "seen"
    },
    {
        "id": "9782a4d8-63d0-4460-b1bf-d6dc46a89650",
        "word": "doubtful",
        "persian": "\"doubtful\" بسته به متن می‌تونه به صورت‌های مختلفی ترجمه بشه، اما رایج‌ترین معادل‌ها عبارتند از: مردد، مشکوک، یا نامطمئن.\n",
        "definition": "\"Doubtful\" describes a state of uncertainty, hesitation, or disbelief about something. It suggests a lack of conviction or confidence, and can refer to both the likelihood of an event occurring and the truthfulness of a statement. It implies a questioning attitude or a sense of skepticism.\n\nSynonyms: dubious, uncertain, questionable, skeptical, hesitant\n",
        "exampleA": "I'm doubtful that the project will be completed on time.",
        "exampleB": "She gave a doubtful look when I suggested going camping in the rain.",
        "exampleC": "The doctor was doubtful about the effectiveness of the new treatment.",
        "status": ""
    },
    {
        "id": "f3998b2c-aac8-49a6-9cc3-fe2bca53b94c",
        "word": "drought",
        "persian": "\"خشکسالی\" معادل فارسی کلمه \"drought\" است که به دوره های طولانی کمبود بارندگی و کم آبی اشاره دارد.\n",
        "definition": "A drought is a prolonged period of abnormally low rainfall, leading to a shortage of water. It can significantly impact agriculture, ecosystems, and human populations by causing crop failure, water restrictions, and increased risk of wildfires.\n\nSynonyms: aridity, dryness, water scarcity, desiccation, rainlessness.\n",
        "exampleA": "The prolonged drought devastated local farms, leaving many crops withered and unusable.",
        "exampleB": "Scientists are studying ancient tree rings to understand the severity of past droughts.",
        "exampleC": "Water conservation efforts are crucial to mitigate the effects of drought in arid regions.",
        "status": ""
    },
    {
        "id": "792b4b57-c338-4c19-9515-28be6fc1a758",
        "word": "dump",
        "persian": "\"Dump\" در فارسی بسته به متن می‌تونه معانی مختلفی داشته باشه، اما رایج‌ترین ترجمه‌ها عبارتند از: \"خالی کردن\"، \"دور انداختن\"، \"رها کردن\" یا \"سرازیری\".\n",
        "definition": "to put down or drop something in a careless way",
        "exampleA": "He came in with four shopping bags and dumped them on the table",
        "exampleB": "The company decided to dump the toxic waste into the river.",
        "exampleC": "I need to dump all this old furniture.",
        "status": "seen"
    },
    {
        "id": "f705445f-4c35-4c44-b14f-583cca376eb9",
        "word": "ecosystem",
        "persian": "\"Ecosystem\" در فارسی معمولاً به \"بوم‌سازگان\" یا \"اکوسیستم\" ترجمه می‌شود که به یک سامانه پویا از موجودات زنده (گیاهان، جانوران، و میکروارگانیسم‌ها) و محیط غیرزنده‌ای که با هم در تعامل هستند، اشاره دارد.\n",
        "definition": "a biological community of interacting organisms and their physical environment",
        "exampleA": "Pollution can have disastrous effects on the delicately balanced ecosystem.",
        "exampleB": "The oil spill severely damaged the delicate coastal ecosystem.",
        "exampleC": "Sustainable practices are crucial for maintaining a healthy ecosystem.",
        "status": "learned"
    },
    {
        "id": "854621d0-c6aa-439f-86cc-3e9ab1f718c4",
        "word": "eminent",
        "persian": "والامقام، بزرگ",
        "definition": "\"Eminent\" describes someone who is distinguished and highly respected within a particular field or profession due to their achievements, skills, or qualities. It suggests a position of high rank and recognition.\n\nSynonyms: distinguished, renowned, prominent, esteemed, notable.\n",
        "exampleA": "eminent historian/scientist",
        "exampleB": "The university boasts an eminent faculty known for their groundbreaking research.",
        "exampleC": "As an eminent scholar of ancient history, she was often consulted for her expertise.",
        "status": "seen"
    },
    {
        "id": "50954285-85c2-4409-a4cc-01c6a0a9c7f9",
        "word": "emission",
        "persian": "انتشار( مربوط به مواد آلاینده و سمی)ه",
        "definition": "\"Emission\" refers to the act of producing or discharging something, often a gas, liquid, or energy, into the environment. It's commonly used in the context of pollutants released from vehicles, factories, or other sources, contributing to air, water, or soil contamination.\n\nSynonyms: discharge, release, expulsion, outflow, venting.\n",
        "exampleA": "Environmental groups want a substantial reduction in the emission of greenhouse gases",
        "exampleB": "The government is working to reduce carbon emission from factories.",
        "exampleC": "The scientist studied the emission spectrum of the newly discovered element.",
        "status": "seen"
    },
    {
        "id": "40c06f6e-34dc-463f-b380-c7f54783cdb2",
        "word": "environmental",
        "persian": "«محیط زیستی» یا «زیست‌محیطی» بهترین معادل‌ها برای واژه \"environmental\" هستند و بسته به متن می‌توان از آن‌ها استفاده کرد.\n",
        "definition": "\"Environmental\" refers to anything relating to the natural world and its surroundings, including living organisms, physical resources, and the ecosystems they form. It encompasses the interactions between these elements and the impact of human activities upon them.\n\nSynonyms: ecological, natural, green, conservationist.\n",
        "exampleA": "The company is committed to making more environmentally friendly products.",
        "exampleB": "Environmental regulations are becoming stricter to protect our planet.",
        "exampleC": "Many people are concerned about the environmental impact of deforestation.",
        "status": ""
    },
    {
        "id": "9091ad33-f053-4495-918d-f06975ed5d15",
        "word": "environmentally friendly",
        "persian": "\"دوستدار محیط زیست\" یا \"سازگار با محیط زیست\".\n",
        "definition": "\"Environmentally friendly\" describes products, practices, or behaviors that minimize harm to the environment. It signifies a conscious effort to reduce pollution, conserve natural resources, and avoid contributing to climate change or other ecological problems. The goal is to lessen the negative impact on ecosystems and promote a more sustainable relationship between humans and the planet.\n\nSynonyms: eco-friendly, sustainable, green, nature-friendly, ecologically sound.\n",
        "exampleA": "Using reusable bags is an environmentally friendly way to reduce plastic waste.",
        "exampleB": "The company is committed to developing environmentally friendly products.",
        "exampleC": "Solar panels are an environmentally friendly source of energy.",
        "status": ""
    },
    {
        "id": "1e706e6c-7f4b-4126-b0dc-6ff6689e8854",
        "word": "erosion",
        "persian": "\"Erosion\" در فارسی به معنای فرسایش، تخریب تدریجی یا ساییدگی است.\n",
        "definition": "Erosion is the process by which soil, rock, or other materials are gradually worn away and transported by natural forces, such as wind, water, or ice. It involves the detachment and movement of these materials from one location to another, often leading to significant changes in the landscape over time.\n\nSynonyms: weathering, abrasion, disintegration, denudation, attrition\n",
        "exampleA": "Coastal erosion is a major concern for communities living near the sea.",
        "exampleB": "The farmer implemented new techniques to prevent soil erosion on his land.",
        "exampleC": "Wind and rain can contribute to the gradual erosion of rock formations over time.",
        "status": ""
    },
    {
        "id": "98a13344-ed74-455e-90f6-b15ea72e6089",
        "word": "exhaust (fumes)",
        "persian": "\"دود خروجی\" یا \"دود اگزوز\" بهترین ترجمه برای این عبارت هستند.\n",
        "definition": "Exhaust fumes are the gaseous byproducts released from an engine, typically internal combustion engines, after the fuel has been burned to produce power. These fumes are a complex mixture of pollutants and substances that are vented into the atmosphere.\n\nSynonyms: emissions, tailpipe emissions, exhaust gases, combustion products.\n",
        "exampleA": "The mechanic wore a mask to avoid inhaling the exhaust fumes.",
        "exampleB": "The air quality deteriorated rapidly due to the exhaust fumes from the idling cars.",
        "exampleC": "I could smell the acrid scent of exhaust fumes when the bus pulled up.",
        "status": ""
    },
    {
        "id": "a4334f75-2a51-4e7d-a10d-c4a20f10402b",
        "word": "exhaust fumes",
        "persian": "بخارت سمی خروجی",
        "definition": "Exhaust fumes are the gaseous byproducts released from an internal combustion engine after fuel is burned. These fumes typically include a complex mixture of pollutants like carbon monoxide, nitrogen oxides, hydrocarbons, and particulate matter, which are harmful to both human health and the environment.\n\nSynonyms: emissions, tailpipe emissions, exhaust gas, combustion products.\n",
        "exampleA": "The air was thick with exhaust fumes from the idling buses.",
        "exampleB": "She coughed, waving her hand to disperse the exhaust fumes.",
        "exampleC": "The mechanic checked the car's emissions to reduce harmful exhaust fumes.",
        "status": "seen"
    },
    {
        "id": "efbb5243-af58-40d9-9770-0b5f1f318443",
        "word": "feasible",
        "persian": "\"Feasible\" در فارسی معمولاً به «شدنی»، «امکان‌پذیر»، «عملی» یا «قابل اجرا» ترجمه می‌شود.\n",
        "definition": "\"Feasible\" means capable of being done or accomplished; it suggests that something is practical, possible, and likely to succeed. It implies that the necessary resources, conditions, or circumstances are in place to allow for the successful completion of a task or plan.\n\nSynonyms: Possible, Achievable, Viable, Practical, Workable\n",
        "exampleA": "It's not feasible to complete the project by the end of the week.",
        "exampleB": "A more feasible solution would be to break the task into smaller parts.",
        "exampleC": "Given the limited resources, a phased approach seems most feasible.",
        "status": ""
    },
    {
        "id": "13564f74-9345-43ba-958c-b3b4fa913d7b",
        "word": "fertilizer",
        "persian": "کود\n",
        "definition": "Fertilizer is any natural or synthetic substance added to soil or plant tissues to supply one or more plant nutrients essential for growth. It is used to improve crop yields and the overall health of plants by replenishing depleted nutrients in the soil or directly feeding the plants.\n\nSynonyms: plant food, soil amendment, nutrient supplement.\n",
        "exampleA": "The farmer spread fertilizer on the fields to increase crop yield.",
        "exampleB": "Organic fertilizer is a sustainable alternative to chemical options.",
        "exampleC": "Excessive use of fertilizer can lead to water pollution.",
        "status": ""
    },
    {
        "id": "3deb5052-e08e-44be-8fa7-a36afb9e4950",
        "word": "flood",
        "persian": "معنی flood می‌شه سیل یا سیلاب.\n",
        "definition": "A flood is an overflow of water that submerges land that is normally dry. It's typically caused by excessive rainfall, rapid snowmelt, coastal storm surges, or dam failures, and can lead to widespread damage and displacement.\n\nSynonyms: deluge, inundation, overflow, torrent, submersion.\n",
        "exampleA": "The heavy rain caused a massive flood in the valley.",
        "exampleB": "A flood of emotions washed over her as she watched her daughter graduate.",
        "exampleC": "The market was flooded with cheap imports, hurting local businesses.",
        "status": ""
    },
    {
        "id": "e38b9e41-bd2b-45b6-ab71-fc3e97378b55",
        "word": "food chain",
        "persian": "\"زنجیره غذایی\" یا \"سلسله غذایی\"\n",
        "definition": "a series of living things that are connected because each group of things eats the group below it in the series",
        "exampleA": "The tiny shrimp plays a vital role in the ocean's food chain.",
        "exampleB": "Humans are at the top of many food chains, but we are still dependent on the lower levels.",
        "exampleC": "Disruptions to any part of the food chain can have cascading effects on the entire ecosystem.",
        "status": "learned"
    },
    {
        "id": "e03860a0-e501-4776-b944-2d85c842b505",
        "word": "fruitless",
        "persian": "بی ثمر",
        "definition": "\"Fruitless\" describes something that fails to produce the desired or intended result; it's ineffective and ultimately yields nothing of value. It implies an effort was made, but it didn't pan out.\n\nSynonyms: Unproductive, futile, vain, unsuccessful, abortive.\n",
        "exampleA": "After hours of fruitless searching, they abandoned the quest for the lost keys.",
        "exampleB": "The negotiations proved fruitless, as neither side was willing to compromise.",
        "exampleC": "His efforts to convince her were ultimately fruitless.",
        "status": "learned"
    },
    {
        "id": "c41aa091-f91b-460c-8794-d693a657e90b",
        "word": "fumes",
        "persian": "\"Fumes\" بسته به متن می‌تونه به \"بخارات\"، \"دود\"، \"گازهای سمی\" یا \"بوهای تند\" ترجمه بشه. یه ترجمه عمومی‌تر می‌تونه \"گازهای متصاعد شده\" باشه.\n",
        "definition": "\"Fumes\" refer to smoke, gas, or vapor that smells strongly and can be harmful or unpleasant to breathe. They are often released from chemical reactions, burning materials, or other industrial processes.\n\nSynonyms: Vapors, exhalations, emissions, smoke, gas.\n",
        "exampleA": "The mechanic warned us about the dangerous fumes coming from the old engine.",
        "exampleB": "She held her breath to avoid inhaling the paint fumes.",
        "exampleC": "A cloud of exhaust fumes filled the air after the race.",
        "status": ""
    },
    {
        "id": "7c8d179d-2097-406e-899a-5f7b843283c4",
        "word": "futile",
        "persian": "بیهوده و بی فایده",
        "definition": "\"Futile\" describes an action or effort that is pointless because it is incapable of producing any useful result or achieving a desired outcome. It signifies a waste of time and energy, often implying a sense of hopelessness or frustration.\n\nSynonyms: useless, pointless, vain, fruitless, ineffective.\n",
        "exampleA": "Resisting the inevitable felt utterly futile.",
        "exampleB": "Their efforts to revive the failing company proved futile.",
        "exampleC": "Arguing with him about politics is always a futile exercise.",
        "status": "seen"
    },
    {
        "id": "07511a0a-6bf4-4cec-a1eb-ab591e4263ef",
        "word": "greenhouse gases",
        "persian": "گارهای گلخانه ای",
        "definition": "Greenhouse gases are atmospheric gases that trap heat from the sun and prevent it from escaping back into space, warming the Earth's surface. This phenomenon, known as the greenhouse effect, is vital for maintaining a habitable temperature on Earth, but an excess of these gases due to human activities like burning fossil fuels is leading to global warming and climate change.\n\nSynonyms: heat-trapping gases, climate forcing agents, radiative forcing gases\n",
        "exampleA": "The release of greenhouse gases is a major contributor to climate change.",
        "exampleB": "Reducing our dependence on fossil fuels is essential to lowering greenhouse gases.",
        "exampleC": "International agreements aim to limit the emission of greenhouse gases.",
        "status": "learned"
    },
    {
        "id": "eb2b10ed-64b7-4a0e-91e4-3f424a334da6",
        "word": "hand out",
        "persian": "پخش کردن چیزی بین مردم",
        "definition": "\"Hand out\" means to distribute something, often materials or objects, to a group of people. It implies a simple act of giving something directly from one person to another or a group.\n\nSynonyms: distribute, dispense, give out, pass around\n",
        "exampleA": "Please hand out these worksheets to the class.",
        "exampleB": "The company decided to hand out bonuses this year due to record profits.",
        "exampleC": "Volunteers will hand out flyers promoting the upcoming festival.",
        "status": "seen"
    },
    {
        "id": "96c47b19-c19e-459d-917e-420330f2abac",
        "word": "immune",
        "persian": "\"ایمن\" یا \"مصون\" رایج‌ترین ترجمه‌های \"immune\" هستند. بسته به متن، می‌توان از کلماتی مانند \"مقاوم\" یا \"واکسینه\" نیز استفاده کرد.\n",
        "definition": "\"Immune\" describes a state of being protected from a particular disease or condition, often through prior exposure or vaccination. It signifies resistance to infection, preventing the development of symptoms or reducing their severity. The body's defense system effectively neutralizes the invading pathogen or harmful substance.\n\nSynonyms: resistant, protected, invulnerable, unsusceptible\n",
        "exampleA": "After getting the vaccine, she was immune to the virus.",
        "exampleB": "The old computer system was not immune to cyber attacks.",
        "exampleC": "Some people seem to be immune to the effects of peer pressure.",
        "status": ""
    },
    {
        "id": "1432892c-1e1a-46dd-a929-30c5fd4d7a5a",
        "word": "impact",
        "persian": "«اثر»، «تاثیر» یا «پیامد»، بسته به متن و منظور، معادل‌های مناسبی برای کلمه \"impact\" در فارسی هستند.\n",
        "definition": "\"Impact\" refers to a significant or noticeable effect, influence, or consequence. It signifies something that has a strong or powerful influence on something else, leaving a lasting impression or change.\n\nSynonyms: effect, influence, consequence, result, repercussion.\n",
        "exampleA": "The new policy will impact all employees.",
        "exampleB": "The meteor's impact created a large crater.",
        "exampleC": "His speech had a profound impact on the audience.",
        "status": ""
    },
    {
        "id": "8889dced-9c9b-4723-8c6e-fd4bf4f868e5",
        "word": "impracticable",
        "persian": "غیر عملی، اجرا نشدنی",
        "definition": "\"Impracticable\" describes something that is not capable of being carried out or put into practice, typically due to its unsuitability, the lack of necessary resources, or inherent difficulties. It suggests a plan, idea, or task is unrealistic or unachievable in the given circumstances.\n\nSynonyms: unfeasible, impossible, unrealistic, unworkable, unattainable.\n",
        "exampleA": "The proposed solution was deemed impracticable due to its high cost.",
        "exampleB": "Building a bridge across such a wide and turbulent river seemed utterly impracticable.",
        "exampleC": "Implementing the new regulations proved impracticable without significant additional resources.",
        "status": "learned"
    },
    {
        "id": "0e56ca3a-13ee-47bd-a0f6-310dd9b45c7a",
        "word": "improbable",
        "persian": "غیرمحتمل",
        "definition": "\"Improbable\" describes something that is unlikely to happen or be true; it suggests a low probability of occurrence. It conveys a sense of doubt and skepticism regarding the possibility of something existing or taking place.\n\nSynonyms: unlikely, doubtful, questionable, dubious, remote.\n",
        "exampleA": "It seemed improbable that he could win the race after such a bad start.",
        "exampleB": "The discovery of life on Mars, while exciting, still seems improbable.",
        "exampleC": "Given the current evidence, a connection between the two events is highly improbable.",
        "status": "learned"
    },
    {
        "id": "6924a31d-e2b7-4bb7-be93-9a952ae8d269",
        "word": "in danger (of)",
        "persian": "در معرض خطر، در آستانه ی خطر، یا در معرض تهدید.\n",
        "definition": "\"In danger (of)\" means facing a high risk of experiencing something harmful, negative, or undesirable. It implies a potential for harm, loss, or undesirable outcome.\nSynonyms: At risk, imperiled, threatened, vulnerable, exposed.\n",
        "exampleA": "The hikers were in danger of being caught in a blizzard.",
        "exampleB": "The old building is in danger of collapsing if it isn't repaired soon.",
        "exampleC": "The company is in danger of losing its market share due to increased competition.",
        "status": ""
    },
    {
        "id": "c96e7a72-bbb9-45ee-8a74-0a33a89a56a7",
        "word": "inevitably",
        "persian": "\"ناگزیر\"، \"به طور اجتناب‌ناپذیر\" یا \"حتماً\" معادل‌های مناسبی برای این کلمه هستند و بسته به متن می‌توان از آن‌ها استفاده کرد.\n",
        "definition": "\"Inevitably\" means that something is certain to happen and impossible to avoid. It suggests that the outcome is predetermined and unavoidable, regardless of any attempts to prevent it.\n\nSynonyms: Unavoidably, necessarily, certainly, inescapably, assuredly.\n",
        "exampleA": "The project, lacking proper planning, inevitably failed to meet its deadlines.",
        "exampleB": "As the rain continued to fall, the streets inevitably began to flood.",
        "exampleC": "Despite his best efforts, he inevitably fell behind in the race.",
        "status": ""
    },
    {
        "id": "997ac9df-8b83-4756-91ae-1d96134f58ac",
        "word": "inexorable",
        "persian": "\"Inexorable\" به فارسی می‌تونه به صورت‌های مختلفی ترجمه بشه، اما بسته به متن، معادل‌های «غیرقابل‌توقف»، «سخت و بی‌رحم»، «مصمم و قاطع»، یا «اجتناب‌ناپذیر» می‌تونن مناسب باشن.\n",
        "definition": "impossible to stop or prevent",
        "exampleA": "Something has got to be done to stop this inexorable rise in expenditure.",
        "exampleB": "The inexorable rise of the sea level threatens coastal communities.",
        "exampleC": "Despite his best efforts, he could not escape the inexorable march of time.",
        "status": "learned"
    },
    {
        "id": "9d4ea30c-229d-47dd-a458-58e2fcd8e425",
        "word": "inexorably",
        "persian": "\"Inexorably\" به فارسی می‌تونه به صورت‌های زیر ترجمه بشه:\n\n   به‌طور اجتناب‌ناپذیر\n   به‌طور قاطع\n   به‌طور تغییرناپذیر\n   بی‌رحمانه\n   به‌ناچار\n\nانتخاب بهترین ترجمه بستگی به زمینه استفاده از کلمه داره.\n",
        "definition": "\"Inexorably\" means in a way that is impossible to stop or prevent; relentlessly and inevitably. It suggests a force or process that is determined to continue regardless of any resistance or efforts to change it.\n\nSynonyms: relentlessly, inevitably, unstoppably, unyieldingly, implacably\n",
        "exampleA": "The tide inexorably crept higher and higher up the beach.",
        "exampleB": "Despite her efforts to resist, she was inexorably drawn to him.",
        "exampleC": "The company's market share declined inexorably over the years.",
        "status": ""
    },
    {
        "id": "68e2c50a-294b-4d2d-95ef-20b482b8bd2c",
        "word": "in sb's turn",
        "persian": "به نوبه ی خود",
        "definition": "\"In sb's turn\" means that it is someone's designated or appropriate time to do something, especially after others have had their chance. It indicates a sequence where each person gets an opportunity or responsibility in a set order.\n\nSynonyms: in one's time, by turns, sequentially, in succession.\n",
        "exampleA": "Fish, in their turn, get to carnivores and in this way poison gets into a man's meal.",
        "exampleB": "It's Sarah's turn to wash the dishes, and then it will be in John's turn.",
        "exampleC": "After Maria presented her findings, it was in David's turn to speak.",
        "status": "learned"
    },
    {
        "id": "93ff80b1-89a7-48a6-8a54-d07831b81bab",
        "word": "insoluble",
        "persian": "لاینحل",
        "definition": "\"Insoluble\" describes something that cannot be dissolved, especially in a liquid. It implies a resistance to being broken down, disintegrated, or blended into a solution.\nSynonyms: Indissoluble, unsolvable, irresolvable, unmixable.\n",
        "exampleA": "insoluble conflicts within the department",
        "exampleB": "The agreement proved insoluble, leading to a breakdown in negotiations.",
        "exampleC": "Diamond is insoluble in water and most common solvents.",
        "status": "learned"
    },
    {
        "id": "5be0d713-d336-43be-8130-db136de549ea",
        "word": "insurmountable",
        "persian": "غیر قابل عبور، برطرف نشدنی",
        "definition": "\"Insurmountable\" describes a challenge or obstacle that is so great, difficult, or impossible to overcome. It suggests a barrier that seems hopeless to breach, rendering any attempt at success futile. In essence, it's something that appears unbeatable.\n\nSynonyms: Impossible, impassable, unachievable, hopeless, overwhelming.\n",
        "exampleA": "This small country is faced with an insurmountable debt.",
        "exampleB": "The challenges seemed insurmountable at first, but we found a way to overcome them.",
        "exampleC": "Despite the initial setback, the team refused to believe the task was insurmountable.",
        "status": "seen"
    },
    {
        "id": "040070cb-dc51-4e5c-b32b-6c8f3dccfa62",
        "word": "irrelevant (to sth)",
        "persian": "نامربوط، نامرتبط",
        "definition": "\"Irrelevant (to sth)\" means not connected with or important to the subject or situation being discussed or considered. It implies that something is not applicable, pertinent, or related to the matter at hand and therefore can be disregarded.\n\nSynonyms: inapplicable, immaterial, unrelated, extraneous, beside the point.\n",
        "exampleA": "His comments were completely irrelevant to the discussion.",
        "exampleB": "The details about his personal life are irrelevant to the case.",
        "exampleC": "Whether he likes the color is irrelevant to the project's success.",
        "status": "learned"
    },
    {
        "id": "b8e24f12-e651-4d18-aee1-9ff154eacf35",
        "word": "irreparable",
        "persian": "جبران ناپذیر",
        "definition": "\"Irreparable\" describes something that is beyond repair or impossible to fix, correct, or remedy. It signifies a state of damage or loss that is so severe or complete that restoration is not possible.\n\nSynonyms: irreversible, irremediable, incurable, irrecoverable, hopeless.\n",
        "exampleA": "The fire caused irreparable damage to the historic building.",
        "exampleB": "His betrayal caused an irreparable rift in their friendship.",
        "exampleC": "She feared her mistake would have irreparable consequences for the company.",
        "status": "seen"
    },
    {
        "id": "26b9666b-ea6b-44e6-b58f-8fec7b5e1e80",
        "word": "irreplaceable",
        "persian": "غیر قابل جایگزینی",
        "definition": "\"Irreplaceable\" describes something or someone so unique and valuable that it cannot be substituted or replicated. Its essence or significance is lost if it's gone, making it impossible to find an adequate replacement. The thing or person is considered one-of-a-kind and essential to whoever holds it dear.\n\nSynonyms: invaluable, unique, matchless, singular, precious.\n",
        "exampleA": "The antique vase was irreplaceable due to its unique design and historical significance.",
        "exampleB": "Her grandmother's love was irreplaceable, a constant source of comfort and support.",
        "exampleC": "He considered his mentor's guidance irreplaceable in navigating the challenges of his career.",
        "status": "learned"
    },
    {
        "id": "c006f763-e9be-4205-9e67-40fed476f54d",
        "word": "irreversible",
        "persian": "غیر قابل برگشت، برگشت ناپذیر",
        "definition": "\"Irreversible\" describes something that cannot be undone, changed back to its original state, or reversed. Once a process or event is irreversible, its effects are permanent and cannot be retracted.\n\nSynonyms: unalterable, irrevocable, permanent, unchangeable.\n",
        "exampleA": "The damage to the ecosystem was considered irreversible.",
        "exampleB": "He knew that the decision he was about to make was irreversible.",
        "exampleC": "The antique vase shattered into a million pieces, making the damage irreversible.",
        "status": "learned"
    },
    {
        "id": "361ff3e2-a71e-41ec-a10e-17548bf0d4ce",
        "word": "leaflet",
        "persian": "بروشور اطلاعاتی",
        "definition": "A leaflet is a small, single-sheet printed piece of paper, often folded, used for advertising or providing information. It's a cost-effective way to reach a wide audience with brief details about a product, service, event, or cause.\n\nSynonyms: pamphlet, flyer, brochure, handbill.\n",
        "exampleA": "I picked up a leaflet advertising the new Italian restaurant downtown.",
        "exampleB": "The volunteer handed me a leaflet about the upcoming charity run.",
        "exampleC": "She found a leaflet tucked under her windshield wiper.",
        "status": "seen"
    },
    {
        "id": "d368f6bc-d076-4db8-9b12-44caa3b442df",
        "word": "liable",
        "persian": "\"Liable\" بسته به متن می‌تونه معانی مختلفی داشته باشه، اما رایج‌ترین ترجمه‌ها این‌ها هستند: \"مسئول\"، \"پاسخگو\"، \"متعهد\" یا \"در معرض\".\n",
        "definition": "\"Liable\" means legally responsible or obligated for something, especially a debt or wrongdoing. It indicates a state of being accountable for a particular action or situation, potentially leading to legal repercussions or financial burdens.\n\nSynonyms: Responsible, accountable, answerable, obligated, subject to.\n",
        "exampleA": "The company was found liable for damages caused by the faulty product.",
        "exampleB": "If you sign the contract, you will be liable for all debts incurred.",
        "exampleC": "The driver was held liable for the accident due to his negligence.",
        "status": ""
    },
    {
        "id": "e5d947f2-c398-48a1-8d5b-32c6d013eaa0",
        "word": "liable (for sth, to do sth)",
        "persian": "مسئول",
        "definition": "\"Liable\" signifies being legally responsible or accountable for something, whether it's a debt, an obligation, or the consequences of an action. It can also mean being likely or prone to experience or do something, often something undesirable. Simply put, it describes a state of responsibility or a high probability of occurrence.\n\nSynonyms: responsible, accountable, answerable, subject to, prone to, likely to.\n",
        "exampleA": "If we lose the case we may be liable for (= have to pay) the costs of the whole trial.",
        "exampleB": "The company was held liable for the damages caused by the defective product.",
        "exampleC": "He is liable to make mistakes when he is tired.",
        "status": "seen"
    },
    {
        "id": "86190d4f-3e3e-46d6-ba3a-d58317427971",
        "word": "life-threatening",
        "persian": "عبارت \"life-threatening\" به فارسی می‌تونه به صورت \"تهدید کننده زندگی\"، \"خطرناک برای حیات\" یا \"مهلک\" ترجمه بشه.\n",
        "definition": "\"Life-threatening\" describes a condition, injury, or situation that poses a significant risk of causing death if not treated or addressed promptly. It indicates an immediate danger to a person's survival.\n\nSynonyms: Critical, perilous, deadly, grave, fatal.\n",
        "exampleA": "The patient was rushed to the emergency room with a life-threatening injury.",
        "exampleB": "Ignoring safety regulations can create life-threatening situations for workers.",
        "exampleC": "This allergic reaction is life-threatening and requires immediate medical attention.",
        "status": ""
    },
    {
        "id": "74d7dce1-c56e-465c-9cf7-6b3b1f38fa37",
        "word": "litter",
        "persian": "آشغال",
        "definition": "Litter refers to discarded waste material, often left carelessly or improperly in public places. It encompasses various types of trash, including paper, plastic, food wrappers, and cigarette butts. Leaving litter creates an unsightly environment, pollutes ecosystems, and can pose hazards to wildlife and human health.\n\nSynonyms: rubbish, trash, garbage, refuse, debris.\n",
        "exampleA": "Please do not litter in the park; keep it clean for everyone.",
        "exampleB": "The stray cat had a litter of kittens under the porch.",
        "exampleC": "There was a considerable amount of litter scattered along the roadside after the festival.",
        "status": "seen"
    },
    {
        "id": "37b8fb22-ba5b-47dc-85f5-22f91e082727",
        "word": "marine",
        "persian": "دریایی",
        "definition": "\"Marine\" refers to anything related to the sea or ocean, including the plants and animals that live there, maritime activities, and the environment itself. It encompasses a broad range of topics from marine biology and geology to seafaring and naval affairs.\n\nSynonyms: oceanic, nautical, maritime, sea-related, aquatic.\n",
        "exampleA": "The marine biologist studied the coral reefs.",
        "exampleB": "He served as a marine in the United States military.",
        "exampleC": "Pollution is a serious threat to marine life.",
        "status": "seen"
    },
    {
        "id": "ea9cac8d-c028-4eb0-9dab-a7a5d0266d7f",
        "word": "omnipresent",
        "persian": "حاضر در همه جا",
        "definition": "Omnipresent means present everywhere simultaneously; it describes something or someone that exists in all places at the same time. It implies a universal presence, not limited by physical boundaries or location.\n\nSynonyms: ubiquitous, pervasive, universal, all-present.\n",
        "exampleA": "The singer became an omnipresent icon of style and beauty.",
        "exampleB": "The fear of failure felt omnipresent as he approached the deadline.",
        "exampleC": "In the digital age, technology has become an omnipresent part of our lives.",
        "status": "seen"
    },
    {
        "id": "5971e6ce-8ec9-43a0-910d-87ddcda56d20",
        "word": "overnight",
        "persian": "یک شبه",
        "definition": "\"Overnight\" means happening or accomplished during the course of a single night, or very quickly and suddenly. It implies an immediate or rapid transformation or occurrence.\nSynonyms: instantaneously, rapidly, suddenly, swiftly, in a flash.\n",
        "exampleA": "She became a star overnight.",
        "exampleB": "The package arrived overnight, much to my surprise.",
        "exampleC": "The small town transformed almost overnight into a bustling tourist destination.",
        "status": "seen"
    },
    {
        "id": "6b3902d0-5ad9-43e1-90de-4623d6bfe7d7",
        "word": "persistent",
        "persian": "مداوم",
        "definition": "\"Persistent\" describes someone or something that continues firmly or obstinately in a course of action despite difficulty or opposition. It implies a steadfast refusal to give up or be deterred, demonstrating a strong-willed determination to achieve a goal or maintain a belief.\n\nSynonyms: tenacious, persevering, resolute, determined, insistent.\n",
        "exampleA": "The persistent rain ruined our picnic plans.",
        "exampleB": "Her persistent efforts eventually led to a promotion.",
        "exampleC": "He was a persistent advocate for environmental protection.",
        "status": "learned"
    },
    {
        "id": "164c12b0-85f7-4df3-972a-dd6e9855a891",
        "word": "pervasive",
        "persian": "فراگیر",
        "definition": "\"Pervasive\" means spreading widely throughout an area or a group of people, becoming present or noticeable everywhere. It describes something that permeates or infuses everything it touches, often in a subtle or insidious way.\n\nSynonyms: widespread, prevalent, ubiquitous, omnipresent, rife.\n",
        "exampleA": "the pervasive influence of television",
        "exampleB": "The pervasive influence of technology can be seen in almost every aspect of modern life.",
        "exampleC": "Corruption was so pervasive within the government that it was difficult to identify a single honest official.",
        "status": "seen"
    },
    {
        "id": "e5d3cbc6-ae09-4c89-b1e2-8f014271082d",
        "word": "petrol-driven cars",
        "persian": "اتومبیلهای بنزین سوز",
        "definition": "\"Petrol-driven cars\" refers to automobiles that use gasoline (petrol) as their primary fuel source to power their internal combustion engines. These vehicles rely on the combustion of gasoline to generate energy, which in turn drives the wheels and propels the car forward.\n\nSynonyms: gasoline-powered cars, gas-fueled cars, internal combustion engine (ICE) cars.\n",
        "exampleA": "The government is encouraging people to switch from petrol-driven cars to electric vehicles.",
        "exampleB": "Many cities are implementing congestion charges to discourage the use of petrol-driven cars in the city center.",
        "exampleC": "The mechanic specialized in repairing older, petrol-driven cars.",
        "status": "learned"
    },
    {
        "id": "fa7830a6-544a-49bb-8101-a34839b19b73",
        "word": "pointless",
        "persian": "بی معنی و بیفایده",
        "definition": "\"Pointless\" describes something that has no purpose, value, or significance. It implies that an action, activity, or object is futile and serves no useful function. It suggests a waste of time and effort because it leads to no meaningful outcome.\n\nSynonyms: futile, meaningless, useless, vain, fruitless.\n",
        "exampleA": "Arguing with him is pointless; he never listens.",
        "exampleB": "The exercise seemed pointless, as we weren't going to use the information.",
        "exampleC": "She felt the meeting was pointless and could have been an email.",
        "status": "learned"
    },
    {
        "id": "7228e014-056b-4f5e-922a-9d3b1dd57e97",
        "word": "pollutant",
        "persian": "آلاینده",
        "definition": "A pollutant is any substance or energy introduced into the environment that has undesired effects, or adversely alters the environment's natural balance. These effects can harm living organisms, disrupt ecosystems, degrade air or water quality, and negatively impact resources.\nSynonyms: contaminant, impurity, toxin, emission, waste.\n",
        "exampleA": "The factory was fined for releasing a dangerous pollutant into the river.",
        "exampleB": "Air pollution is often caused by a variety of pollutants from vehicles and industry.",
        "exampleC": "Scientists are studying the effects of this new pollutant on aquatic life.",
        "status": "learned"
    },
    {
        "id": "5b42c466-9504-4695-a8da-90239a7ee78a",
        "word": "pollution",
        "persian": "«آلودگی» معادل فارسی کلمه \"pollution\" است.\n",
        "definition": "Pollution refers to the contamination of the environment with harmful or poisonous substances. These contaminants can negatively impact air, water, and land, posing risks to human health, ecosystems, and the overall well-being of the planet.\n\nSynonyms: contamination, defilement, adulteration, poisoning.\n",
        "exampleA": "Air pollution is a serious problem in many cities.",
        "exampleB": "The factory was fined for causing water pollution.",
        "exampleC": "We need to find ways to reduce pollution to protect our environment.",
        "status": ""
    },
    {
        "id": "ead5d09a-d21c-42ac-bf68-b39138d95b53",
        "word": "pristine",
        "persian": "«Pristine» بسته به متن می‌تونه به فارسی به صورت‌های زیر ترجمه بشه:\n\n   دست‌نخورده\n   بکر\n   تمیز و سالم\n   اصلی و خالص\n   نو و تازه\n",
        "definition": "unspoilt, clean and fresh as if new",
        "exampleA": "pristine copies of an early magazine",
        "exampleB": "The mountain lake was pristine, its waters reflecting the clear blue sky.",
        "exampleC": "After hours of cleaning, the antique car looked pristine and ready for the show.",
        "status": "seen"
    },
    {
        "id": "015c5094-0fc7-485f-9f6e-724fcf8936de",
        "word": "probable",
        "persian": "محتمل",
        "definition": "\"Probable\" means that something is likely to happen or be true, based on available evidence and reasoning. It suggests a higher chance of occurrence than possibility, but doesn't guarantee certainty. In simpler terms, it's a strong guess or a reasonable expectation.\n\nSynonyms: likely, plausible, feasible, possible, presumable.\n",
        "exampleA": "It is probable that the meeting will be postponed due to the weather.",
        "exampleB": "The detective said it was probable the suspect had an accomplice.",
        "exampleC": "Winning the lottery is improbable, but someone has to win eventually.",
        "status": "learned"
    },
    {
        "id": "5bd419fa-3d08-41ee-9ce6-9b2a1cebd175",
        "word": "process",
        "persian": "\"فرایند\"، \"روند\" یا \"فرآیند\" همگی می‌توانند به عنوان ترجمه \"process\" به کار روند، بسته به اینکه در چه زمینه‌ای استفاده شده باشد.\n",
        "definition": "\"Process\" refers to a series of actions or steps taken in order to achieve a particular end. It implies a systematic approach, often involving multiple stages and potentially requiring specific resources or protocols to reach a desired outcome.\n\nSynonyms: procedure, method, system, operation, course, practice.\n",
        "exampleA": "The manufacturing process involves several stages of quality control.",
        "exampleB": "We need to streamline the approval process to reduce delays.",
        "exampleC": "Learning a new language is a gradual process.",
        "status": ""
    },
    {
        "id": "a671f58c-b7d1-4547-a824-16567396f60a",
        "word": "questionable",
        "persian": "سوال برانگیز",
        "definition": "\"Questionable\" means something that is doubtful, suspicious, or of uncertain quality or morality. It implies that there are reasons to believe that something is not entirely honest, safe, acceptable, or reliable.\n\nSynonyms: dubious, suspicious, shady, fishy, unreliable.\n",
        "exampleA": "His explanation for being late seemed questionable.",
        "exampleB": "The company's accounting practices were deemed questionable by the auditors.",
        "exampleC": "The witness's testimony was questionable, as it contradicted previous statements.",
        "status": "learned"
    },
    {
        "id": "c58d2deb-c3df-43a3-8539-9f0a3bbd0a46",
        "word": "raise awareness of sth",
        "persian": "افزایش آگاهی دادن",
        "definition": "\"Raise awareness of something\" means to increase the level of public knowledge, understanding, or concern about a particular issue or topic. It's about making more people conscious of a problem, cause, or situation, often to encourage action or support.\n\nSynonyms: publicize, promote, highlight, disseminate information about, bring attention to.\n",
        "exampleA": "The organization is running a campaign to raise awareness of the dangers of drunk driving.",
        "exampleB": "We need to raise awareness of the importance of mental health in the workplace.",
        "exampleC": "The documentary aims to raise awareness of the plight of refugees around the world.",
        "status": "seen"
    },
    {
        "id": "87180af4-6c48-4891-a8ae-f8011e3d2748",
        "word": "recyclable",
        "persian": "قابل بازیافت",
        "definition": "\"Recyclable\" means that a material or product can be processed and reused to create new items, reducing waste and conserving resources. This process involves collecting, sorting, cleaning, and remanufacturing the material into something new. In essence, it's the ability to be transformed into something useful again instead of ending up in a landfill.\n\nSynonyms: reclaimable, reusable, recoverable, repurposable.\n",
        "exampleA": "The city encourages residents to use recyclable materials whenever possible.",
        "exampleB": "Make sure to check the symbol on the bottom to see if the container is recyclable.",
        "exampleC": "We need to switch to more recyclable packaging to reduce our environmental impact.",
        "status": "learned"
    },
    {
        "id": "634fe286-f75a-4948-9750-6b76f986bc6c",
        "word": "refuse",
        "persian": "فضولات، ،آشغال",
        "definition": "\"Refuse\" refers to unwanted or discarded matter; it's anything considered useless or worthless and is typically thrown away. It can include household trash, industrial waste, or any other form of debris.\n\nSynonyms: Garbage, waste, trash, rubbish, debris, scraps.\n",
        "exampleA": "I refuse to believe that story.",
        "exampleB": "The city must manage its refuse effectively.",
        "exampleC": "He offered help, but she had to refuse.",
        "status": "seen"
    },
    {
        "id": "b1a5dd67-c839-485d-a11b-3404da88a62d",
        "word": "species losses",
        "persian": "تلفات گونه های جانوری",
        "definition": "\"Species losses\" refers to the extinction or significant reduction in the population sizes of plant and animal species within a specific geographic area or globally. This decline in biodiversity can be caused by various factors, including habitat destruction, climate change, pollution, overexploitation, and invasive species. The term highlights the negative impact of human activities and natural events on the planet's ecosystem.\n\nSynonyms: biodiversity loss, extinction, defaunation, flora and fauna depletion\n",
        "exampleA": "Habitat destruction is a major driver of species losses around the world.",
        "exampleB": "Scientists are documenting accelerating species losses due to climate change.",
        "exampleC": "Conservation efforts aim to reduce species losses and maintain biodiversity.",
        "status": "seen"
    },
    {
        "id": "f5e3a3c6-108c-4dca-8807-00dc4bf66494",
        "word": "strain",
        "persian": "\"Strain\" بسته به متن می‌تونه معانی مختلفی داشته باشه، اما به طور کلی می‌تونه به \"فشار\"، \"تنش\"، \"کرنش\"، \"فشار روانی\" یا \"فشار آوردن\" ترجمه بشه.\n",
        "definition": "pressure",
        "exampleA": "The financial strain of the pandemic was felt by many families.",
        "exampleB": "I could hear the strain in her voice as she delivered the bad news.",
        "exampleC": "That last heavy lift caused a strain in my back.",
        "status": "seen"
    },
    {
        "id": "dda74bbc-c629-4bd1-ac08-ac44fdad3598",
        "word": "sustainable",
        "persian": "پایدار",
        "definition": "\"Sustainable\" describes something that can be maintained at a certain rate or level for a long time, often referring to practices or resources that can be used without depleting them or causing significant environmental damage. It emphasizes the ability to meet present needs without compromising the ability of future generations to meet their own needs.\n\nSynonyms: maintainable, renewable, enduring, viable, eco-friendly.\n",
        "exampleA": "sustainable energy",
        "exampleB": "The company is committed to using sustainable practices in its manufacturing processes.",
        "exampleC": "Sustainable energy sources, like solar and wind, are essential for reducing our carbon footprint.",
        "status": "seen"
    },
    {
        "id": "dd66382b-e0e5-4c6a-9563-2a7ad3bbb636",
        "word": "take its toll on sth",
        "persian": "عارضه بر جای گذاشتن بر چیزی",
        "definition": "\"Take its toll on something\" means to have a negative effect or impact on something over a period of time, gradually causing damage, depletion, or suffering. It implies a cumulative effect, where the repeated or prolonged exposure to something adverse weakens or deteriorates the subject.\n\nSynonyms: Impair, erode, wear down, exact a price, have a detrimental effect.\n",
        "exampleA": "The long hours at work began to take its toll on his health.",
        "exampleB": "The constant negativity in the news can take its toll on your mental well-being.",
        "exampleC": "Years of heavy use started to take its toll on the old car.",
        "status": "seen"
    },
    {
        "id": "a201fd27-7fb3-4ea8-90c6-dad33cc6a64f",
        "word": "taxing",
        "persian": "«Taxing» بسته به متن می‌تونه معانی مختلفی داشته باشه، اما به طور کلی می‌تونیم اون رو به «طاقت‌فرسا»، «سخت»، «دشوار»، یا «فشارآور» ترجمه کنیم.\n",
        "definition": "needing a lot of effort",
        "exampleA": "The job turned out to be more taxing than I'd expected.",
        "exampleB": "The long hike up the mountain was incredibly taxing.",
        "exampleC": "Dealing with customer complaints can be quite taxing on employees.",
        "status": "seen"
    },
    {
        "id": "3040868f-2365-432f-a0ed-2bfb84cb8227",
        "word": "the environment",
        "persian": "\"محیط زیست\" یا \"طبیعت\"\n",
        "definition": "\"The environment\" refers to the surroundings or conditions in which a person, animal, or plant lives or operates. It encompasses all the external factors, including physical, chemical, and biological elements, that influence and affect an organism or community. Essentially, it's the natural world around us, including the air, water, land, and all living things interacting within it.\n\nSynonyms: surroundings, ecosystem, habitat, nature, biosphere.\n",
        "exampleA": "Protecting the environment is crucial for future generations.",
        "exampleB": "The company is committed to reducing its impact on the environment.",
        "exampleC": "New policies are being implemented to improve the health of the environment.",
        "status": ""
    },
    {
        "id": "2e6d3b8c-e31a-47fd-a308-7a1e9af1f1df",
        "word": "threat",
        "persian": "\"تهدید\" یا \"خطر\"\n",
        "definition": "A threat is an expression of intent to inflict harm, injury, damage, or punishment on someone or something. It can be a statement, action, or circumstance that poses a danger or risk.\n\nSynonyms: menace, hazard, danger, intimidation, warning.\n",
        "exampleA": "The hurricane poses a significant threat to coastal communities.",
        "exampleB": "Cyberattacks are a growing threat to businesses of all sizes.",
        "exampleC": "His angry words felt like a veiled threat.",
        "status": ""
    },
    {
        "id": "27c977a5-3404-45b6-8c03-f9a6796ee34e",
        "word": "threaten",
        "persian": "تهدید کردن",
        "definition": "To threaten means to express an intention to inflict harm, injury, damage, or other hostile action on someone or something. It involves creating a sense of danger or impending negative consequences, aiming to intimidate or coerce the target into a certain behavior or outcome.\n\nSynonyms: menace, intimidate, endanger, jeopardize, warn.\n",
        "exampleA": "The approaching storm seemed to threaten the coastal town.",
        "exampleB": "He didn't mean to threaten her with his words.",
        "exampleC": "The company's financial difficulties began to threaten its employees' jobs.",
        "status": "seen"
    },
    {
        "id": "4c231593-d28a-458f-959c-4efdec66f56d",
        "word": "unattainable",
        "persian": "دست نیافتنی",
        "definition": "\"Unattainable\" describes something that is impossible to achieve or obtain, often due to being beyond one's reach, power, or resources. It implies a level of difficulty or improbability that renders the goal inaccessible.\n\nSynonyms: unachievable, impossible, out of reach, hopeless, infeasible.\n",
        "exampleA": "For many, a life of luxury is an unattainable dream.",
        "exampleB": "The summit seemed so close, yet remained frustratingly unattainable.",
        "exampleC": "Setting unrealistic goals can lead to feelings of failure when they prove unattainable.",
        "status": "seen"
    },
    {
        "id": "0cf8ee41-d409-4d9e-a3ca-527f768b3231",
        "word": "unfeasible",
        "persian": "میسرنشدنی",
        "definition": "\"Unfeasible\" means something is not capable of being done or carried out, often due to practical difficulties or a lack of necessary resources or conditions. It suggests that a plan or idea, while perhaps theoretically possible, is realistically impossible to achieve.\n\nSynonyms: impractical, impossible, unattainable, unworkable, unrealistic.\n",
        "exampleA": "Building a bridge across the Atlantic Ocean is currently unfeasible due to technological and economic limitations.",
        "exampleB": "The proposed timeline for completing the project was deemed unfeasible by the engineering team.",
        "exampleC": "Given the current budget constraints, implementing such a large-scale renovation is unfeasible.",
        "status": "seen"
    },
    {
        "id": "34164e35-6896-42ca-a4d6-5606810ae7f8",
        "word": "unlikely",
        "persian": "\"بعید\"، \"غیرمحتمل\" یا \"احتمال کم\" معادل‌های مناسبی برای \"unlikely\" هستند.\n",
        "definition": "\"Unlikely\" describes something that has a low probability of happening or being true. It suggests that the event or statement is improbable, doubtful, or not expected. Essentially, it indicates a low chance of success or realization.\n\nSynonyms: improbable, doubtful, questionable, slim, remote\n",
        "exampleA": "It's unlikely that it will rain today.",
        "exampleB": "She's an unlikely candidate for the job.",
        "exampleC": "Despite the odds, his success seemed unlikely.",
        "status": ""
    },
    {
        "id": "71a94060-59a8-41c8-8ffd-ac62ddd96775",
        "word": "unparalleled",
        "persian": "بی نظیر",
        "definition": "\"Unparalleled\" means having no equal or comparison; it's something that is supremely exceptional and stands alone in its category. It denotes a level of excellence, uniqueness, or intensity that is unmatched by anything else.\n\nSynonyms: unmatched, peerless, unrivaled, unique, incomparable.\n",
        "exampleA": "The museum boasts an unparalleled collection of ancient artifacts.",
        "exampleB": "Her dedication to the project was unparalleled, resulting in its overwhelming success.",
        "exampleC": "The view from the summit offered an unparalleled panorama of the surrounding mountains.",
        "status": "seen"
    },
    {
        "id": "9ac597ee-514f-4be0-a825-d589b9c835d6",
        "word": "unprecedented",
        "persian": "بی سابقه",
        "definition": "\"Unprecedented\" means something that has never happened, been done, or known before. It's a unique occurrence that lacks any prior example or parallel in history or experience. The scale, nature, or impact of the event is entirely novel.\n\nSynonyms: unparalleled, novel, groundbreaking, exceptional, unmatched.\n",
        "exampleA": "This century has witnessed environmental destruction on an unprecedented scale.",
        "exampleB": "The company experienced unprecedented growth in the last quarter.",
        "exampleC": "The storm caused unprecedented damage to the coastline.",
        "status": "seen"
    },
    {
        "id": "179daf9a-a105-4c62-929c-0a49c26b9851",
        "word": "unrealistic",
        "persian": "غیر واقع بینانه",
        "definition": "\"Unrealistic\" describes something not based on or reflecting reality, often used to characterize goals, plans, or expectations that are unlikely or impossible to achieve given the actual circumstances. It suggests a detachment from practical considerations and a focus on an idealized or improbable outcome.\n\nSynonyms: impractical, unattainable, fanciful, idealistic, utopian.\n",
        "exampleA": "Hoping to win the lottery is often considered unrealistic.",
        "exampleB": "The movie's plot was completely unrealistic, with characters defying the laws of physics.",
        "exampleC": "Setting a goal to lose 50 pounds in a week is highly unrealistic.",
        "status": "learned"
    },
    {
        "id": "64fb795f-9b88-4ca8-b57d-9ae8c7ed795b",
        "word": "unreasonable",
        "persian": "غیرمعقول",
        "definition": "\"Unreasonable\" describes something that is not guided by or based on good sense or sound judgment. It suggests an action, belief, or request that is excessive, unfair, or illogical given the circumstances. It often implies a lack of consideration for the practicalities or the feelings of others.\n\nSynonyms: irrational, illogical, absurd, preposterous, excessive.\n",
        "exampleA": "The landlord's demand for a year's rent upfront was completely unreasonable.",
        "exampleB": "Her constant complaints about the smallest details became unreasonable and exhausting.",
        "exampleC": "The judge ruled the company's pricing strategy as unreasonable and monopolistic.",
        "status": "learned"
    },
    {
        "id": "3cb1639b-0bcd-475e-b041-7d9fd816904c",
        "word": "useless",
        "persian": "بی فایده",
        "definition": "\"Useless\" describes something that is not serving any purpose or function, being ineffective, or failing to achieve a desired result. It implies a lack of value or practicality.\n\nSynonyms: pointless, futile, worthless, ineffective, unproductive\n",
        "exampleA": "The broken printer was completely useless.",
        "exampleB": "He felt useless after being laid off from his job.",
        "exampleC": "Arguing with him is useless; he never listens.",
        "status": "learned"
    },
    {
        "id": "b56209d1-fe4a-4f9e-a59f-c139e420cc4d",
        "word": "viable",
        "persian": "قابل اتکا و مناسب",
        "definition": "\"Viable\" means capable of working successfully; feasible. It describes something that has the potential to survive, be maintained, or function effectively under the given circumstances. A viable option is one that is practical and can realistically be achieved.\n\nSynonyms: Feasible, practical, workable, achievable, sustainable.\n",
        "exampleA": "Viable alternative/ option./ Will a hotel here be financially viable?",
        "exampleB": "The company presented a viable plan to increase profits.",
        "exampleC": "Solar power is a viable alternative to fossil fuels in many regions.",
        "status": "seen"
    },
    {
        "id": "5660a7ba-cbd1-42e5-abc6-a454e5b3acce",
        "word": "vital",
        "persian": "\"Vital\" بسته به متن می‌تونه به صورت‌های مختلفی ترجمه بشه، اما رایج‌ترین معادل‌های اون \"حیاتی\"، \"ضروری\" یا \"مهم\" هستند.\n",
        "definition": "\"Vital\" means absolutely necessary or essential for life, success, or continuation of something. It signifies something indispensable and critically important. Without it, the subject in question would likely fail or cease to exist.\n\nSynonyms: crucial, essential, indispensable, key, fundamental.\n",
        "exampleA": "Water is vital for all living things.",
        "exampleB": "A strong economy is vital to a country's success.",
        "exampleC": "It is vital that you arrive on time for the meeting.",
        "status": ""
    },
    {
        "id": "a3a31b9a-a16f-4529-aa09-2f128a33bc14",
        "word": "waste",
        "persian": "ضایعات",
        "definition": "\"Waste\" generally refers to any unwanted or unusable materials, substances, or byproducts that are discarded after use or are left over from a process. It can encompass anything from garbage and trash to unused energy or resources that are inefficiently utilized. Essentially, it's something that has no further intended purpose or value in its current form and is disposed of.\n\nSynonyms: debris, refuse, scrap, garbage, rubbish.\n",
        "exampleA": "Don't waste your time on things that don't matter.",
        "exampleB": "The factory's waste is polluting the river.",
        "exampleC": "It's a waste of money to buy something you don't need.",
        "status": "seen"
    },
    {
        "id": "1beae6aa-a74d-4fb1-aae1-d132cf391b9f",
        "word": "worthwhile",
        "persian": "\"Worthwhile\" در فارسی به معنی \"ارزشمند\"، \"با ارزش\"، \"سودمند\"، \"مفید\" یا \"شایسته\" است. انتخاب دقیق‌ترین معادل بستگی به متن دارد.\n",
        "definition": "\"Worthwhile\" describes something that is valuable, useful, or rewarding, making it worth the time, effort, or money spent on it. It signifies that the experience or activity provides benefits that justify the investment involved.\n\nSynonyms: valuable, beneficial, rewarding, useful, profitable.\n",
        "exampleA": "Volunteering at the animal shelter was a truly worthwhile experience.",
        "exampleB": "Investing in renewable energy sources is a worthwhile endeavor for the future.",
        "exampleC": "Reading classic literature is often considered a worthwhile pursuit for personal growth.",
        "status": ""
    }
]