[
    {
        "id": "42eb172a-a9bc-4347-ba72-8b10ad3da1bc",
        "word": "adapt",
        "persian": "\"Adapt\" بسته به متن می‌تونه به معانی مختلفی ترجمه بشه، اما رایج‌ترین معادل‌ها عبارتند از: \"تطبیق دادن\"، \"سازگار شدن\" یا \"اقتباس کردن\".\n",
        "definition": "To adapt means to adjust or modify oneself or something to fit new conditions or a different purpose. It involves changing behavior, strategies, or even physical characteristics to better survive or thrive in a particular environment or situation. It's about making necessary alterations to become suitable or compatible.\n\nSynonyms: adjust, modify, change, conform, accommodate, evolve.\n",
        "exampleA": "The chameleon can adapt its skin color to blend in with its surroundings.",
        "exampleB": "Businesses must adapt to changing market conditions to survive.",
        "exampleC": "It took him a while to adapt to the new school after moving.",
        "status": ""
    },
    {
        "id": "a5662b39-f0ef-42a3-b413-3dc1c5f6061a",
        "word": "agriculture",
        "persian": "کشاورزی به کشت و زرع گیاهان و پرورش دام برای تولید غذا و سایر محصولات گفته می‌شود.\n",
        "definition": "Agriculture is the science and art of cultivating plants and livestock. It encompasses a wide range of practices, including soil preparation, crop planting and harvesting, animal breeding, and the processing and marketing of agricultural products. It's the foundation of food production and a key component of many economies.\n\nSynonyms: farming, cultivation, husbandry, agronomy.\n",
        "exampleA": "Agriculture is the backbone of many rural communities.",
        "exampleB": "Sustainable agriculture practices are crucial for protecting the environment.",
        "exampleC": "Technological advancements are transforming the field of agriculture.",
        "status": ""
    },
    {
        "id": "febde3f4-9aa7-45e9-affc-b52e89de50d1",
        "word": "animal kingdom",
        "persian": "قلمرو حیوانات",
        "definition": "The \"animal kingdom,\" also known as Animalia, refers to the biological kingdom encompassing all animals. It represents the classification level directly below domain, grouping together multicellular, eukaryotic organisms that are heterotrophic (meaning they obtain nutrients by consuming other organisms) and generally capable of movement.\n\nSynonyms: Animalia, Fauna, Metazoa.\n",
        "exampleA": "The lion is often referred to as the king of the animal kingdom.",
        "exampleB": "Studying the diversity of life within the animal kingdom is a fascinating pursuit.",
        "exampleC": "Conservation efforts are crucial to protect endangered species throughout the entire animal kingdom.",
        "status": "learned"
    },
    {
        "id": "bb5e11a2-5b43-46ed-bb17-3c186721b01e",
        "word": "arid",
        "persian": "منطقه خیلی خشک",
        "definition": "\"Arid\" describes a land or climate that is extremely dry and has little or no rainfall. It suggests barrenness, infertility, and a lack of moisture necessary for plant life. A landscape described as arid often features deserts or areas with sparse vegetation.\n\nSynonyms: dry, parched, barren, desert, infertile.\n",
        "exampleA": "The desert is so arid that nothing can grow there.",
        "exampleB": "The arid desert landscape stretched for miles, offering little respite from the scorching sun.",
        "exampleC": "Years of drought had turned the once fertile farmland into an arid wasteland.",
        "status": "seen"
    },
    {
        "id": "ca6a454a-9942-47a1-989b-68a9d2bedddd",
        "word": "beak",
        "persian": "نوک پرندگان، منقار",
        "definition": "A \"beak\" is the hard, projecting mouth of a bird, used for feeding, preening, and defense. It's essentially a bird's jaw and lips combined into a single, often pointed structure.\n\nSynonyms: bill, neb, mandible (technically part of the beak)\n",
        "exampleA": "Birds use their beaks to pick up food.",
        "exampleB": "The parrot used its strong beak to crack open the nut.",
        "exampleC": "He pointed his nose, which she likened to a beak, towards the sky.",
        "status": "seen"
    },
    {
        "id": "5a099321-5786-43c8-a298-ad14cb9883c6",
        "word": "burrow",
        "persian": "\"Burrow\" بسته به متن می‌تونه معانی مختلفی داشته باشه، اما به طور کلی به معنی \"نقبی که حیوانات برای زندگی حفر می‌کنند\"، \"سوراخ\" یا \"مخفیگاه\" هست. فعلش هم می‌تونه به معنی \"نقبی حفر کردن\" یا \"پنهان شدن\" باشه.\n",
        "definition": "a hole in the ground dug by an animal such as a rabbit, especially to live in",
        "exampleA": "The rabbit disappeared into its burrow.",
        "exampleB": "Groundhogs burrow deep underground to create their homes.",
        "exampleC": "Archaeologists discovered an ancient burrow filled with artifacts.",
        "status": "seen"
    },
    {
        "id": "e6c6b66b-84cf-486a-80ea-6d87be5e5d74",
        "word": "bush",
        "persian": "بوته",
        "definition": "\"Bush\" typically refers to a shrub, a woody plant smaller than a tree, with multiple stems growing from the ground. It is often characterized by its dense, leafy growth and can be found in various habitats.\n\nSynonyms: shrub, thicket, scrub, hedge, bushland.\n",
        "exampleA": "a rose bush",
        "exampleB": "A small bird darted quickly into the nearby bush.",
        "exampleC": "The explorer hacked his way through the dense bush.",
        "status": "seen"
    },
    {
        "id": "e4ddb9e6-589e-48d3-bf95-e2f644e47c8e",
        "word": "cage",
        "persian": "قفس",
        "definition": "A cage is a structure, typically made of bars or mesh, designed to confine animals, birds, or even people, preventing them from escaping and restricting their movement. It symbolizes captivity, limitation, and a lack of freedom.\n\nSynonyms: enclosure, pen, coop, jail, prison.\n",
        "exampleA": "The lion roared ferociously from inside its cage.",
        "exampleB": "She felt trapped in a cage of her own making.",
        "exampleC": "The zookeeper carefully cleaned the bird's cage.",
        "status": "seen"
    },
    {
        "id": "f026a1be-c6ec-4219-a40d-a04a989223f4",
        "word": "catastrophic",
        "persian": "فاجعه انگیز، فجیع",
        "definition": "\"Catastrophic\" describes an event or situation that is extremely harmful, damaging, or destructive, often with long-lasting and devastating consequences. It implies a sudden and widespread disaster resulting in significant loss or suffering.\n\nSynonyms: disastrous, devastating, calamitous, tragic, ruinous.\n",
        "exampleA": "The hurricane caused catastrophic damage to the coastline.",
        "exampleB": "A catastrophic failure in the engine resulted in the plane crash.",
        "exampleC": "The oil spill had catastrophic consequences for the marine ecosystem.",
        "status": "seen"
    },
    {
        "id": "9b7097ca-6a70-4fb1-a997-4d6e2232183b",
        "word": "chemical spill",
        "persian": "نشت مواد شیمیایی",
        "definition": "A chemical spill refers to the accidental release of a hazardous or polluting substance from a container or system, posing a risk to the environment, human health, and property. These spills can range in size from small leaks to large-scale incidents and often require immediate containment and cleanup efforts.\n\nSynonyms: toxic release, hazardous material incident, contamination event, pollution discharge.\n",
        "exampleA": "The evacuation was ordered due to a dangerous chemical spill at the factory.",
        "exampleB": "Cleanup crews are working diligently to contain the chemical spill and prevent further environmental damage.",
        "exampleC": "The authorities are investigating the cause of the chemical spill to determine who is responsible.",
        "status": "seen"
    },
    {
        "id": "77433012-0951-4217-bc80-e75fcfc83eb2",
        "word": "claw",
        "persian": "چنگال حیوانات",
        "definition": "A claw is a sharp, curved nail or appendage found on the feet or hands of animals, primarily used for grasping, tearing, digging, climbing, and defense. It's a hardened extension of the digit that provides leverage and grip.\n\nSynonyms: talon, nail, hook, pincer.\n",
        "exampleA": "Our cat likes to sharpen her claws on the legs of the dining table.",
        "exampleB": "The cat extended its claw, snagging the loose thread.",
        "exampleC": "He used a metal claw to retrieve the dropped keys from the drain.",
        "status": "seen"
    },
    {
        "id": "bacd9b08-6d78-43a8-9d8c-2ae3b8ee39c7",
        "word": "climate",
        "persian": "\"Climate\" در فارسی معمولاً به \"اقلیم\" یا \"آب و هوا\" ترجمه می‌شود، اما \"اقلیم\" بیشتر برای توصیف الگوهای بلندمدت آب و هوایی استفاده می‌شود.\n",
        "definition": "\"Climate\" refers to the long-term average of weather conditions in a specific region or on Earth as a whole. It encompasses patterns of temperature, precipitation, humidity, wind, and sunshine over many years, typically 30 years or more. Climate dictates the kind of weather we can expect in a particular area, and is distinct from weather, which describes short-term atmospheric conditions.\n\nSynonyms: average weather, climatic conditions, prevailing weather, weather pattern, general weather.\n",
        "exampleA": "The Earth's climate is changing rapidly, leading to more extreme weather events.",
        "exampleB": "Scientists study the climate to understand long-term patterns and predict future trends.",
        "exampleC": "Sustainable practices are crucial to mitigate the negative impacts on the climate.",
        "status": ""
    },
    {
        "id": "f669a23b-25cf-4f35-bf7b-943f92b45edc",
        "word": "combat",
        "persian": "\"Combat\" در فارسی می‌تواند به معانی مختلفی مانند \"مبارزه\"، \"نبرد\"، \"درگیری\"، یا \"جنگ\" ترجمه شود. انتخاب دقیق‌ترین معادل به بافت جمله بستگی دارد.\n",
        "definition": "\"Combat\" refers to active fighting or conflict, especially between armed forces or individuals. It implies a direct and often violent engagement with an opponent, aiming to subdue, defeat, or eliminate them.\n\nSynonyms: battle, warfare, fighting, clash, engagement, skirmish\n",
        "exampleA": "The soldiers were trained in close-quarters combat.",
        "exampleB": "The documentary explored the ethical dilemmas of modern warfare combat.",
        "exampleC": "The company is looking for new ways to combat climate change.",
        "status": ""
    },
    {
        "id": "8510f6c0-f657-425d-924b-04354f3ecf1b",
        "word": "combat (sth)",
        "persian": "مبارزه کردن با",
        "definition": "To combat something means to actively fight against, resist, or work to prevent or reduce its negative effects. It implies a proactive and often sustained effort to overcome a challenge, problem, or threat.\n\nSynonyms: fight, battle, tackle, counter, resist, oppose\n",
        "exampleA": "to combat crime/terrorism/inflation/disease",
        "exampleB": "The government is trying to combat inflation with a series of new economic policies.",
        "exampleC": "We need to combat misinformation online to protect the integrity of our elections.",
        "status": "seen"
    },
    {
        "id": "9b2a942d-48d6-4fe3-af66-3b6938bc395e",
        "word": "crevice",
        "persian": "شکاف داخل سنگ یا پوست بدن انسان",
        "definition": "A crevice is a narrow opening or fissure, typically in a rock or wall, often formed by cracking or splitting. It implies a tight space or gap, smaller than a crack but large enough to be noticeable.\n\nSynonyms: crack, fissure, cleft, chink, gap\n",
        "exampleA": "The harsh light revealed every crevice and wrinkle in his face.",
        "exampleB": "The lizard darted into a crevice in the rock face.",
        "exampleC": "Dust and dirt had accumulated in every crevice of the antique furniture.",
        "status": "seen"
    },
    {
        "id": "903d79a2-d6b3-483b-b3ea-ea1a57b31c7e",
        "word": "crop",
        "persian": "محصول زراعی",
        "definition": "\"Crop\" refers to plants or plant products that are grown and harvested for human use, animal feed, or other economic purposes. It encompasses a wide variety of cultivated vegetation, from grains and fruits to vegetables and fibers.\nSynonyms: harvest, yield, produce, cultivated plants.\n",
        "exampleA": "The farmer expects a large wheat crop this year.",
        "exampleB": "The photographer decided to crop the image to remove the distracting background.",
        "exampleC": "Many ancient civilizations depended on the successful cultivation of a staple crop.",
        "status": "seen"
    },
    {
        "id": "2bb997b9-9988-480b-a728-dc32e61681b8",
        "word": "crop(s)",
        "persian": "\"Crop\" در کشاورزی به معنی \"محصول\" یا \"کشت\" است و \"crops\" به معنی \"محصولات\" یا \"کشتزارها\".\n",
        "definition": "\"Crops\" refers to plants, typically cultivated for human consumption, animal feed, or commercial use. These are usually grown on a large scale in agricultural settings, providing a staple source of food, fiber, and other resources.\n\nSynonyms: harvest, produce, yield, cultivated plants, agricultural products.\n",
        "exampleA": "The farmer harvested his corn crop earlier than expected.",
        "exampleB": "This year's crops suffered from a severe drought.",
        "exampleC": "Diversifying their crops helped the farmers protect themselves from market volatility.",
        "status": ""
    },
    {
        "id": "09d6924d-9a51-4a74-bc59-1e83e9d27e9e",
        "word": "cultivate",
        "persian": "کشت کردن",
        "definition": "To cultivate means to foster the growth of something, whether it's plants, relationships, or skills. It involves actively working to improve and develop something over time through careful attention and effort. This can involve nurturing, refining, and shaping it to reach its full potential.\n\nSynonyms: Nurture, foster, develop, grow, refine.\n",
        "exampleA": "The villagers cultivate mostly maize and beans.",
        "exampleB": "The farmer worked hard to cultivate the land.",
        "exampleC": "She wanted to cultivate a more positive attitude.",
        "status": "seen"
    },
    {
        "id": "8c612560-9f03-49b5-a555-e11c99ae763f",
        "word": "daisy",
        "persian": "گل آفتابگردان",
        "definition": "A daisy is a common and cheerful flower characterized by its bright yellow center disc surrounded by white petals (though other colors exist). It symbolizes innocence, purity, beauty, and new beginnings.\nSynonyms: Bellis perennis, marguerite, ox-eye daisy\n",
        "exampleA": "The field was filled with daisies, their white petals shimmering in the sunlight.",
        "exampleB": "She wore a daisy in her hair, a simple touch that added to her charm.",
        "exampleC": "My grandmother always had a vase of fresh daisies on her kitchen table.",
        "status": "seen"
    },
    {
        "id": "02c4307c-764e-4b1c-954f-386b7924d8b5",
        "word": "decline",
        "persian": "زوال و کاهش",
        "definition": "\"Decline\" means to gradually worsen in quality, strength, or number; it implies a movement downward or a decrease from a previous state. It can also refer to politely refusing an invitation or offer.\n\nSynonyms: deteriorate, diminish, decrease, refuse, reject.\n",
        "exampleA": "The company's profits began to decline sharply last quarter.",
        "exampleB": "He had to decline the invitation due to a prior engagement.",
        "exampleC": "There has been a steady decline in the number of students studying Latin.",
        "status": "seen"
    },
    {
        "id": "695beaf5-4d0f-475c-85ef-f52def1ebe86",
        "word": "den",
        "persian": "معنی کلمه \"den\" بستگی به زمینه داره. ممکنه به موارد زیر اشاره داشته باشه:\n\n   لانه/مأوا: به عنوان مثال، لانه حیوانات وحشی.\n   اتاق کوچک/غرفه: یک اتاق خصوصی و دنج در خانه.\n   مخفیگاه: یک مکان پنهان برای فعالیت‌های خاص.\n",
        "definition": "the home of particular types of wild animal",
        "exampleA": "The fox retreated into its den as the hunter approached.",
        "exampleB": "We explored the hidden den, hoping to find treasure.",
        "exampleC": "The bear family emerged from their den in the springtime.",
        "status": "seen"
    },
    {
        "id": "dbe37a61-1ada-4b2e-81e1-93bcb7afdcff",
        "word": "disaster",
        "persian": "مصیبت، بلا",
        "definition": "A disaster is a sudden event that causes widespread damage, destruction, loss of life, and significant disruption to the normal functioning of a community or society. These events can be natural, like hurricanes or earthquakes, or man-made, such as industrial accidents or terrorist attacks, and they often overwhelm local resources, requiring outside assistance for recovery.\n\nSynonyms: catastrophe, calamity, tragedy, emergency.\n",
        "exampleA": "The earthquake was a major disaster, leaving thousands homeless.",
        "exampleB": "Losing the championship game was a complete disaster for the team.",
        "exampleC": "The company's financial disaster led to mass layoffs.",
        "status": "learned"
    },
    {
        "id": "8e39c070-e39a-48ce-81a4-3ad8c58bc933",
        "word": "disastrous",
        "persian": "\"فاجعه‌آمیز\"، \"ویرانگر\"، \"بسیار بد\" یا \"فاجعه‌بار\" معادل‌های مناسبی برای کلمه \"disastrous\" هستند. انتخاب بین این‌ها بستگی به بافت جمله دارد.\n",
        "definition": "extremely bad or unsuccessful",
        "exampleA": "Such a war would be disastrous for the country.",
        "exampleB": "The hurricane had a disastrous impact on the coastal communities.",
        "exampleC": "Their ill-conceived business plan led to a disastrous financial outcome.",
        "status": "learned"
    },
    {
        "id": "292240a6-93e8-4460-9493-f1a97b84bae6",
        "word": "domesticated",
        "persian": "اهلی (مربوط به حیوانات) و خانگی (مربوط به انسانها)ه",
        "definition": "\"Domesticated\" refers to the process by which wild animals or plants are adapted over generations to live in close association with humans, becoming accustomed to human care and often selectively bred for desired traits. It implies a shift from living independently in a natural environment to being reliant on and benefiting from a human-controlled environment.\n\nSynonyms: tamed, cultivated, trained, housebroken.\n",
        "exampleA": "Dogs are the most commonly domesticated animals.",
        "exampleB": "The farmer domesticated wild grains to produce more reliable crops.",
        "exampleC": "Over generations, the rabbits became more domesticated and comfortable around humans.",
        "status": "seen"
    },
    {
        "id": "7929e807-8e34-4747-abdd-6e3317610085",
        "word": "ecological balance",
        "persian": "تعادل زیست محیطی",
        "definition": "Ecological balance refers to a stable state within an ecosystem where populations of organisms are in equilibrium with each other and with their environment, ensuring the sustainability of life. It implies that resources are used at a rate that allows for their regeneration, and that species interactions (predation, competition, symbiosis) maintain a healthy and diverse community.\n\nSynonyms: Balance of nature, ecosystem stability, environmental equilibrium, natural harmony\n",
        "exampleA": "The introduction of invasive species can disrupt the ecological balance of an ecosystem.",
        "exampleB": "Sustainable practices are crucial for maintaining the ecological balance and ensuring long-term environmental health.",
        "exampleC": "Deforestation has a significant impact on the ecological balance, leading to soil erosion and loss of biodiversity.",
        "status": "learned"
    },
    {
        "id": "ede3d7a6-7e66-429b-bf9f-7e20c8fafea4",
        "word": "ecology",
        "persian": "بوم‌شناسی یا اکولوژی، مطالعهٔ روابط بین موجودات زنده و محیط زیست آن‌ها است.\n",
        "definition": "Ecology is the study of the relationships between living organisms and their physical environment. It explores how organisms interact with each other (biotic factors) and their surroundings (abiotic factors) to form complex ecosystems. Essentially, it's about understanding the web of life and how different components fit together to sustain it.\n\nSynonyms: environmental science, bionomics, natural history, environmental biology.\n",
        "exampleA": "The professor lectured on the complex interactions within the forest's ecology.",
        "exampleB": "Protecting the delicate ecology of the wetlands is crucial for many species.",
        "exampleC": "Human activity can have a devastating impact on the local ecology.",
        "status": ""
    },
    {
        "id": "b7c30651-5df1-4e69-b7d6-b46c684a3c5c",
        "word": "endangered",
        "persian": "در معرض خطر",
        "definition": "\"Endangered\" describes a species or population that faces a very high risk of extinction in the near future. This means that the number of individuals is critically low, and they are likely to disappear entirely if protective measures aren't taken. The threats leading to endangerment often include habitat loss, poaching, climate change, and pollution.\n\nSynonyms: threatened, imperiled, at risk, vulnerable.\n",
        "exampleA": "The snow leopard is an endangered species.",
        "exampleB": "Habitat loss has made the Iberian lynx endangered.",
        "exampleC": "We must protect endangered languages from disappearing.",
        "status": "seen"
    },
    {
        "id": "fdf32fa5-bb94-4dac-a51b-01a6d46bf352",
        "word": "eradicate",
        "persian": "ریشه کن کردن",
        "definition": "\"Eradicate\" means to completely destroy or eliminate something, usually something negative or harmful, so that it no longer exists. It implies a permanent and thorough removal.\n\nSynonyms: Eliminate, abolish, obliterate, wipe out, extinguish, extirpate.\n",
        "exampleA": "The goal is to eradicate poverty in the region within the next decade.",
        "exampleB": "We must work together to eradicate prejudice and discrimination from our society.",
        "exampleC": "The new pesticide was highly effective in eradicating the invasive species from the island.",
        "status": "seen"
    },
    {
        "id": "09ca321d-8cda-4b87-8a66-fcb6f58f32d7",
        "word": "evolution",
        "persian": "تکامل",
        "definition": "Evolution refers to the gradual process of change and development in living organisms over generations, leading to the diversity of life we see on Earth. This process occurs through natural selection, where advantageous traits become more common in a population over time.\n\nSynonyms: development, progression, adaptation, change, growth\n",
        "exampleA": "The theory of evolution explains the diversity of life on Earth.",
        "exampleB": "Technology is undergoing rapid evolution, constantly changing and improving.",
        "exampleC": "The evolution of language is a complex process that spans millennia.",
        "status": "learned"
    },
    {
        "id": "a02d6bfe-71a9-4c3f-bc8b-554cacd269f9",
        "word": "evolve",
        "persian": "\"Evolve\" در فارسی معمولاً به صورت \"تکامل یافتن\"، \"توسعه یافتن\" یا \"پیشرفت کردن\" ترجمه می‌شود که بسته به متن و مفهوم مورد نظر، یکی از این معادل‌ها مناسب‌تر خواهد بود.\n",
        "definition": "Evolve means to gradually develop or change over time, often into a more complex or advanced form. It implies a process of adaptation and transformation in response to changing circumstances or environments.\n\nSynonyms: develop, progress, advance, grow, transform.\n",
        "exampleA": "The company needs to evolve its marketing strategy to reach a younger audience.",
        "exampleB": "Over time, the simple cell evolved into complex multicellular organisms.",
        "exampleC": "His understanding of the subject continued to evolve as he gained more experience.",
        "status": ""
    },
    {
        "id": "18b50c0f-a820-4281-834b-5d564658208d",
        "word": "extinct",
        "persian": "منقرض",
        "definition": "\"Extinct\" describes the state of a species or other group of organisms that no longer exists on Earth. It signifies that all members of the species have died out, leaving no living representatives to continue its lineage. This can be due to various factors like habitat loss, climate change, disease, or overhunting.\n\nSynonyms: vanished, defunct, died out, lost, terminated.\n",
        "exampleA": "There is concern that the giant panda will soon become extinct.",
        "exampleB": "Dinosaurs are extinct, having disappeared millions of years ago.",
        "exampleC": "Many languages are becoming extinct due to globalization.",
        "status": "learned"
    },
    {
        "id": "720877ca-edf9-4540-86e1-b5b6ba8b5007",
        "word": "extinction",
        "persian": "انقراض",
        "definition": "Extinction signifies the complete disappearance of a species from Earth, representing the termination of a lineage with no surviving members. It can occur naturally over long periods or be accelerated by factors like habitat destruction, climate change, and overexploitation. The process is irreversible, marking a permanent loss of biodiversity.\n\nSynonyms: annihilation, demise, eradication, obliteration, dying out.\n",
        "exampleA": "The dodo bird is a well-known example of extinction caused by human activity.",
        "exampleB": "Scientists are working to prevent the extinction of endangered species through conservation efforts.",
        "exampleC": "The asteroid impact is believed to have caused a mass extinction event that wiped out the dinosaurs.",
        "status": "learned"
    },
    {
        "id": "616d0b8b-b0eb-4213-8924-f10bb1cdd314",
        "word": "farm field",
        "persian": "زمین کشاورزی",
        "definition": "A farm field is a plot of land on a farm specifically cultivated for growing crops or grazing livestock. It's an area where agricultural activities take place to produce food, fiber, or other agricultural products.\n\nSynonyms: agricultural field, arable land, cultivated field, cropland, pasture.\n",
        "exampleA": "The combine harvester rumbled across the vast farm field.",
        "exampleB": "We walked along the edge of the farm field, watching the sunset.",
        "exampleC": "Scarecrows stood guard in the middle of the farm field, protecting the crops.",
        "status": "seen"
    },
    {
        "id": "ff7e5b9c-f101-45fc-b493-ef5e4246e347",
        "word": "fauna",
        "persian": "جانداران یک منطقه یا برهه ای از تاریخ، حیات وحش",
        "definition": "\"Fauna\" refers to all the animals of a particular region, habitat, or geological period. It encompasses the diverse animal life, ranging from microscopic organisms to large mammals, that exist within a specific environment or time frame.\n\nSynonyms: animal life, wildlife, animal kingdom, creatures.\n",
        "exampleA": "The diverse fauna of the Amazon rainforest is unparalleled.",
        "exampleB": "Protecting the local fauna is crucial for maintaining the ecological balance.",
        "exampleC": "Scientists are studying the impact of climate change on the mountain fauna.",
        "status": "seen"
    },
    {
        "id": "b24fb30a-cd9c-4ef7-b0df-bb6a3ab394c0",
        "word": "feathers",
        "persian": "پر پرندگان",
        "definition": "Feathers are lightweight, keratinous outgrowths that form a bird's plumage, providing insulation, enabling flight, and serving as visual displays. They are uniquely avian structures essential for survival and adaptation.\n\nSynonyms: plumage, quillage, down, plume, hackle\n",
        "exampleA": "The bird ruffled its feathers in the cold morning air.",
        "exampleB": "She wore a hat adorned with colorful feathers.",
        "exampleC": "A light breeze scattered feathers across the garden.",
        "status": "learned"
    },
    {
        "id": "594a4a98-664e-405f-bd32-b074efe9fa07",
        "word": "flora",
        "persian": "گیاهان یک منطقه یا برهه ای از تاریخ",
        "definition": "\"Flora\" refers to all the plant life present in a particular region or time period. It encompasses everything from trees and shrubs to herbs and mosses, essentially defining the plant community of an area.\n\nSynonyms: vegetation, plant life, plant kingdom, botanical life.\n",
        "exampleA": "The diverse flora of the Amazon rainforest is critical to the planet's ecosystem.",
        "exampleB": "She studied the local flora as part of her botany degree.",
        "exampleC": "The delicate flora in the meadow was protected from trampling.",
        "status": "learned"
    },
    {
        "id": "87e06630-ff45-4f35-9bc4-c21e4ab7d8f5",
        "word": "fur",
        "persian": "خز حیوانات",
        "definition": "Fur is the dense coat of soft hair covering the body of many mammals, providing insulation and protection from the elements. It's composed of two layers: a shorter, dense underfur for warmth and longer, coarser guard hairs for protection.\n\nSynonyms: pelt, coat, fleece, hide, hair.\n",
        "exampleA": "The kitten's fur was incredibly soft.",
        "exampleB": "She wore a coat trimmed with faux fur.",
        "exampleC": "Dog fur allergies are quite common.",
        "status": "learned"
    },
    {
        "id": "7c0b0314-74d9-4e79-b2c7-aa8926c14aa8",
        "word": "genetically-modified",
        "persian": "دستکاری ژنتیکی شده",
        "definition": "\"Genetically-modified\" refers to an organism whose genetic material has been altered using genetic engineering techniques. This often involves inserting or deleting specific genes to introduce desirable traits, such as pest resistance in crops or increased milk production in livestock. It's a deliberate and targeted change to the organism's DNA, unlike traditional breeding methods which rely on natural selection and cross-breeding.\n\nSynonyms: GM, bioengineered, transgenic, genetically engineered.\n",
        "exampleA": "Many debates surround the use of genetically-modified organisms in agriculture.",
        "exampleB": "The company specializes in producing genetically-modified seeds that are resistant to pests.",
        "exampleC": "Studies are being conducted to assess the long-term health effects of consuming genetically-modified foods.",
        "status": "learned"
    },
    {
        "id": "e73261c6-d277-42bc-9dac-183ec60a0da2",
        "word": "genetics",
        "persian": "\"ژنتیک\" در فارسی به دانش و علم وراثت و انتقال صفات از والدین به فرزندان اشاره دارد.\n",
        "definition": "Genetics is the scientific study of heredity, focusing on how traits and characteristics are passed down from parents to offspring through genes, which are segments of DNA that contain instructions for building and operating an organism. It encompasses the study of genes, their structure, function, variation, and how these factors influence development and evolution.\n\nSynonyms: heredity, inheritance, genomics, eugenics (historical/controversial)\n",
        "exampleA": "Her interest in genetics led her to pursue a degree in molecular biology.",
        "exampleB": "The study of genetics helps us understand the inheritance of traits.",
        "exampleC": "Advances in genetics have revolutionized the field of medicine.",
        "status": ""
    },
    {
        "id": "bd893939-c1ad-4127-8995-e0dbde056ca1",
        "word": "greenhouse",
        "persian": "گلخانه",
        "definition": "A greenhouse is a structure, often made of glass or plastic, used to cultivate plants. It traps solar radiation, warming the interior and creating a controlled environment that protects plants from harsh weather, pests, and diseases, allowing for year-round or extended growing seasons.\n\nSynonyms: glasshouse, hothouse, conservatory, forcing house\n",
        "exampleA": "The gardener grows tomatoes and peppers in the greenhouse.",
        "exampleB": "Scientists use a greenhouse model to study the effects of climate change.",
        "exampleC": "The old greenhouse needed repairs after the storm.",
        "status": "seen"
    },
    {
        "id": "2eba4b0b-4061-438e-89da-96ec9d75e6eb",
        "word": "grow",
        "persian": "کاشتن گیاه به منظور فروش",
        "definition": "\"Grow\" signifies an increase in size, quantity, or development over time. It encompasses the process of maturing physically, expanding in number or scope, or evolving in knowledge and understanding. It generally implies progress or a change towards a more advanced or larger state.\nSynonyms: develop, expand, mature, increase, flourish.\n",
        "exampleA": "The villagers grow coffee and maize to sell in the market.",
        "exampleB": "The plants will grow quickly in the rich soil.",
        "exampleC": "I hope my confidence will grow as I gain more experience.",
        "status": "learned"
    },
    {
        "id": "02d38c88-cd9a-4a95-938f-bc07c31e4cfd",
        "word": "habitat",
        "persian": "محل سکونت ،مسکن طبيعى ،بوم ،جاى اصلى",
        "definition": "A habitat is the natural environment where an organism lives, providing it with the resources like food, water, shelter, and space it needs to survive and reproduce. It encompasses all the physical and biological elements surrounding an organism, influencing its survival and evolution.\n\nSynonyms: environment, home, territory, surroundings, ecosystem\n",
        "exampleA": "The panda's natural habitat is in the bamboo forests of China.",
        "exampleB": "Deforestation is a major threat to the habitat of many animal species.",
        "exampleC": "This aquarium provides a simulated habitat for a variety of marine life.",
        "status": "learned"
    },
    {
        "id": "5c7ba9ee-7447-429a-a02a-8f21e8a36020",
        "word": "hawk",
        "persian": "شاهین",
        "definition": "A \"hawk,\" in the context of political or economic discussion, typically refers to someone who favors aggressive or assertive policies, often involving the use of military force or strong economic pressure. They are often seen as being more willing to take risks and prioritize national interests over diplomacy or cooperation.\n\nSynonyms: warmonger, militarist, hardliner, belligerent, interventionist\n",
        "exampleA": "The hawk soared effortlessly above the fields, searching for prey.",
        "exampleB": "He has a sharp eye for detail, like a hawk watching its target.",
        "exampleC": "Some politicians are described as hawks due to their aggressive foreign policy stances.",
        "status": "seen"
    },
    {
        "id": "e1e3aa8a-46d8-4182-91ef-c192d6abb3bb",
        "word": "hibernate",
        "persian": "در خواب زمستانی رفتن",
        "definition": "To hibernate means to spend the winter in a dormant or inactive state, characterized by lower body temperature, slower breathing, and reduced metabolic rate. Animals hibernate to conserve energy when food is scarce and environmental conditions are harsh.\n\nSynonyms: Sleep, dormant, estivate (though estivate is more commonly used for summer dormancy), vegetate, lie inactive.\n",
        "exampleA": "The turtle hibernates in a shallow burrow for six months of the year.",
        "exampleB": "Bears hibernate during the winter to conserve energy.",
        "exampleC": "My computer is set to hibernate after 30 minutes of inactivity.",
        "status": "seen"
    },
    {
        "id": "2df51687-6468-42b1-9b47-1e7b2bb03c27",
        "word": "hide",
        "persian": "معنی اصلی \"hide\" در فارسی \"مخفی کردن\"، \"پنهان کردن\" یا \"قایم کردن\" است. بسته به متن، می‌توان از معادل‌های دیگری مانند \"نهان کردن\" یا \"پوشاندن\" نیز استفاده کرد.\n",
        "definition": "the strong, thick skin of an animal, used for making leather",
        "exampleA": "The children like to hide in the closet during hide-and-seek.",
        "exampleB": "I tried to hide my disappointment when I didn't get the job.",
        "exampleC": "The sun began to hide behind the clouds as the storm approached.",
        "status": "seen"
    },
    {
        "id": "ea7914a4-0330-4c55-bf19-aaca0e7f476a",
        "word": "human nature",
        "persian": "طبیعت انسان",
        "definition": "\"Human nature\" refers to the fundamental characteristics, including ways of thinking, feeling, and behaving, that humans tend to have naturally and independently of specific cultural influences. It encompasses both inherent biological predispositions and shared psychological traits that are considered universal to humankind. In essence, it's what makes us \"human\" at a core level.\n\nSynonyms: inherent character, humanity, natural disposition, innate qualities\n",
        "exampleA": "The story explores the darker aspects of human nature, revealing the capacity for both cruelty and compassion.",
        "exampleB": "It's human nature to seek connection and belonging.",
        "exampleC": "Politicians often appeal to basic instincts of human nature to gain support.",
        "status": "learned"
    },
    {
        "id": "a9941b50-eb10-48f9-88da-45338bf50592",
        "word": "insect",
        "persian": "حشره",
        "definition": "An insect is a small, invertebrate animal that belongs to the class Insecta, characterized by having a three-part body (head, thorax, and abdomen), six legs, compound eyes, and usually two pairs of wings. They are the most diverse group of animals on Earth, found in nearly all environments.\n\nSynonyms: bug, arthropod, creepy-crawly, critter.\n",
        "exampleA": "The child was fascinated by the colorful insect crawling on the leaf.",
        "exampleB": "Many birds rely on insects as a primary food source.",
        "exampleC": "Scientists are studying the impact of climate change on insect populations.",
        "status": "learned"
    },
    {
        "id": "ada21a40-566c-4987-9ad7-4e1d591d75ad",
        "word": "introduced",
        "persian": "غیر بومی",
        "definition": "\"Introduced\" means to present someone or something to another person or group for the first time, making them known or familiar. It can also mean to bring something new into a situation or context.\n\nSynonyms: presented, initiated, unveiled, launched, acquainted.\n",
        "exampleA": "The CEO introduced a new company strategy at the annual meeting.",
        "exampleB": "She introduced me to her best friend at the party.",
        "exampleC": "The professor introduced the concept of quantum physics in the lecture.",
        "status": "learned"
    },
    {
        "id": "918a9d43-0948-4388-8755-abd13bffcd0e",
        "word": "kangaroo",
        "persian": "کانگرو",
        "definition": "A kangaroo is a large marsupial native to Australia, characterized by its powerful hind legs, a long tail used for balance, and a pouch on the mother's abdomen for carrying young. They are known for their hopping locomotion and are a symbol of Australia.\n\nSynonyms: marsupial, roo, Aussie jumper.\n",
        "exampleA": "The kangaroo hopped across the Australian outback.",
        "exampleB": "We saw a mother kangaroo with a joey in her pouch at the zoo.",
        "exampleC": "Kangaroo meat is sometimes used in pet food.",
        "status": "learned"
    },
    {
        "id": "4d07f7e6-1edc-436f-a16b-959a1f282b31",
        "word": "koala",
        "persian": "کوآلا",
        "definition": "A koala is an arboreal herbivorous marsupial native to Australia. It's easily recognizable by its stout, tailless body, large head, round fluffy ears, and leathery nose. Koalas primarily eat eucalyptus leaves and spend most of their lives in trees.\n\nSynonyms: Koala bear, native bear, Phascolarctos cinereus (scientific name)\n",
        "exampleA": "The koala munched contentedly on eucalyptus leaves.",
        "exampleB": "We spotted a sleepy koala clinging to a branch in the national park.",
        "exampleC": "The zookeeper carefully monitored the baby koala's health.",
        "status": "learned"
    },
    {
        "id": "2a8b13be-cc4f-4691-9b3b-6824f5407c84",
        "word": "lizard",
        "persian": "مارمولک",
        "definition": "A lizard is a type of reptile, characterized by its scaly skin, four legs (though some have none), and ability to shed its tail as a defense mechanism. They are incredibly diverse, found in a wide range of habitats and varying greatly in size, color, and behavior.\n\nSynonyms: reptile, saurian, gecko, iguana, chameleon\n",
        "exampleA": "A small green lizard darted across the sunny patio.",
        "exampleB": "The boy carefully caught the lizard and showed it to his sister.",
        "exampleC": "Scientists study the diverse species of lizards found in the rainforest.",
        "status": "seen"
    },
    {
        "id": "0f5fe6ff-9c1c-443c-a5ff-ad4bd99f45eb",
        "word": "man-made disaster",
        "persian": "بلای با منشا انسانی",
        "definition": "A man-made disaster refers to a catastrophic event or tragedy that is primarily caused by human actions, negligence, or failures, rather than natural forces. These disasters often stem from technological accidents, industrial mishaps, infrastructure failures, deliberate acts of violence, or failures in planning and response.\n\nSynonyms: human-caused disaster, anthropogenic disaster, technological disaster, industrial accident.\n",
        "exampleA": "The oil spill was a man-made disaster that devastated the coastline.",
        "exampleB": "The Chernobyl accident is considered one of the worst man-made disasters in history.",
        "exampleC": "Poor urban planning can lead to man-made disasters like severe flooding.",
        "status": "learned"
    },
    {
        "id": "f5ab70a1-746b-4c22-92f7-e50191768c33",
        "word": "moth",
        "persian": "شب پره، بید",
        "definition": "A moth is a nocturnal insect closely related to butterflies. They are characterized by their feathery or comb-like antennae and their tendency to fold their wings flat along their body when at rest. Moths come in a vast array of colors, sizes, and patterns and play a crucial role in pollination and the food chain.\n\nSynonyms: Lepidopteran, miller, night butterfly.\n",
        "exampleA": "A moth fluttered around the porch light on the warm summer evening.",
        "exampleB": "The old wool sweater was riddled with holes, the victim of hungry moths.",
        "exampleC": "She felt like a moth drawn to the flame, unable to resist the allure despite the danger.",
        "status": "seen"
    },
    {
        "id": "eef14db3-1579-497a-85af-a2d5e92a5a4a",
        "word": "Mother Nature",
        "persian": "مادر طبیعت",
        "definition": "\"Mother Nature\" is a common personification of the natural world, representing the collective forces of the environment, including weather, ecosystems, and the earth itself. It embodies the nurturing and generative qualities of nature, as well as its capacity for both creation and destruction. It's often used to describe nature's power and beauty, and sometimes to convey a sense of responsibility towards environmental stewardship.\n\nSynonyms: Nature, the Environment, Mother Earth, the Natural World, the Ecosystem\n",
        "exampleA": "The vibrant colors of autumn leaves are a testament to the artistry of Mother Nature.",
        "exampleB": "We must strive to protect our planet and respect the power of Mother Nature.",
        "exampleC": "The raging storm showed the unforgiving side of Mother Nature.",
        "status": "learned"
    },
    {
        "id": "f3f251a7-ae66-4dd0-9606-96e3ead8cc80",
        "word": "native",
        "persian": "بومی",
        "definition": "\"Native\" refers to a person, animal, or plant that originated in a particular place or region. It describes something that is indigenous and has not been brought in from somewhere else. It can also describe a person who was born in a specific place and has a strong connection to it.\n\nSynonyms: indigenous, aboriginal, local, original, endemic.\n",
        "exampleA": "The kangaroo is native to Australia.",
        "exampleB": "She speaks French as a native.",
        "exampleC": "He enjoyed learning about the native plants of the region.",
        "status": "learned"
    },
    {
        "id": "4310a9ba-ea3d-4597-a136-f4178d29b59d",
        "word": "natural",
        "persian": "طبیعی، ذاتی، بکر یا نرمال بسته به متن.\n",
        "definition": "\"Natural\" refers to something that exists or originates in nature and is not made or caused by humans. It implies a state of being free from artificial additives, processing, or intervention, and often suggests a sense of purity, authenticity, and inherent goodness.\n\nSynonyms: organic, genuine, real, native, inherent.\n",
        "exampleA": "The park's beauty felt natural and untouched by human hands.",
        "exampleB": "Her talent for singing seemed completely natural; she barely had to try.",
        "exampleC": "Choosing organic foods is a more natural approach to healthy eating.",
        "status": ""
    },
    {
        "id": "8e744d9f-607d-4f71-b868-f025392c9282",
        "word": "nest",
        "persian": "لانه پرندگان",
        "definition": "A nest is a structure built by birds or other animals to hold their eggs and/or provide a safe place to raise their young. It's essentially a home specifically designed for nurturing offspring, offering protection from predators and the elements.\n\nSynonyms: den, lair, aerie, brood, hatchery.\n",
        "exampleA": "The birds built a cozy nest in the old oak tree.",
        "exampleB": "The abandoned nest was filled with fallen leaves and twigs.",
        "exampleC": "She carefully placed the fragile egg back into the nest.",
        "status": "learned"
    },
    {
        "id": "89331c90-3720-440f-a97c-c4c34e7a2d12",
        "word": "paw",
        "persian": "پنجه حیوانات مثل گربه و خرس",
        "definition": "A paw is the soft foot of an animal, typically a quadruped mammal, that has claws or nails. It's used for walking, running, scratching, digging, and grasping.\n\nSynonyms: foot, pad, trotter, extremity\n",
        "exampleA": "I found paw prints in the kitchen.",
        "exampleB": "The kitten batted playfully at the toy with its paw.",
        "exampleC": "He extended his paw for a handshake.",
        "status": "seen"
    },
    {
        "id": "4ca1eef0-2c04-4415-9013-1590d5e741c3",
        "word": "pear",
        "persian": "گلابی",
        "definition": "A pear is a sweet, juicy fruit that is wider at the bottom and tapers towards the stem. It typically has a yellowish-green skin, though some varieties can be red or brown.\n\nSynonyms: fruit, pear tree fruit, pomaceous fruit.\n",
        "exampleA": "She bit into the juicy pear, savoring its sweetness.",
        "exampleB": "The still life painting featured a bowl of apples and a single pear.",
        "exampleC": "He decided to bake a pear tart for dessert.",
        "status": "seen"
    },
    {
        "id": "e4c16edd-7f1c-4135-8d1f-002440479de8",
        "word": "pest",
        "persian": "آفت",
        "definition": "A \"pest\" is generally understood as an unwanted organism (animal, plant, or insect) that causes harm, annoyance, or damage to crops, property, humans, or animals. It's a broad term used to describe anything considered troublesome and destructive in a specific context.\n\nSynonyms: nuisance, irritant, blight, vermin, scourge\n",
        "exampleA": "That mosquito is such a pest, buzzing around my head.",
        "exampleB": "My little brother can be a real pest when he wants attention.",
        "exampleC": "The aphids were a terrible pest on my rose bushes this year.",
        "status": "seen"
    },
    {
        "id": "43541bae-984a-44ae-9d5b-795230c276ac",
        "word": "pesticide",
        "persian": "آفت کش",
        "definition": "A pesticide is a substance used to kill, repel, or control pests, which can include insects, weeds, fungi, rodents, and other organisms that can damage crops, property, or human health. They are designed to target specific organisms or a broad range of pests to protect valuable resources.\n\nSynonyms: Insecticide, herbicide, fungicide, rodenticide.\n",
        "exampleA": "The farmer sprayed pesticide on the crops to protect them from insects.",
        "exampleB": "Excessive use of pesticide can contaminate the soil and harm wildlife.",
        "exampleC": "Organic farming methods aim to reduce or eliminate the need for pesticide.",
        "status": "seen"
    },
    {
        "id": "c48c5c64-dedf-4a11-b46d-8af2d58e4d8b",
        "word": "pesticides",
        "persian": "معادل فارسی \"pesticides\" آفت‌کش‌ها یا سموم دفع آفات است که برای از بین بردن آفات گیاهی و کشاورزی به کار می‌روند.\n",
        "definition": "Pesticides are substances used to control or eliminate unwanted organisms (pests) that can harm crops, livestock, or human health. These chemicals can be insecticides (killing insects), herbicides (killing weeds), fungicides (killing fungi), or other types, depending on the target pest. While pesticides can improve crop yields and prevent disease spread, their overuse can also lead to environmental damage and health risks.\n\nSynonyms: agricultural chemicals, biocides, pest controls, pest killers\n",
        "exampleA": "Farmers use pesticides to protect their crops from insects and diseases.",
        "exampleB": "The overuse of pesticides can have harmful effects on the environment.",
        "exampleC": "Organic farming avoids the use of synthetic pesticides.",
        "status": ""
    },
    {
        "id": "b6497ba3-b683-4acc-8a94-96490b86fa3f",
        "word": "petal",
        "persian": "گلبرگ",
        "definition": "A petal is one of the colorful, modified leaves that form the corolla of a flower. Petals often attract pollinators with their vibrant colors, patterns, and fragrances. They protect the reproductive parts of the flower and, in some cases, provide a landing platform for insects.\n\nSynonyms: flower leaf, floral leaf, corolla segment.\n",
        "exampleA": "rose petals",
        "exampleB": "A single petal drifted gently from the rose, landing on the table.",
        "exampleC": "The vibrant colors of each petal created a stunning floral display.",
        "status": "seen"
    },
    {
        "id": "e71c44ac-d3e6-4db9-9e98-1ad0bd7728c1",
        "word": "plant",
        "persian": "کاشتن گیاه، غرس کردن",
        "definition": "\"Plant\" refers to a living organism that typically produces its own food through photosynthesis, using sunlight, water, and carbon dioxide. It generally has roots, stems, and leaves, and is stationary. These organisms are a fundamental part of ecosystems, providing oxygen and food for other living things.\n\nSynonyms: flora, vegetation, greenery, herb.\n",
        "exampleA": "We planted trees and bushes in our new garden.",
        "exampleB": "We need to plant more trees to help the environment.",
        "exampleC": "That manufacturing plant employs over five hundred people.",
        "status": "learned"
    },
    {
        "id": "53b487bb-8f34-4dfd-ac54-56ba7838a37c",
        "word": "predator",
        "persian": "حیوان شکارچی",
        "definition": "A predator is an animal that hunts and kills other animals for food. This act of predation is a crucial part of maintaining balance in ecosystems. Predators use various strategies to capture their prey, often relying on speed, stealth, or specialized hunting tools.\n\nSynonyms: hunter, carnivore, killer, marauder\n",
        "exampleA": "The lion is a formidable predator, hunting gazelles on the African savanna.",
        "exampleB": "Cybercriminals are online predators who target vulnerable individuals.",
        "exampleC": "The new policy aims to protect small businesses from predatory lending practices.",
        "status": "seen"
    },
    {
        "id": "69450733-d93e-4871-a44d-64d5580b881c",
        "word": "prey",
        "persian": "طعمه",
        "definition": "\"Prey\" refers to an animal that is hunted and killed by another animal for food. It represents the victim in a predator-prey relationship, the animal that is vulnerable and pursued.\n\nSynonyms: quarry, victim, target, kill, game.\n",
        "exampleA": "A hawk hovered in the air before swooping on its prey.",
        "exampleB": "The lion stalked its prey through the tall grass.",
        "exampleC": "Unsuspecting tourists are easy prey for pickpockets.",
        "status": "seen"
    },
    {
        "id": "362691f2-1d94-42cf-b926-0eee750a7af5",
        "word": "repercussions",
        "persian": "بازتاب های یک اتفاق، بارتاب",
        "definition": "\"Repercussions\" refer to the usually unintended consequences or effects of an action or event. They often carry a negative connotation, implying that the consequences are undesirable or problematic, arising as a result of a previous action.\n\nSynonyms: consequences, ramifications, aftereffects, fallout, impact.\n",
        "exampleA": "Any decrease in tourism could have serious repercussions for the local economy.",
        "exampleB": "His decision to ignore the warning had serious repercussions for the entire team.",
        "exampleC": "The environmental repercussions of the oil spill are still being felt decades later.",
        "status": "seen"
    },
    {
        "id": "d601bb55-9e61-4919-b492-c4c8b84787e8",
        "word": "resistant",
        "persian": "\"resistant\" بسته به متن می‌تونه معانی مختلفی داشته باشه، اما به طور کلی می‌شه اون رو به این صورت ترجمه کرد: \"مقاوم\"، \"پایدار\"، \"ضد\"، یا \"دیرجوش\". انتخاب دقیق‌ترین معادل بستگی به این داره که \"resistant\" در چه زمینه‌ای استفاده شده.\n",
        "definition": "\"Resistant\" means able to withstand or oppose something; it describes a quality of being unaffected or not yielding easily to a force, influence, or condition. Essentially, something resistant is difficult to change, damage, or overcome.\n\nSynonyms: immune, impervious, resilient, opposing, defiant\n",
        "exampleA": "The bacteria has become resistant to several common antibiotics.",
        "exampleB": "She was resistant to the idea of moving to a new city.",
        "exampleC": "This type of plastic is highly resistant to heat and chemicals.",
        "status": ""
    },
    {
        "id": "8e5c6b26-e1df-44d4-9df9-b1fd74f64bc1",
        "word": "resistant (to sth)",
        "persian": "مقاوم",
        "definition": "\"Resistant (to something)\" means having the ability to withstand or oppose the effects of something, be it a force, influence, or substance. It implies a degree of resilience or immunity, making it difficult for the \"something\" to have its intended impact. For example, a person might be resistant to a disease, or a material might be resistant to corrosion.\n\nSynonyms: immune, impervious, unaffected, resilient, proof against.\n",
        "exampleA": "The bacteria is resistant to several common antibiotics.",
        "exampleB": "He was resistant to the idea of trying new foods.",
        "exampleC": "The material is highly resistant to scratches and damage.",
        "status": "seen"
    },
    {
        "id": "b20be384-2fe5-4e47-a5a9-8811142cac0e",
        "word": "rocky ground",
        "persian": "زمین سنگلاخی",
        "definition": "\"Rocky ground\" refers to terrain characterized by the presence of numerous rocks, stones, and boulders on or near the surface, making it difficult to cultivate or traverse. It suggests a landscape that is uneven, rugged, and potentially challenging to navigate or build upon.\n\nSynonyms: Stony ground, rugged terrain, rocky landscape, boulder-strewn earth.\n",
        "exampleA": "The hikers struggled to maintain their footing on the rocky ground.",
        "exampleB": "We had to be careful driving the truck across the rocky ground.",
        "exampleC": "The vineyard wasn't thriving due to the poor soil and rocky ground.",
        "status": "learned"
    },
    {
        "id": "9ad36cd2-fa9e-442f-a2ea-2e9008ed4e19",
        "word": "rodents",
        "persian": "حیوانات جونده مثل موش",
        "definition": "\"Rodents\" are a diverse group of mammals characterized by having continuously growing incisor teeth in their upper and lower jaws, which they must constantly gnaw on to keep them short. This gnawing behavior is essential for their survival as it allows them to access food and build nests.\n\nSynonyms: gnawers, Rodentia, ratlike mammals\n",
        "exampleA": "The old house was infested with rodents, scurrying in the walls and attic.",
        "exampleB": "Farmers often use traps to control rodent populations in their fields.",
        "exampleC": "Owls are natural predators of rodents, helping to keep their numbers in check.",
        "status": "seen"
    },
    {
        "id": "2c45553f-2844-49d9-bb15-28a48a4e6070",
        "word": "scales",
        "persian": "فلس ماهی و مار",
        "definition": "\"Scales\" can refer to the overlapping protective plates that cover the skin of fish, reptiles, and some mammals. They provide armor and protection against predators and environmental damage, varying in size, shape, and composition depending on the species.\n\nSynonyms: scutes, plates, lamellae, squamae.\n",
        "exampleA": "The fishmonger carefully weighed the salmon on the scales.",
        "exampleB": "She practiced her piano scales every day to improve her technique.",
        "exampleC": "The hiker consulted the map scales to determine the distance to the summit.",
        "status": "seen"
    },
    {
        "id": "ec3aa38d-a425-48cc-8ea5-9fa2fe4beac9",
        "word": "scent",
        "persian": "بو و رایحه",
        "definition": "\"Scent\" refers to a distinctive smell, often pleasant or fragrant, that can be detected by the sense of smell. It can describe the aroma of a flower, the odor of a spice, or the perfume of a cologne. Essentially, it's the olfactory experience of something that emits a fragrance.\n\nSynonyms: aroma, fragrance, odor, perfume, redolence.\n",
        "exampleA": "The air was filled with the sweet scent of jasmine.",
        "exampleB": "The dog followed the scent, its nose twitching excitedly.",
        "exampleC": "She dabbed a small amount of perfume on her wrist, enjoying the delicate scent.",
        "status": "seen"
    },
    {
        "id": "e007e76d-48bc-4e68-b205-e77432548128",
        "word": "scorpion",
        "persian": "عقرب",
        "definition": "A scorpion is an arachnid characterized by its prominent, segmented tail that curves over its back, ending in a venomous stinger used for both defense and to immobilize prey. They are often found in arid and semi-arid environments, hunting insects and other small invertebrates.\n\nSynonyms: arachnid, stingtail, eurypterid (extinct relative)\n",
        "exampleA": "The hiker cautiously stepped over a rock, wary of a scorpion hiding beneath.",
        "exampleB": "The scorpion's venom is potent and can cause excruciating pain.",
        "exampleC": "In some cultures, scorpions are seen as symbols of protection and power.",
        "status": "seen"
    },
    {
        "id": "e96047f1-860c-4aca-9bfd-443b0fca5733",
        "word": "semi-arid",
        "persian": "منطقه نیمه خشک",
        "definition": "\"Semi-arid\" describes a climate or region that receives more precipitation than a desert but less than a humid area. It's characterized by dry conditions, limited rainfall, and sparse vegetation. These areas often experience droughts and are transitional zones between deserts and more temperate climates.\n\nSynonyms: semi-dry, subhumid, dryland\n",
        "exampleA": "The semi-arid climate of the region makes farming a challenge.",
        "exampleB": "Cacti and drought-resistant shrubs thrive in the semi-arid environment.",
        "exampleC": "Water conservation is crucial in semi-arid regions to combat desertification.",
        "status": "seen"
    },
    {
        "id": "cebb7257-cea9-44c0-8795-f3bc2b5a910f",
        "word": "shrub",
        "persian": "درختچه",
        "definition": "A shrub is a woody plant that is smaller than a tree and has multiple stems arising from or near the ground, rather than a single trunk. Shrubs typically range in height from a few inches to several meters and are a common component of many ecosystems.\n\nSynonyms: bush, scrub, underbrush\n",
        "exampleA": "The gardener carefully pruned the overgrown shrub.",
        "exampleB": "A small bird nested in the dense branches of the shrub.",
        "exampleC": "The landscaping design included a variety of flowering shrubs.",
        "status": "seen"
    },
    {
        "id": "49955679-2b76-4eb6-95ad-fc8118bf6620",
        "word": "soil",
        "persian": "خاک",
        "definition": "Soil refers to the unconsolidated mineral or organic material on the immediate surface of the Earth that serves as a natural medium for the growth of land plants. It's a complex mixture of minerals, organic matter, water, air, and living organisms, which interact to support plant life and influence the environment. In simpler terms, it's the dirt or ground in which plants grow.\n\nSynonyms: earth, ground, dirt, loam, topsoil\n",
        "exampleA": "The farmer tested the soil to determine its nutrient content.",
        "exampleB": "Erosion can strip away valuable topsoil, leaving the land infertile.",
        "exampleC": "The plant grew quickly once it was placed in rich, fertile soil.",
        "status": "learned"
    },
    {
        "id": "80a89415-3982-4f6e-b860-0b3e32a10feb",
        "word": "species",
        "persian": "گونه حیوانات",
        "definition": "A species is a group of living organisms that can interbreed naturally to produce fertile offspring, and are reproductively isolated from other groups. This means that members of the same species share a common gene pool and evolutionary history.\n\nSynonyms: Kind, sort, variety, breed, type.\n",
        "exampleA": "The scientists discovered a new species of beetle in the Amazon rainforest.",
        "exampleB": "Conservation efforts are crucial to protect endangered species from extinction.",
        "exampleC": "Humans are a highly adaptable species, capable of surviving in diverse environments.",
        "status": "seen"
    },
    {
        "id": "bc7d4df6-a64c-4324-bd37-ffb5cf937498",
        "word": "subtropical",
        "persian": "نیمه گرمسیری",
        "definition": "Subtropical refers to a geographic zone or climate that is transitional between tropical and temperate regions. It's generally characterized by hot, humid summers and mild to cool winters, with infrequent frosts. These areas don't experience the extreme cold of temperate zones or the consistently high temperatures of tropical zones.\n\nSynonyms: Near-tropical, semitropical, warm temperate.\n",
        "exampleA": "Miami's subtropical climate attracts tourists year-round.",
        "exampleB": "The lush vegetation hinted at the region's subtropical location.",
        "exampleC": "Many unique fruits thrive in subtropical environments.",
        "status": "seen"
    },
    {
        "id": "26f02cb9-cd3f-438c-8c37-6afe2b1f09fa",
        "word": "thorn",
        "persian": "خار گیاهان",
        "definition": "A \"thorn\" is a sharp, pointed outgrowth on a plant stem, often serving as a defense mechanism against herbivores. It can also be used metaphorically to describe something that causes persistent annoyance, pain, or difficulty.\n\nSynonyms: spine, prickle, barb, irritant, nuisance.\n",
        "exampleA": "The rose was beautiful, but the thorn pricked my finger.",
        "exampleB": "He's been a thorn in my side ever since he joined the team.",
        "exampleC": "The economic crisis was a thorn in the government's efforts to improve living standards.",
        "status": "seen"
    },
    {
        "id": "ada2dd42-7730-4542-9c07-abf180be4e62",
        "word": "tolerate",
        "persian": "سازگاری کردن، کنار آمدن با، پذیرفتن",
        "definition": "To tolerate something means to endure or put up with it, even if it's unpleasant or undesirable. It implies allowing something to exist, happen, or be done without actively opposing or trying to change it, often because one lacks the power or desire to prevent it.\n\nSynonyms: endure, bear, stand, accept, permit.\n",
        "exampleA": "I won't tolerate lying.",
        "exampleB": "I cannot tolerate such rude behavior.",
        "exampleC": "She had to tolerate the noise from the construction next door.",
        "status": "learned"
    },
    {
        "id": "bd7c983d-34be-4371-b9c5-f3669dace59b",
        "word": "tropical",
        "persian": "گرمسیری، استوایی",
        "definition": "\"Tropical\" describes something related to or characteristic of the tropics, which is the region of the Earth near the Equator. This area typically experiences warm to hot temperatures year-round with high humidity and abundant rainfall, and often hosts lush vegetation and diverse ecosystems.\nSynonyms: equatorial, torrid, sweltering, subtropical.\n",
        "exampleA": "The vibrant colors of the coral reef hinted at the thriving tropical ecosystem beneath the waves.",
        "exampleB": "We escaped the winter chill for a week in a tropical paradise, complete with swaying palm trees and turquoise waters.",
        "exampleC": "The botanical garden featured a special exhibit showcasing the diverse flora from tropical rainforests around the world.",
        "status": "seen"
    },
    {
        "id": "b146e068-4766-4a14-b796-74c77ff8ba1b",
        "word": "tulip",
        "persian": "گل لاله",
        "definition": "A tulip is a brightly colored, cup-shaped flower belonging to the genus Tulipa, known for its elegance and variety of forms and colors. Typically blooming in the spring, tulips are popular ornamental plants grown from bulbs in gardens and are often used in floral arrangements.\n\nSynonyms: Tulipa, bulb flower, spring bloom.\n",
        "exampleA": "The garden was a riot of color, with red and yellow tulips swaying in the breeze.",
        "exampleB": "She received a bouquet of pink tulips for her birthday.",
        "exampleC": "The artist carefully painted each petal of the tulip, capturing its delicate beauty.",
        "status": "seen"
    },
    {
        "id": "6dd24454-4f9e-4219-87a4-7d5ecb2da2b7",
        "word": "twig",
        "persian": "ترکه، تکه چوب درخت",
        "definition": "A twig is a small, slender, woody shoot growing from a branch or stem of a tree or shrub. It's essentially a very small branch, often bearing buds or leaves.\n\nSynonyms: sprig, shoot, offshoot, branchlet.\n",
        "exampleA": "The bird carefully carried a twig to build its nest.",
        "exampleB": "I snapped a small twig off the tree and chewed on it nervously.",
        "exampleC": "The children used twigs as swords in their imaginative game.",
        "status": "seen"
    },
    {
        "id": "09cf3ad9-1c89-4ff8-9722-2a5f143e0c8e",
        "word": "vegan",
        "persian": "گیاهخوار",
        "definition": "\"Vegan\" describes both a diet and a lifestyle that excludes all animal products. Vegans abstain from consuming meat, poultry, fish, dairy, eggs, and often honey. Beyond food, veganism extends to avoiding products tested on animals or containing animal-derived ingredients, such as leather, fur, and some cosmetics. It's driven by ethical, environmental, and health concerns regarding animal welfare and sustainability.\n\nSynonyms: Plant-based, herbivorous (referring to diet), cruelty-free (referring to lifestyle).\n",
        "exampleA": "Vegans get all the protein they need from nuts, seeds, and cereals.",
        "exampleB": "The restaurant offers a wide variety of vegan options, including a delicious lentil soup.",
        "exampleC": "She decided to go vegan for ethical reasons and to improve her health.",
        "status": "learned"
    },
    {
        "id": "88c8acca-ec17-4702-859d-ade760c09b0c",
        "word": "vegetation",
        "persian": "پوشش گیاهی",
        "definition": "\"Vegetation\" refers to the plant life that grows in a particular region or habitat. It encompasses all types of plants, from trees and shrubs to grasses, herbs, and even mosses and algae, considered collectively. It's a broad term describing the green covering of the earth.\n\nSynonyms: flora, plant life, greenery, foliage.\n",
        "exampleA": "The lush vegetation provided shelter for a variety of animals.",
        "exampleB": "The drought decimated the vegetation, leaving the landscape barren.",
        "exampleC": "Coastal vegetation plays a vital role in preventing soil erosion.",
        "status": "seen"
    },
    {
        "id": "df37761c-dc90-42ff-a471-d8bb060ca74b",
        "word": "vermin",
        "persian": "\"Vermin\" در فارسی معمولاً به موجودات موذی و آفت‌زا مانند حشرات، جوندگان و انگل‌هایی که باعث آزار، انتقال بیماری یا آسیب به محصولات و اموال می‌شوند، اشاره دارد. می‌توان آن را به \"آفات\"، \"حشرات موذی\" یا \"جانوران موذی\" ترجمه کرد.\n",
        "definition": "\"Vermin\" refers to animals or insects that are considered pests or nuisances, often because they carry disease, damage property, or are otherwise unwanted. The term typically implies that these creatures are difficult to control and breed rapidly, leading to unsanitary or destructive conditions.\n\nSynonyms: pests, parasites, rodents, insects, unwanted creatures.\n",
        "exampleA": "The farmer saw the vermin scurrying across his fields, destroying his crops.",
        "exampleB": "Pest control is essential to keep vermin like mice and rats out of your home.",
        "exampleC": "The abandoned building was infested with vermin, making it unsafe to enter.",
        "status": ""
    },
    {
        "id": "5b83492e-bb3f-4fc8-b4cd-f6925ef30b75",
        "word": "vermins",
        "persian": "جانوران موذی",
        "definition": "\"Vermin\" refers to troublesome or objectionable animals, especially those that carry disease or damage crops, livestock, or property. It's a broad term, often applied to creatures considered pests and unwanted by humans due to their destructive or unhygienic nature.\n\nSynonyms: pests, rodents, insects, parasites, unwanted creatures.\n",
        "exampleA": "The old house was infested with vermins.",
        "exampleB": "Farmers often use pesticides to protect their crops from vermins.",
        "exampleC": "The sanitation department worked hard to eliminate the vermins from the city streets.",
        "status": "seen"
    },
    {
        "id": "2122ff93-4923-44d6-8753-280485ff508b",
        "word": "vulnerable",
        "persian": "آسیب پذیر ، حساس ،",
        "definition": "Vulnerable means susceptible to physical or emotional harm. It describes a state of being open to attack, easily hurt, or unable to protect oneself from negative influences. It suggests a lack of defenses or a weakness that can be exploited.\n\nSynonyms: exposed, susceptible, defenseless, weak, fragile.\n",
        "exampleA": "The old woman felt vulnerable walking alone at night.",
        "exampleB": "Hackers often target systems with known vulnerabilities.",
        "exampleC": "Children are particularly vulnerable to exploitation.",
        "status": "seen"
    },
    {
        "id": "6e25b8b5-02f1-43cc-ab8f-29cdc750cfde",
        "word": "waterway",
        "persian": "مسیر آبی",
        "definition": "A waterway is any navigable body of water, either natural or artificial, used for travel and transportation. It can include rivers, canals, lakes, and even parts of the ocean, as long as vessels can use it to move goods and people.\n\nSynonyms: channel, watercourse, canal, passage, river.\n",
        "exampleA": "The barge slowly navigated the narrow waterway.",
        "exampleB": "Pollution in the waterway threatens the local ecosystem.",
        "exampleC": "The city's history is closely tied to its extensive waterway system.",
        "status": "learned"
    },
    {
        "id": "503ed1d0-0510-4089-b8f3-74ed03480b47",
        "word": "weed",
        "persian": "علف هرز",
        "definition": "\"Weed\" is a general term for any plant that is considered undesirable in a particular location, especially in a garden, lawn, or agricultural field. This undesirability stems from the plant's competition with desired plants for resources like sunlight, water, and nutrients, or because it's simply considered unsightly or invasive. Ultimately, what constitutes a weed is subjective and depends on the context.\n\nSynonyms: unwanted plant, invasive plant, nuisance plant, wild plant\n",
        "exampleA": "The gardener diligently pulled the weeds from the flowerbed.",
        "exampleB": "The athlete worked hard to weed out any bad habits that hindered their performance.",
        "exampleC": "A strong wind can easily spread weed seeds across a field.",
        "status": "learned"
    },
    {
        "id": "e9805dcd-be81-4114-b231-b5b405fc2b66",
        "word": "wild",
        "persian": "\"Wild\" بسته به متن می‌تونه معانی مختلفی داشته باشه، اما رایج‌ترین ترجمه‌هاش این‌ها هستن:\n\n   وحشی: برای حیوانات، گیاهان یا مناظر طبیعی که رام نشده یا دست‌نخورده باشن.\n   بی‌مهار: برای رفتار یا احساسات شدید و کنترل‌نشده.\n   خطرناک: برای موقعیت‌ها یا چیزهایی که پیش‌بینی‌ناپذیر و بالقوه آسیب‌رسان هستن.\n   عجیب/غریب: در مفهوم عامیانه، برای توصیف چیزهای غیرعادی و جالب.\n",
        "definition": "\"Wild\" describes something that is untamed, uncontrolled, or existing in a natural, uncultivated state. It can refer to animals or plants living independently of human control, landscapes that are untouched by civilization, or even behavior characterized by recklessness and lack of restraint. Essentially, it implies a freedom from domestication or regulation.\n\nSynonyms: untamed, feral, savage, natural, unruly.\n",
        "exampleA": "The children ran wild in the park, chasing each other and laughing.",
        "exampleB": "She had a wild imagination and could create the most fantastical stories.",
        "exampleC": "The storm turned the sea wild, with waves crashing against the shore.",
        "status": ""
    },
    {
        "id": "1596366f-1c8c-4a7d-9d53-261fb429a260",
        "word": "woodland",
        "persian": "درختزار، جنگل",
        "definition": "\"Woodland\" refers to land covered with trees and shrubs, typically forming a moderately dense canopy. It's a habitat characterized by a significant presence of trees, but often with enough sunlight reaching the forest floor to support understory vegetation. A woodland is generally less dense and more open than a forest.\n\nSynonyms: forest, woods, copse, grove, timberland\n",
        "exampleA": "We enjoyed a peaceful walk through the dense woodland.",
        "exampleB": "Many species of birds make their home in the woodland.",
        "exampleC": "The woodland floor was covered in fallen leaves.",
        "status": "learned"
    }
]